{"title":"Extreme.Male.Beauty.S01E02.WS.PDTV.XviD-FTP","uid":5983484,"size":377334104,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:001401df1a49a31cf3b1cecdc61e1e7a12248de1&amp;dn=Extreme.Male.Beauty.S01E02.WS.PDTV.XviD-FTP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"gorgon99","files":28,"time":1290657686,"description":"Extreme Male Beauty was adocumentary series which began airing on Channel 4 in May 2009 and featured television presenter Tim Shaw as he explored the various lengths men will go to in order to achieve the beauty standards placed on them. The series criticized the modeling industry and the 'perfect' body images shown in the media.\n\nEpisode 2 -\nHaving spent two weeks trying to increase the size of his pecs, Tim turns to a more personal project - getting a bigger penis.\n\nPenis enlargement ops are hugely on the increase, and Tim sits in on the very latest procedure, in which a man has an artificial filler - previously used for boob jobs - injected into the shaft of his penis. Tim also tries out a variety of gadgets and exercises that claim to make the penis bigger, from pumps to stretchers, and heads to the locker room for an all-male chat to find out if the average man is worried about the size of his manhood.\n\nWe also meet 33-year-old Edward Evans, who has never had a girlfriend and is looking for love. Having lost 17 stone, he needs radical surgery to take away all the sagging skin and give him the confidence to find romance.\n\nMore guys strip off and reveal their buff bodies as they battle it out to become the new cover star for male grooming bible Men's Health.\n\nThis is the episode that featured Tim and four other men, a wall with holes in it and a roomful of women. 'nuff said.","torrent":{"xt":"urn:btih:001401df1a49a31cf3b1cecdc61e1e7a12248de1","amp;dn":"Extreme.Male.Beauty.S01E02.WS.PDTV.XviD-FTP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"001401df1a49a31cf3b1cecdc61e1e7a12248de1","infoHashBuffer":{"type":"Buffer","data":[0,20,1,223,26,73,163,28,243,177,206,205,198,30,30,122,18,36,141,225]},"announce":[],"urlList":[]}}