{"title":"Hall &amp; Oates - Home for Christmas","uid":6024513,"size":370094649,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:00a7d9e6be7c5864b6f52b18d53af2a72769f4be&amp;dn=Hall+%26+Oates+-+Home+for+Christmas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ddawg","files":-1,"time":1291892274,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/61ERRVS053L._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/61ERRVS053L._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Home for Christmas\nArtist: Hall &amp; Oates\nAudio CD (September 25, 2007)\nOriginal Release Date: October 3, 2006\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Overture/The First Noel\n02. It Came Upon a Midnight Clear\n03. No Child Should Ever Cry on Christmas\n04. Everyday Will Be Like a Holiday\n05. Home for Christmas\n06. Christmas Must Be Tonight\n07. Children Go Where I Send Thee\n08. Mary Had a Baby\n09. Christmas Song\n10. Jingle Bell Rock\n11. Oh Holy Night\n\n\nAmazon Description:\n2006 holiday offering from the dynamic duo. Call it a masterpiece, a labor of love or the beginning of a new tradition, Daryl Hall &amp; John Oates release Home For Christmas, a beautifully recorded and heartfelt Holiday album. 11 new yuletide recordings including nine classics and semi-obscure treats plus two new self-penned Christmas tunes. **Please note that the U.S. pressing of this album is only available at selected retail chain stores.\n\nAllMusic Review:\nAs one of the biggest-selling duos in pop music history, it makes perfect sense for Daryl Hall and John Oates to make a Christmas album: any artist with such enduring popularity certainly has an audience waiting to hear them singing seasonal songs, and they made one of the greatest Christmas videos of early MTV with their cheerfully silly &quot;Jingle Bell Rock.&quot; That kind of built-in audience is one of the reasons musicians play it safe when they make holiday albums, but fortunately Hall &amp; Oates don't fall into that trap on 2006's Home for Christmas. There certainly are a fair share of familiar songs here -- this opens with &quot;The First Noel&quot; and &quot;It Came Upon a Midnight Clear,&quot; and closes with &quot;The Christmas Song,&quot; &quot;Oh Holy Night&quot; and a revival of &quot;Jingle Bell Rock&quot; -- and the album has smooth, slick veneer that's friendly and comforting. But within the conventions of a holiday album, Hall &amp; Oates actually cover a lot of ground, touching on their early folky roots on their arrangement of &quot;It Came Upon a Midnight Clear,&quot; covering Robbie Robertson's quite wonderful &quot;Christmas Must Be Tonight,&quot; unearthing William Bell and Booker T. Jones' excellent &quot;Everyday Will Be Like a Holiday,&quot; singing spirited gospel on &quot;Children Go Where I Send Thee&quot; and contributing two very good originals in Oates' soulful &quot;No Child Should Ever Cry on Christmas&quot; and Hall's title track (which was also co-written by T-Bone Wolk and Greg Bieck, who also produced the album with Hall). The result is the rare holiday album that feels familiar yet fresh, and there's enough variety here to make this a Christmas record that will hold up well over the years.","torrent":{"xt":"urn:btih:00a7d9e6be7c5864b6f52b18d53af2a72769f4be","amp;dn":"Hall+%26+Oates+-+Home+for+Christmas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00a7d9e6be7c5864b6f52b18d53af2a72769f4be","infoHashBuffer":{"type":"Buffer","data":[0,167,217,230,190,124,88,100,182,245,43,24,213,58,242,167,39,105,244,190]},"announce":[],"urlList":[]}}