{"title":"Universal.Explorer.v5.0","uid":5939417,"size":3457682,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0131b3ab81dac55b9b7cde5d924023e17687e919&amp;dn=Universal.Explorer.v5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"jinualex","files":1,"time":1289085524,"description":"Please seed after downloading.\n\n\nUniversal Explorer (UE) 5.0\n\nUniversal Explorer (UE) - a super turbo-charged Windows Explorer File Manager - plus more!!\n\nIt is a powerful Windows Explorer replacement software designed to replace the rather restricted features of the standard Windows Explorer File Manager. It is fully featured and offers many advantages to Windows Explorer.\n\nWith Universal Explorer, you can manage your files (move/copy/paste/delete) quickly and effectively. Plus, you can also VIEW and EDIT almost any file directly in UE with built-in File Viewer Windows! View and Edit text documents, HTML, a wide range of graphic files, programming source code and more. You can even view Microsoft Word and Excel documents without launching Word or Excel.\n\nUniversal Explorer offers a full Archive Manager (Archive Extractor) that allows you to create, view, edit, file and text search, convert and extract compressed files using multiple formats (ace, arc, arj, bh, cab, qz, jar, lha, lzh, rar, tar, zip, zoo). A Make .EXE option is included to turn a compressed file into a self-extracting Windows executable (.exe) file.\n\nIn addition, UE comes fully loaded with a wide range of great utility tools: Find Files, Search Text, Replace Text, Split File, Encrypt/Decrypt, Disk Copy, Directory Size, Directory Printer, Directory Compare, Set Properties, Batch Rename, Slide Show, Thumbview, Screen Capture, Calculator, ASCII List, Color List, System Information and Hex Window. \n\nv5.0 (Released 09.07.2008):\n\n * Improved file browsing speed\n\n * Improved &quot;System Information&quot; Tool. Added information about hard disks\n\n * Improved video files visualization. Added full screen mode for video previewing\n\n * Added possibility to preview .PDF files\n\n * Improved Excel files visualization. Added possibility to copy cells to clipboard\n\n * Vista support is added\n\n * Minor bug fixes\n\n","torrent":{"xt":"urn:btih:0131b3ab81dac55b9b7cde5d924023e17687e919","amp;dn":"Universal.Explorer.v5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0131b3ab81dac55b9b7cde5d924023e17687e919","infoHashBuffer":{"type":"Buffer","data":[1,49,179,171,129,218,197,91,155,124,222,93,146,64,35,225,118,135,233,25]},"announce":[],"urlList":[]}}