{"title":"Democracy Now - 16 dec 2010","uid":6044862,"size":453221494,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0393c674e3c39642fbc3633724f914914abd197d&amp;dn=Democracy+Now+-+16+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1292516543,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 16, 2010\n\n- British Court Upholds Bail for Assange\n- U.S. Seeks Evidence of Assange-Manning Ties\n- Intel Assessment Differs from Pentagon on Afghan War\n- Red Cross: Afghan Conditions at Worst Point in 30 Years\n- U.S. Sues BP, 8 Other Firms for Gulf Coast Oil Spill\n- House to Vote on Tax Cut Deal After Senate Approval\n- House Votes to Repeal &quot;Don't Ask, Don't Tell&quot;\n- Italy Ups Sentences of CIA Agents in 2003 Kidnapping\n- Arab States: No Mideast Talks Without U.S. Proposal\n- Human Rights Court Orders Brazil to Overturn Amnesty Law\n- NRA Opposition Stalls Federal Anti-Gun Trafficking Plan\n- Fox News Ordered Reporters to Question Climate Change Data\n- Military Vets to Hold Antiwar Protest at White House\n\n\nSpecial reports\n\n- New York City Consultants Charged in $80M Waste, Fraud Scheme\n\nFour consultants hired to eliminate waste and fraud in New York City's municipal payroll have been arrested on charges of stealing $80 million from city coffers. Democracy Now! co-host and New York Daily News columnist Juan Gonzalez was the first to reveal waste and bloat at New York's &quot;CityTime&quot; payroll program.\n\n\n- As WikiLeaks' Assange Freed on Bail, Alleged Military Leaker Bradley Manning Imprisoned Under Inhumane Conditions\n\nA High court in London has upheld a decision to grant bail to WikiLeaks founder Julian Assange. But what about US Army Private Bradley Manning? The army intelligence analyst has been held for the last seven months on suspicion of leaking the massive trove of government documents to WikiLeaks. Manning. Salon.com blogger Glenn Greenwald says Manning is being held under conditions that constitute cruel and inhumane treatment-and even torture.\n\n\n- Fmr. Guyanese Politician Convicted of Terror Plot in Latest Case of Alleged Gov't Entrapment\n\nThe U.S. federal government is coming under increasing scrutiny for its use of informants in terror-related cases. On Wednesday, Abdul Kadir, a former politician from Guyana, was sentenced to life in prison for his role in an alleged plot to blow up New York's John F. Kennedy International Airport. In Kadir's case and two others, attorneys have claimed that the bombing plots were largely the work of federal informants. We speak to Kadir's attorney, Toni Messina.\n\n\n- Reps. Rush Holt and Raul Grijalva on House Democratic Opposition to Obama's Tax Deal With GOP\n\nThe U.S. House of Representatives is set to vote on President Obama's controversial tax deal with Republicans following its approval in the U.S. Senate. While taxes on the wealthy will decrease under the proposal, some tax experts are predicting taxes on the poor will actually increase. We speak to Democratic Congressmembers Rush Holt of New Jersey and Raul Grijalva of Arizona, who say they will vote against the deal.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0393c674e3c39642fbc3633724f914914abd197d","amp;dn":"Democracy+Now+-+16+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0393c674e3c39642fbc3633724f914914abd197d","infoHashBuffer":{"type":"Buffer","data":[3,147,198,116,227,195,150,66,251,195,99,55,36,249,20,145,74,189,25,125]},"announce":[],"urlList":[]}}