{"title":"Acronis True Image Home 2011 14.0.0 Build 6574","uid":6000268,"size":166871800,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:05acab466e1ab60886bbe0cee730908e316365c4&amp;dn=Acronis+True+Image+Home+2011+14.0.0+Build+6574&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":1,"time":1291160551,"description":"New in the build\nAdded the Video tour link. \nAdded the Bootable Media Creation item on the main page \nAdded &quot;Timeout settings&quot; allowing the user to adjust the timing of cancelling operations that would otherwise cancel automatically. \nBackups can now be sorted by name, date of creation or update, type, and size on the Home page. \nUpdated kernel in Acronis Rescue Media for better hardware support. \nUpdated Windows Libraries support (Windows 7 only). \nAdded ability to turn off and on items added by Acronis context menu and file properties \nInstallation procedure\nThe installation procedure is straightforward. Please, run the downloaded executable file and follow instructions.\n\nList of fixed issues\nAfter system recovery, the system backup status is lost and changed to &quot;not backed up yet&quot;. The user needs to browse for the backup to fix the issue. \nThe backup name is missing from the search results of Nonstop Backup. Therefore, if a user does not see a backup name in a search result, he or she should know that these files are from Nonstop Backup archives. \nPre/post commands are not saved if entered without using the Edit button. \nIf individual backup versions are deleted through Time Explorer, Acronis True Image Home 2011 does not remove them from HDD and the user has to remove them manually. \nImpossible to add partition to Nonstop Backup after its start. \nNonstop Backup stops (various issues fixed). \nAcronis True Image Home 2011 does not restart Nonstop Backup automatically after USB-storage has been reconnected. \nNonstop Backup session stops with the log error &quot;No such interface supported&quot; if there's not enough free space on a storage disk. \nIt is impossible to explore inactive storages of Nonstop Backup. \nComputer may hang if it is left unattended with Nonstop Backup running. \nAcronis True Image Home 2011 gives the error message &quot;Insufficient privileges&quot;, if you try to change the location or settings of NSB under the Administrator account. \nSplit backups are not deleted from the storage during clean-up. \nFile backup fails if the source data is deleted. There is no ability to deselect a non-existing backup source for a backup task. \nScheduler2 helper service prevents Windows XP from shutting down after using the &quot;At system shutdown&quot; task for the first time and rebooting for the second time after that. \nAcronis True Image Home 2011 doesn't connect to FTP if the user enters the address manually. \n&quot;Overwrite file&quot; options in disk recovery options are lost. \nThe &quot;Open backup location&quot; button is available for postponed backups but should not be. \nIt doesn't matter whether the user unchecks some files inside the folder during restore: Acronis True Image Home 2011 restores the folder with all of its contents. \nAcronis True Image Home 2011 does not remove archives from the disk when you try to delete a backup along with its task. \nWindows Live Mail hangs on startup or displays a corrupted calendar message if Nonstop Backup protection of a system partition is started. \nAcronis True Image Home 2011 crashes when trying to back up a mailbox in Microsoft Outlook 2010 x64. \nAcronis True Image Home 2011 asks for Windows credentials when backing up to a network share without password protection. \nAcronis True Image Home 2011 fails to back up files from a network share with &quot;File or folder '\\\\Server\\share\\file' cannot be found&quot;, if the share was opened in Windows. \nTo recover a deleted account with e-mail messages in the Live Mail, it is necessary to perform two recovery operations. \nList of known issues\nThere is a known conflict of Acronis True Image Home 2011 Nonstop Backup with the Avira antivirus software, which may lead to the following error on the Acronis True Image Home 2011 side after installing Avira Free AV and restarting the PC: &quot;Operation has been aborted. The item essence is incorrect. Probably metadata in the file archive is corrupted.&quot; This conflict occurs only with Avira antivirus. Other antivirus solutions do not conflict with Nonstop Backup. Both companies are working closely together to find a solution and, once known, a solution will be delivered by either Avira or Acronis. In the meantime, you can find the problem details and a workaround at http://kb.acronis.com/content/16376 \nDuring clean-up of a Nonstop Backup storage, there is no progress visible to the user and Acronis True Image Home 2011 may seem to hang. In fact, the clean-up process is in progress. The clean-up may take some time before the program returns to normal operation. \nThe &quot;Ver.&quot; column in the search results is empty if you search in file contents using the search field in Acronis True Image Home 2011 console. \nIt is possible to install Acronis Backup and Security 2010 over Acronis True Image Home 2011. \nIn Online Backup, the &quot;Missed tasks: Run at system startup&quot; option is lost during migration from 2010 to 2011 version. User needs to re-select it manually after completing upgrade. \nWhen using Acronis Rescue Media, a confusing message &quot;Enter the full path to the file&quot; appears if a user tries to back up to a network share. If the user waits for some time, an authorization window appears. \nAcronis Startup Recovery Manager becomes deactivated after a full disk recovery with resize, and needs to be reactivated manually. \nIf a user backs up files from two different partitions when using Online Backup, Time Explorer does not automatically switch to the latest created slice. \nIn Online Backup the ob_client_standard.exe process exits with a delay of 10-60 seconds after application exit. \nIn Online Backup the &quot;Once a day only&quot; checkbox does not work. \nIn Online Backup the storage browser is updated very slowly after completion of a large backup. \n","torrent":{"xt":"urn:btih:05acab466e1ab60886bbe0cee730908e316365c4","amp;dn":"Acronis+True+Image+Home+2011+14.0.0+Build+6574","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05acab466e1ab60886bbe0cee730908e316365c4","infoHashBuffer":{"type":"Buffer","data":[5,172,171,70,110,26,182,8,134,187,224,206,231,48,144,142,49,99,101,196]},"announce":[],"urlList":[]}}