{"title":"Queensryche - Queen Of The Reich (2nafish)","uid":6048462,"size":155975684,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:079d426089cce462c8386eb57c486f7e0b7120f7&amp;dn=Queensryche+-+Queen+Of+The+Reich+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292642513,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Queen of the Third Reich&quot; is a heavy metal song first recorded in 1981 for a demo tape by &quot;The Mob&quot;, later known as QueensrÃƒÂ¿che. &quot;Queen of the Reich&quot; was first recorded on QueensrÃƒÂ¿che (aka QueensrÃƒÂ¿che EP) along with &quot;The Lady Wore Black&quot;, &quot;Nightrider&quot;, and &quot;Blinded&quot;. The band actually had a bit of trouble getting Geoff Tate (their current singer) to sing, since he already had a band as well. The song is also featured in Grand Theft Auto: Vice City Stories\n\nThis song was also the basis for the band's new name. The spelling was altered from &quot;Queensreich&quot; to avoid connotations with Nazi Germany.\n\nThe British band Shadowkeep covered this song on the compilation album Rebellion - A Tribute to Queensryche, released on Dwell Records in 2000.\n\nNotably, Chris Collins, the first vocalist of the Progressive Metal band Dream Theater, covered this song for his audition for the band.\n\nQueensrÃƒÂ¿che is an EP by the American progressive metal band QueensrÃƒÂ¿che, released in 1983. It was originally released independently by 206 Records (run in part by the band's management). Based on the success of the EP, the band was signed to a recording contract by EMI. QueensrÃƒÂ¿che is a reflection of the band's major musical influences, Iron Maiden and Judas Priest among them.\n\nWhen the original EP was recorded in 1982, QueensrÃƒÂ¿che did not even exist. The band was then known as The Mob, and their lineup consisted of guitarists Chris DeGarmo and Michael Wilton, bassist Eddie Jackson and drummer Scott Rockenfield. Vocalist Geoff Tate was the lead singer of another local band, Myth. He had performed with The Mob on a few occasions, and was asked to join the band for the EP's recording sessions.\n\nWhen QueensrÃƒÂ¿che was released, it sold extremely well for an independent release, and received a glowing review in Kerrang! magazine. Soon after, Tate left Myth and joined QueensrÃƒÂ¿che as their full-time vocalist. In the summer of 1983, QueensrÃƒÂ¿che signed with EMI, who re-released QueensrÃƒÂ¿che. The EMI version is nearly identical to the one released on 206 Records.\n\nTo support the EP, QueensrÃƒÂ¿che embarked on their first tour and opened for Quiet Riot, Dio and Twisted Sister. The tour ended in November, and soon after the band began preparations for their first full-length album, The Warning.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:079d426089cce462c8386eb57c486f7e0b7120f7","amp;dn":"Queensryche+-+Queen+Of+The+Reich+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"079d426089cce462c8386eb57c486f7e0b7120f7","infoHashBuffer":{"type":"Buffer","data":[7,157,66,96,137,204,228,98,200,56,110,181,124,72,111,126,11,113,32,247]},"announce":[],"urlList":[]}}