{"title":"Democracy Now - 06 jan 2011","uid":6086052,"size":456492495,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:08c8daa4506cf8aeab8dae939e45fdfd380258e3&amp;dn=Democracy+Now+-+06+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1294331255,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 06, 2011\n\n- U.S. to Send 1,400 More Marines to Afghanistan\n- Nancy Pelosi Passes House Speaker Gavel to John Boehner\n- Hedge Funds Spent $10 Million to Help GOP Win Election\n- Census: 48 Million Americans Now in Poverty\n- Global Food Prices Hit Record High\n- Gene Sperling Expected To Be Tapped For Top Economic Post\n- Amnesty Report: Sexual Violence Against Women On Rise in Haiti\n- Oxfam: Haiti Is Still in Ruins A Year After Earthquake\n- U.N. Calls for 2,000 Troops For Ivory Coast\n- Pakistani Guards Questioned Over Assassination of Governor\n- Sadr Returns To Iraq After Exile in Iran\n- Israel Considers Probe of Human Rights Groups\n\n\nSpecial reports\n\n- Crackdown on Organized Labor: States Call for Wage &amp; Benefits Cuts, Urge Laws to Curb Union Influence\n\nIn states across the country, elected officials and right-wing pundits are calling not just for cuts to wages and benefits in the name of austerity, but even proposing laws to undermine labor unions' influence, and in fact, their very existence. We host a roundtable discussion with New York Times labor reporter Steven Greenhouse; Michael Zweig of the Center for Study of Working Class Life; and Art Levine of the Washington Monthly.\n\n\n- Phil Ochs: The Life and Legacy of a Legendary American Folk Singer\n\nThe legendary American folk singer Phil Ochs is widely regarded as one of the world's most influential political musicians. Rising to fame in the 1960s, Ochs used his music to both chronicle and help mobilize the labor rights, civil rights, and antiwar movements. A new documentary, Phil Ochs: There But for Fortune, has just been released chronicling Ochs' life. We speak with Phil Ochs' brother, Michael, and the director of the film, Kenneth Bowser, which premiered yesterday in New York City.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:08c8daa4506cf8aeab8dae939e45fdfd380258e3","amp;dn":"Democracy+Now+-+06+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08c8daa4506cf8aeab8dae939e45fdfd380258e3","infoHashBuffer":{"type":"Buffer","data":[8,200,218,164,80,108,248,174,171,141,174,147,158,69,253,253,56,2,88,227]},"announce":[],"urlList":[]}}