{"title":"Blue_Toad_S1_PC","uid":6009141,"size":1012473480,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:09011317bd6598accdfaff617db233f99d168aab&amp;dn=Blue_Toad_S1_PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"doodlove","files":1,"time":1291417280,"description":" Game information:\n  =================\n\n  Set in the sleepy village of Little Riddle, the main aim of the game  is to\n  follow clues to find the guilty party.  Along the way you'll also encounter\n  a variety of different and challenging puzzles which help you move  through\n  the peaceful world of Little Riddle.\n\n  You play as one of the four members of the Blue Toad Detective Agency. The\n  game can be played solo, or with up to three friends.\n\n  As one of the detectives you move around the village by selecting locations\n  on the map.  Choose your venue wisely - will  you meet the Doctor  and hear\n  his flimsy  alibi?  Or  unearth the  Station Masters  motivation? Each stop\n  provides an  opportunity to meet a  different villager and question them on\n  the minor misdemeanours taking place in Little Riddle. \n  \n  With each step of the investigation a  puzzle is played to help a  villager\n  or get further clues about the  case.  But pay attention,  you will also be\n  questioned by the Chief  Inspector about events  that take place after each\n  chilling incident.\n\n  Whodunnit?  At the end of  each episode you  will be asked  to choose  your\n  suspect  before  they  are  revealed  and  exposed in  all  their  criminal\n  capacities! \n\n  Will your powers of deductive thinking and reflective reasoning make you a\n  star detective? \n  \n  Blue Toad Murder Files: The Mysteries of Little Riddle features:\n\n  * Six separate episodes\n  * A thrilling cliff hanger at the end of every episode\n  * Over 90 puzzles, Whodunnits and cross-examinations\n  * Opportunity to play as one of four unique characters\n  * 1 - 4 co-operative multiplayer gameplay\n  * A story of mystery and intrigue\n","torrent":{"xt":"urn:btih:09011317bd6598accdfaff617db233f99d168aab","amp;dn":"Blue_Toad_S1_PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09011317bd6598accdfaff617db233f99d168aab","infoHashBuffer":{"type":"Buffer","data":[9,1,19,23,189,101,152,172,205,250,255,97,125,178,51,249,157,22,138,171]},"announce":[],"urlList":[]}}