{"title":"DVDFab Pass Key v8.0.1.0 Beta+patch","uid":6033802,"size":12715061,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:09422ce10e59f078d09933b94f8124f05bf81850&amp;dn=DVDFab+Pass+Key+v8.0.1.0+Beta%2Bpatch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Slickinator","files":2,"time":1292167936,"description":"DVDFab Passkey 8.0.1.0 Beta\n\nDVDFab Passkey 8.0.1.0 Beta (December 9, 2010)\n* New: Updated English and other language files.\n* New: Added option &quot;Remove CCI (Copy Control Information)&quot; in Blu-ray settings.\n\nDVDFab Passkey 8.0.0.9 Beta (December 7, 2010)\n* New: Updated language files.\n* New: Improved &quot;Jump to first menu when disc inserted&quot; when PathPlayer is enabled.\n* New: Improved main title selection when PathPlayer is enabled, now passkey will select correct main title for DVD &quot;Eclipse&quot;.\n* Fix: BSOD when using Ashampoo Burn Studio 9.\n* Fix: Cannot work with DVDneXtCOPY.\n\n &lt;a href=&quot;\nhttp://www.dvdfab.com/images/product_box/passkey-dvd.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dvdfab.com/images/product_box/passkey-dvd.png&lt;/a&gt;\n\nDVD Passkey is a Windows-based driver that works on-the-fly to unprotect encrypted DVD discs. It can remove all known DVD copy protections and region codes just in seconds to help you watch any DVD movie with no limitation, allows you to use any software to access unencrypted DVD contents to copy, burn, clone them, and so on.\n\n\n* Remove all known DVD protections\n* Work with other software to access unencrypted DVD content\n* Allow you to watch any DVD without any limit\n\nOverview of Passkey for DVD\n\nPasskey for DVD is a great DVD decrypter, which can remove all the DVD copy protections and help you get rid of region code troubles.\nSo, you can freely watch any DVD just on your region specific player. Not enough! Besides the &quot;freely enjoy any DVD&quot; feature, it can also work with numerous software to let you access the unprotected DVD content then go to copy, burn, clone, or do any editing you wish.\nPasskey for DVD adds new decryption data on its server all the time, and every user with internet connection can get advantage of it, so it surly can decrypt all newly released DVD movies. And for some discs, users can use local decryption data included in Passkey for DVD when disconnected from internet.\n\nOverview of Passkey for Blu-ray\n\nPasskey for Blu-ray is powerful in decryption. Any copy protections and region code are in no mean any barriers in front of it.\nWith the help of Passkey for Blu-ray, you can use other compatible software to access any Blu-ray content, to copy, clone, burn, etc. And you have absolute freedom to view Blu-ray without any region trouble.\nPasskey for Blu-ray uses a server based system for decryption, and new decryption data will always be added on the server. No need to worry about new Blu-ray protections.\n &lt;a href=&quot;\nhttp://www.dvdfab.com/passkey-for-dvd.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dvdfab.com/passkey-for-dvd.htm&lt;/a&gt;\n\n\nInstallation Info:\n1)install program and don't restart\n2)use patch and put what ever name u like \nand direct it to install folder to patch msvcr90.dll\nin C:\\Program Files\\DVDFab Passkey or C:\\Program Files(x86)\\DVDFab Passkey\ndepends on windows just look for the installed program\n4)after done right click on the passkey in your system tray by the clock\nand choose settings and then on the left click on general and then in middle\nuncheck [] check for new versions automaticly  if it updates u will lose your registration.\n5)Enjoy from Slickinator","torrent":{"xt":"urn:btih:09422ce10e59f078d09933b94f8124f05bf81850","amp;dn":"DVDFab+Pass+Key+v8.0.1.0+Beta%2Bpatch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09422ce10e59f078d09933b94f8124f05bf81850","infoHashBuffer":{"type":"Buffer","data":[9,66,44,225,14,89,240,120,208,153,51,185,79,129,36,240,91,248,24,80]},"announce":[],"urlList":[]}}