{"title":"Coast to Coast AM - 11 - 01 -10 - Bible Code Updates","uid":5963483,"size":55232692,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0957c6f87887ed5009a7678e1496279c24a347e7&amp;dn=%09Coast+to+Coast+AM+-+11+-+01+-10+-+Bible+Code+Updates&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":4,"time":1290029665,"description":"Bible Code Updates\n\nDate: 11-01-10\nHost: George Noory\nGuests: Michael Drosnin, Dr. Betty Martini\n\nFormer reporter for the Wall Street Journal, Michael Drosnin spoke about the Bible Code, and the various prophetic messages that have been gleaned from it. Based on a computer software program developed by the Israeli mathematician, Prof. Eliyahu Rips, the Bible Code finds hidden messages or phrases in equidistant letter sequences in the Hebrew language version of the first five books of the Bible. What convinced Drosnin of its reality was the correct prediction of Yitzhak Rabin's assassination, which he discovered about a year before it happened. He recounted how he tried to warn Rabin beforehand, and now meets with various intelligence agencies such as the Mossad.\n\nA year before the 2008 election, Drosnin said he found the phrase &quot;B. Obama is President&quot; in the Bible Code, and also learned that there was danger that could be prevented for Obama. He related this information to Oprah Winfrey, who was said to pass this on to Obama. Drosnin also said that according to the Bible Code, it was Barack Obama's destiny to help prevent a nuclear terrorist attack, and that he will be re-elected in 2012.\n\nAfter the 9-11 attacks, Drosnin said he found references to it in the Bible Code, with such phrases as &quot;twin towers,&quot; &quot;airplane,&quot; &quot;terror attack,&quot; and &quot;it knocked down,&quot; all encoded within a few verses. Currently, he is searching for a &quot;code key,&quot; which might help unravel some of the mysteries of the Bible Code, such as who created it. According to the Bible Code, the code key is connected to an obelisk in Jordan, he revealed.\n\nAspartame &amp; Diabetes\nFirst hour guest, Dr. Betty Martini shared updates on health problems associated with the artificial sweetener aspartame. She reported that aspartame consumption is linked to diabetes, and can exacerbate the problem. &quot;Doctors have no idea that they're not dealing with an additive,&quot; she said of aspartame-- &quot;they're dealing with an addictive, excitoneurotoxic, carcinogenic, genetically engineered drug.&quot;","torrent":{"xt":"urn:btih:0957c6f87887ed5009a7678e1496279c24a347e7","amp;dn":"%09Coast+to+Coast+AM+-+11+-+01+-10+-+Bible+Code+Updates","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0957c6f87887ed5009a7678e1496279c24a347e7","infoHashBuffer":{"type":"Buffer","data":[9,87,198,248,120,135,237,80,9,167,103,142,20,150,39,156,36,163,71,231]},"announce":[],"urlList":[]}}