{"title":"Exotic Voices Vol.3","uid":6005356,"size":377341075,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0a4cea52dd1603b7aaaf959a65533ace962fe8a9&amp;dn=Exotic+Voices+Vol.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fanclubt","files":37,"time":1291304621,"description":"Exotic Voices Vol.3.2010\n\n001. Steve Kaetzel feat. Brianna Hol - So Alone (Extended Mix)\n002. Richard Durand &amp; JES - N.Y.C.\n003. Ben Preston feat. Susie Ledge - Never Tears Apart (Club Mix)\n004. Charlie Dee - Have It All (DJ Tiesto Remix)\n005. CrossRyders feat. Three Faces - One Another (Original Mix)\n006. Marcel Woods - Tomorrow\n007. Pluton &amp; B-Fairy - Rainbow (Original Mix)\n008. Tritonal feat. Cristina Soto - Hands To Hold Me (Original Mix)\n009. Vadim Soloviev feat. Nadja - New Life (Original Mix)\n010. Zoo Brazil feat. Rasmus Kellerman - There Is Hope\n011. Chris Reece feat. Nadia Ali - The Notice (Stonebridge Summer Float Mix)\n012. Sasha Virus feat. Dilara - I still fall (Cereca remix)\n013. Temple One feat. Hannah Ray - Autumn Leaves (Estiva Remix)\n014. Matt Cerf, Jaren, Mitiska, Dash Berlin - Man On The Run (Nic Chagall Remix)\n015. Jan Johnston meets Tenishia - Flesh (Original mix)\n016. Myon &amp; Shane54 feat. Labworks - Ibiza Sunrise (Orignal Mix)\n017. Tucandeo pres. Storyline feat. Anthya - Crystal Sky (The Flyers &amp; Mike Sonar Remix)\n018. Roger Shah Presents Sunlounger feat. Inger Hansen - Breaking Waves (Richard Durand remix)\n019. Ad Brown &amp; Matt Lange feat. Kerry Leva - As The Rain Falls (Johan Gielen Remix)\n020. Strobe - Liebe (Vocal Mix)\n021. Super8 &amp; Tab feat. Jan Burton - Mercy (7 Skies Remix)\n022. Beat Service feat. Emma Lock - Cut And Run (Ralphie B's Cutting Edge Mix)\n023. Andy Tau, Touch Enable, Olivia Martyn - Over You (Deepwide Remix)\n024. Mason - You Are Not Alone (Original mix)\n025. Zoe feat. Easton - Through Loving You (Vocal Club Mix)\n026. Aly &amp; Fila feat. Denise Rivera - My Mind Is With You (W&amp;W Remix)\n027. David Forbes feat. Antonia Lucas - Because Of You\n028. Steve Birch feat. Emel - Staring At The Sun (Forever Amour) (Original Full Vocal Mix)\n029. C-Systems feat. Van Dresen - Embrace\n030. Luke Terry feat. Kerry Leva - Arpora (John O'Callaghan Remix)\n031. Susana &amp; Mike Shiver - Give Me Faith (Vocal mix)\n032. Faithless - Tweak Your Nipple (Beltek Remix)\n033. DNS Project feat. Johanna - Timestep (Andy Blueman Remix)\n034. Will Holland feat. Line Froyset - Things That Happen (Original Mix)\n035. Josh Gabriel pres. Winter Kills - My Friend (Original Mix)\n036. Mischa Daniels feat. J-Son - Where You Wanna Go (Nicky Romero remix)","torrent":{"xt":"urn:btih:0a4cea52dd1603b7aaaf959a65533ace962fe8a9","amp;dn":"Exotic+Voices+Vol.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a4cea52dd1603b7aaaf959a65533ace962fe8a9","infoHashBuffer":{"type":"Buffer","data":[10,76,234,82,221,22,3,183,170,175,149,154,101,83,58,206,150,47,232,169]},"announce":[],"urlList":[]}}