{"title":"Cyber Update Jan.2011------DB-11395 RubyReaper","uid":6105551,"size":768037807,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0a9c4edeea05bd814e0b26f7a789b58eec9191a9&amp;dn=Cyber+Update+Jan.2011------DB-11395+RubyReaper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":241,"time":1295142237,"description":"From Kink.com   ( Device Bondage )  + Pics\n\n\n\nBig tits, glasses and tats; all the motivation I need to sexually demolish her innocence. \n\nRuby is bent over backwards. It's only a matter of time before ripping off her top to present those supple silky breasts. Her pink puffy pussy is yearning for attention, but not until she begins to suffer from the position. I lock a dick and vibe into her deep and hard, and watch this suffering sweet thing cum. Using the plastic wrap, I smother her face to heighten her orgasms until her back can't take any more.\n\nFastened to the box and barred at the mouth, her cunt and inner thighs are on display. Her tits are cinched tight with rubber bands creating a pair of pulsing fleshy bulbs. Ruby makes the mistake of sharing her weakness for canes. The cane is the first thing I go for. Cane on the sensitive thighs, cane on the pussy, cane on her pressurized tits. That is just the beginning. I clamp her pussy lips to keep her pussy spread open, then fuck her with a steel dildo that had been iced for several hours. Ruby rips off the clamps chasing after her orgasms. \n\nI finish Ruby off with an inverted suspension. Tits are clamped into a tight squeeze. Arms belted back into a strappado and tied to an ass hook for good measure. Some effective whipping gets her moving around, tugging on that hook, creating an upside down song and dance. Sweet sounds of suffering should be accompanied by the terrorized cry of a cattle prod victim, only to be harmonized with her orgasmic boasts. \n\n\n\nScreens &lt;a href=&quot; http://www.devicebondage.com/site/shoot.jsp?shootId=11395&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.devicebondage.com/site/shoot.jsp?shootId=11395&lt;/a&gt;\n\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:0a9c4edeea05bd814e0b26f7a789b58eec9191a9","amp;dn":"Cyber+Update+Jan.2011------DB-11395+RubyReaper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a9c4edeea05bd814e0b26f7a789b58eec9191a9","infoHashBuffer":{"type":"Buffer","data":[10,156,78,222,234,5,189,129,78,11,38,247,167,137,181,142,236,145,145,169]},"announce":[],"urlList":[]}}