{"title":"Israeli-Leaks: War criminals exposed","uid":6035409,"size":4325387,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0dfe8f3c7cf7ab97b2a16a896ddb27b95f309fdb&amp;dn=Israeli-Leaks%3A+War+criminals+exposed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"billiewinkle","files":-1,"time":1292214699,"description":"Israeli War Criminals\n\nThe following information was received anonymously; presumably from a member of the Israeli Military. It was presented as follows:\n\nUnderlining the following people is an act of retribution and affront. They are the direct perpetrators, agents for the state of Israel that in Dec.- Jan. 2008- 2009 attacked scores of people in the besieged Gaza. The people listed here held positions of command at the time of the attack therefore not only did they perform on behalf of a murderous state mechanism but actively encouraged other people to do the same. They bear a distinctive personal responsibility. They range from low-level field commanders to the highest echelons of the Israeli army. All took an active and direct role in the offensive.\n\nIn underlining them we are purposefully directing attention to individuals rather than the static structures through which they operate. We are aligning people with actions. It is to these persons and others, Like them, to which we must object and bring our plaints to bear upon.\n\nThis information was pirated. We encourage people to seek out other such similar information, it is readily available in the public sphere and inside public officials' locked cabinets. This is a form of resistance that can be effectively sustained for a long while.\n\nThis project for one, has only just begun, do your bit so that this virtual list may come to bear upon the physical.","torrent":{"xt":"urn:btih:0dfe8f3c7cf7ab97b2a16a896ddb27b95f309fdb","amp;dn":"Israeli-Leaks%3A+War+criminals+exposed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dfe8f3c7cf7ab97b2a16a896ddb27b95f309fdb","infoHashBuffer":{"type":"Buffer","data":[13,254,143,60,124,247,171,151,178,161,106,137,109,219,39,185,95,48,159,219]},"announce":[],"urlList":[]}}