{"title":"Democracy Now - 21 jan 2011","uid":6117675,"size":447275997,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0e03d08487965011b41b573c90dd76c25914f2b7&amp;dn=Democracy+Now+-+21+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1295627137,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 21, 2011\n\n- Rep. Giffords to Be Transferred to Houston Facility\n- Republican Lawmakers Call for Deeper Spending Cuts\n- Poll: Majority Support Cutting Military Spending Over Medicare, Social Security\n- Obama Taps GE CEO for Economic Panel\n- Chinese President Hu Meets Senators in D.C.\n- 52 Killed in Iraq Suicide Bombings\n- Tunisia Mourns Slain Protesters; New Gov't Approves Amnesty Law\n- Admin Confirms Opposition to Aristide Return\n- U.S. Resumes Deportations to Haiti\n- Report: Blackwater Founder Behind Apartheid-Linked Firm's Somalia Bid\n- Probe: Mine Disaster Preventable, Massey Violated Key Regulations\n- FBI Arrests Dozens for Alleged Ties to Organized Crime\n- Criticizing Abortion Stance, Santorum Cites Obama's Ethnicity\n- U.S. Cancels &quot;Virtual Fence&quot; With Mexico\n- Verizon Sues to Block FCC Net Neutrality Regulations\n\n\nSpecial reports\n\n- Vermont Governor Peter Shumlin Moves to Create Single-Payer Healthcare System\n\nAs the House votes to repeal President Obama's healthcare reform bill, the state of Vermont is taking matters into its own hands. We speak with Vermont Governor Peter Shumlin, who is leading efforts to create a single-payer healthcare system in the state. He was voted into office after making single-payer a cornerstone of his campaign. &quot;If Vermont can get this right, the other states will follow,&quot; Shumlin says.\n\n\n- On Anniversary of Citizens United Ruling, Common Cause Calls on Justice Dept. to Investigate Scalia and Thomas Over Conflicts of Interest\n\nToday marks the one-year anniversary of the landmark Supreme Court decision, Citizens United vs. Federal Election Commission that opened the floodgates for unlimited corporate spending on election campaigns. We speak with Bob Edgar, the president of Common Cause, which has filed a petition with the U.S. Department of Justice urging it to investigate whether Justices Antonin Scalia and Clarence Thomas should have recused themselves from the case last year because of a conflict of interest.\n\n\n- Patrice Lumumba: 50 Years Later, Remembering the U.S.-Backed Assassination of Congo's First Democratically-Elected Leader\n\nThis week marks the 50th anniversary of the assassination of Patrice Lumumba, the first democratically-elected leader of what is now known as the Democratic Republic of the Congo. Lumumba's pan-Africanism and his vision of a united Congo gained him many enemies. Both Belgium and the United States actively sought to have him killed. The CIA ordered his assassination but could not complete the job. Instead, the U.S. and Belgium covertly funneled cash and aid to rival politicians who seized power and arrested Lumumba. On Jan. 17th, 1961, after being beaten and tortured, Lumumba was shot and killed.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0e03d08487965011b41b573c90dd76c25914f2b7","amp;dn":"Democracy+Now+-+21+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e03d08487965011b41b573c90dd76c25914f2b7","infoHashBuffer":{"type":"Buffer","data":[14,3,208,132,135,150,80,17,180,27,87,60,144,221,118,194,89,20,242,183]},"announce":[],"urlList":[]}}