{"title":"BBC - Planet Earth - DVD 3(NL ENG Audio DTS)(TBS)","uid":5983260,"size":4510284979,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0efa9a29ae5e157afd48fb18926488a9b0fae0e9&amp;dn=BBC+-+Planet+Earth+-+DVD+3%28NL+ENG+Audio+DTS%29%28TBS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Black-Anchor","files":-1,"time":1290647128,"description":" BBC - Planet Earth - DVD 3       \n \n \nDe bekroonde en baanbrekende natuurserie van de BBC. Planet Earth is het epische, meeslepende verhaal van het leven op aarde. Van de grootste rivieren tot de hoogste bergen, van verborgen ondergrondse grotten tot uitgestrekte woestijnen: \ndeze serie neemt je mee op een onvergetelijke reis langs de meest extreme leefomgevingen van dieren.\n\nMeer dan vijf jaar filmen, op tweehonderd locaties: Planet Earth is niets minder dan het ultieme portret van onze aarde. Een monumentale documentaireserie waarin zeldzame gebeurtenissen, onmogelijke locaties en intieme momenten van dieren zijn vastgelegd.\n\nGreat plains:\nDeze zevende aflevering gaat over savannes, steppen, toendra?s en prairies: enorme open vlaktes met de grootste concentraties van landdieren op aarde.\nIn MongoliÃƒÂ« zien we hoe duizenden gazellen op de vlucht gaan voor een ?steppebrand?. Hun graasgronden zijn vernield, maar gras is taai en herstelt zich snel.\nIn de Arctische toendra strijken miljoenen sneeuwganzen neer om te broeden. Hun jongen zijn een makkelijk doelwit voor poolvossen.\nOp de prairies van Noord-Amerika tonen imposante bizons zich van hun machokant om een wijfje te versieren. De onherbergzame Tibetaanse hoogvlakte is de geliefde biotoop van yaks en wilde ezels.\nIn India verbergen de hoge grassen niet alleen de grootste maar ook verrassend kleine zoogdieren, zoals het pygmeevarken. En op de Afrikaanse savanne zorgt waterschaarste aan een drinkplaats voor een zeldzame en fatale confrontatie tussen twee koningen van de dierenwereld: leeuwen en olifanten.\n\nJungles:\nDeze aflevering brengt ons naar de regenwouden rond de evenaar. Hoewel de oerwouden slechts 3% van het aardoppervlak innemen, leeft er liefst 50% van alle soorten dieren en planten op aarde.\nIn Nieuw Guinea zijn er 40 soorten paradijsvogels. Ze hebben hun naam niet gestolen, want ze zien er oogverblindend kleurrijk uit. Toch is de jungle een harde en vijandige biotoop, waar elk straaltje licht en elke voedselbron levensbelangrijk zijn.\nAls een oude boom sterft, ontstaat er een race van jonge planten die allemaal strijden voor hun plekje onder de zon. Ondanks de overvloed van planten zoeken olifanten in het Congolese oerwoud naar mineralen onder de grond. Daarbij komt hun sterke slurf goed van pas.\nIn Oeganda zijn we ? voor het eerst op televisie ? getuige van een stammenoorlog tussen twee groepen chimpansees waarbij de dieren niet terugdeinzen om soortgenoten te vermoorden en zich overgeven aan kannibalisme.\n\nShallow seas:\nDe negende aflevering onderzoekt de ondiepe kustwateren rond de continenten. Ze vormen de thuishaven voor het grootste deel van het leven onder water.\nRecent ontdekte koraalriffen voor de kust van IndonesiÃƒÂ« zijn een kleurrijke biotoop voor fantastische schepsels zoals pygmeezeepaardjes, ?elektrische? schelpdieren en groepen van tientallen zeeslangen die samen op jacht gaan.\nGigantische kolonies zeevogels hebben hun nesten gebouwd op de kusten van de Arabische woestijn.\nIn West-AustraliÃƒÂ« zien we hoe dolfijnen als volleerde surfers tot op het strand glijden om een prooi te vangen. In Zuid-Afrika jaagt de gevreesde witte haai, de grootste roofvis ter wereld, op zeehonden.\nEn op het eiland Marion in de Indische Oceaan moet een groep keizerspinguÃƒÂ¯ns een strand vol zeehonden oversteken. De zeehonden aarzelen niet om de pinguÃƒÂ¯ns aan te vallen, maar die bieden moedig weerstand.\n\n\n\n\nSpotinformatie \n\n\nCategorie   : Beeld \nFormaat     : DVD5 \nBron        : Retail\nAudio       : NL DD 5.1 DTS 5.1 Eng DD 5.1\nOndertitels : Nederlands (instelbaar)\nMenu        : Ja\nCover       : Ja\nGenre       : Documentaire\n  &lt;a href=&quot;\nhttp://www.google.nl/search?hl=nl&amp;q=BBC+-+Planet+Earth+-+DVD+3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.nl/search?hl=nl&amp;q=BBC+-+Planet+Earth+-+DVD+3&lt;/a&gt; \n\n\n \n \n \nBrought to you by BlackAnchor TBS\n \n \n \n","torrent":{"xt":"urn:btih:0efa9a29ae5e157afd48fb18926488a9b0fae0e9","amp;dn":"BBC+-+Planet+Earth+-+DVD+3%28NL+ENG+Audio+DTS%29%28TBS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0efa9a29ae5e157afd48fb18926488a9b0fae0e9","infoHashBuffer":{"type":"Buffer","data":[14,250,154,41,174,94,21,122,253,72,251,24,146,100,136,169,176,250,224,233]},"announce":[],"urlList":[]}}