{"title":"Beyond the rising moon (Outerworld) 1987 sci-fi","uid":6086565,"size":143268655,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:123680d4a507eadb4dd685e5a9e2c92744ffad59&amp;dn=Beyond+the+rising+moon+%28Outerworld%29+1987+sci-fi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sasha20072007","files":-1,"time":1294354206,"description":"An alien spaceship is being sought by various factions on Earth. A female cyborg and a rogue trader team up to stop evil forces from taking over the ship.\nDirector: Philip J. Cook\nWriter: Philip J. Cook\nStars:Tracy Davis, Hans Bachmann and Michael Mack\nCountry:USA \nLanguage:English \n1987\nAt first glance one might think this is going to be just a cheap SF B-movie, but if one considers how it was made (practically \\&quot;in the backyard\\&quot;), it is simply fantastic. \nA lot of care went into the production, even with the very limited constraints these independent filmmakers were working in, and one can notice this.\nOne thing: this is not a movie of the \\&quot;Spielberg-Lucas-etc.-Roller-Coaster-Ride-with Special-Effects\\&quot;-kind, so if you expect something of that sort, you will be disappointed. Though it comes with an action-style plot, this is almost a quiet movie - which is one of its charms, if one can appreciate that.\nThe story, about an female android seeking freedom and teaming up with a space pilot to find a lost alien spaceship, battling an evil corporation on the way, is no big deal, but quite nicely done, human and believable in its context - more than can be said about some multi-million-dollar-productions. The acting sometimes is a bit on the heavy side, but strangely this somehow adds to the atmosphere this film manages to produce (rare in a SF-Film nowadays), and even helps in creating a sense of wonder, which you wouldn\\'t expect in a movie on that budget ... The special effects are done with miniatures and they are in in their way almost stylish, so that you know you\\'re looking at models but you don\\'t care; one can admire what has been done here with a extremely tiny budget and how the filmmakers even managed to achieve a certain visual consistency in their film. \nI bought this video by chance, not expecting much, and now find that I\\'ve seen it several times already and will continue to see it again from time to time, because in its own unpretentious, not-quite-professional way it manages to take me into another world of infinite possibilities, and what more could one ask from an SF-movie?\n\n","torrent":{"xt":"urn:btih:123680d4a507eadb4dd685e5a9e2c92744ffad59","amp;dn":"Beyond+the+rising+moon+%28Outerworld%29+1987+sci-fi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"123680d4a507eadb4dd685e5a9e2c92744ffad59","infoHashBuffer":{"type":"Buffer","data":[18,54,128,212,165,7,234,219,77,214,133,229,169,226,201,39,68,255,173,89]},"announce":[],"urlList":[]}}