{"title":"Judas Priest - Living After Midnight (Xvid-2nafish)","uid":6029854,"size":129850462,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:12529cbbe9e6f2f1bc4bd61c9896ce49543d7a45&amp;dn=Judas+Priest+-+Living+After+Midnight+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292059301,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:46\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 3501 Kbps\nQuality Factor : 0.52 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Living After Midnight&quot; is a song by British heavy metal band Judas Priest, originally featured on their 1980 album British Steel. It is one of the band's most popular songs.\n\nOn live performances, the line, &quot;I took the city 'bout one a.m.,&quot; is sometimes changed to the particular city or venue the band is performing. For example, on the DVD Rising in the East, lead vocalist Rob Halford sings, &quot;I took the Budokan 'bout one a.m.,&quot; in reference to the stadium in Tokyo, Japan, that hosted the concert. On the Westwood One recordings from the 1983 US Festival Halford recites, &quot;I took some acid about 1 a.m....&quot;\n\nThis song has been covered by The Donnas on their album The Donnas Turn 21, by Saul Blanch on the tribute album Acero Argentino: Tributo a Judas Priest by L.A. Guns on Hell Bent Forever: A Tribute to Judas Priest and by Iron Savior as a bonus track on the Japanese release of their Condition Red album. It was recently covered by Disturbed on the Tribute to British Steel CD by Metal Hammer UK. It also appears as one of the bonus songs available with some distributions of Asylum (Disturbed album).\n\nThe guitar solo in the song is played by Glenn Tipton.\n\nBritish Steel is the sixth album by the British heavy metal band Judas Priest, released on 14 April 1980. It saw the band reprise the commercial sound they had established on Killing Machine however; this time, they abandoned many of the dark lyrical themes which had been prominent on their previous releases. British Steel was recorded at Tittenhurst Park, home of former Beatle John Lennon, after a false start at Startling Studios, a recording studio located on Tittenhurst's grounds. Sampling did not yet exist at the time of recording, so the band recorded the sounds of smashing milk bottles to be included in &quot;Breaking the Law&quot;, as well as various sounds in &quot;Metal Gods&quot; produced by billiard cues and trays of cutlery.[2] It was released in the UK at a discount price of Ã‚Â£3.99, with the advertisements in the music press bearing the legend, &quot;British Steal&quot;. Songs &quot;Breaking the Law&quot;, &quot;United&quot;, and &quot;Living After Midnight&quot; were released as singles, while the track &quot;Metal Gods&quot; earned the band members their moniker.\n\nThe album was remastered in 2001, with two bonus tracks added. Bonus track &quot;Red, White, and Blue&quot; was written in the earlier years of Priest's career. It was recorded at Compass Point Studios in Nassau in July 1985. The second bonus track, a live performance of &quot;Grinder&quot;, was recorded on 5 May 1984, in Los Angeles during the Defenders of the Faith tour.\n\nIn 2009 Judas Priest kicked off the 30th anniversary tour in the US playing the entire album live for the first time.\n\nAnthrax guitar player Scott Ian said in an interview in the documentary Heavy Metal: Louder than Life that British Steel was probably the album that really defined heavy metal, because it, according to him, did away with the &quot;last shards of blues&quot; that had otherwise been characteristic of the genre. He said, &quot;Even the title... how does it get more metal than that?&quot;\n\nThe 30th anniversary release of the album, came with a live DVD, and live CD recorded on 17 August 2009 at the Seminole Hard Rock Arena in Hollywood, Florida as part of the British Steel 30th Anniversary tour. The live versions of all the British Steel tracks from this release were also made available as downloadable content for the Rock Band series beginning 11 May 2010.\n\n\nMy Videos:\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:12529cbbe9e6f2f1bc4bd61c9896ce49543d7a45","amp;dn":"Judas+Priest+-+Living+After+Midnight+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12529cbbe9e6f2f1bc4bd61c9896ce49543d7a45","infoHashBuffer":{"type":"Buffer","data":[18,82,156,187,233,230,242,241,188,75,214,28,152,150,206,73,84,61,122,69]},"announce":[],"urlList":[]}}