{"title":"Biography Channel: Sharon Tate","uid":5941109,"size":365560697,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:12c54bbee0630169498bc2501f57faa856c014a8&amp;dn=Biography+Channel%3A+Sharon+Tate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"phatwarez","files":-1,"time":1289181272,"description":"Sharon Tate\n\nActress. Born January 24, 1943, in Dallas, Texas. Starting out in Hollywood in the early 1960s, Sharon Tate appeared in a recurring role on the television show, Beverly Hillbillies, and in bit parts in movies, including The Americanization of Emily (1964) and The Sandpiper (1965). In 1965, she landed her first real movie role in Eye of the Devil, starring David Niven and Deborah Kerr. While filming the movie in London, she met the movie director Roman Polanski after auditioning successfully for his horror spoof, The Fearless Vampire Killers (1967). The couple began a romantic relationship, and were married in January 1968.\n\nSharon Tate's breakthrough performance came in the hit 1967 film, Valley of the Dolls, based on the best-selling novel by Jacqueline Susann and co-starring Patty Duke and Susan Hayward. Also in 1968, she appeared in Don't Make Waves with Tony Curtis, and had a starring role in the comedy The Wrecking Crew, with Dean Martin. With the success of Valley of the Dolls and Polanski's creepy thriller, Rosemary's Baby (1968), they became one of the most visible couples in Hollywood.\n\nAfter completing filming on 12+1 (released in 1970) in Italy in 1969, Tate returned to Los Angeles, where she and her husband were renting a house on Cielo Drive in Bel Air. Polanski remained at the couple's home in England, working on his latest film. On August 9, 1969, the 26-year-old Tate (then eight months pregnant) was brutally murdered in her home, along with three houseguests and a teenage delivery boy, by a group of people who were later revealed as part of the &quot;Manson family,&quot; a murderous cult driven by the apocalyptic fantasies of its deranged leader, Charles Manson. Manson and four of his followers were convicted of those murders (along with two others) and sentenced to death in 1971; after California's temporary abolition of the death penalty in 1972, they are now serving life sentences and have repeatedy been denied parole.\n\nFile Size ------- 348mb\nLength ---------- 42:38\nResolution ------ 720x480\nContainer ------- mkv\nVideo Codec ----- x264\nAudio Codec ----- mp3\nFrame Rate ------ 30\n\np h a t w a r e z . t k\nThanks to (anonymous) for the generous seedbox donation.\nAlso supported by:\n &lt;a href=&quot;\nhttp://magnet-dev.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://magnet-dev.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:12c54bbee0630169498bc2501f57faa856c014a8","amp;dn":"Biography+Channel%3A+Sharon+Tate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12c54bbee0630169498bc2501f57faa856c014a8","infoHashBuffer":{"type":"Buffer","data":[18,197,75,190,224,99,1,105,73,139,194,80,31,87,250,168,86,192,20,168]},"announce":[],"urlList":[]}}