{"title":"Coast to Coast AM - 10 - 20 - 10 - Earth Changes &amp; New Science","uid":5955970,"size":55436192,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:149dfaa4271801b4f09750d506a0890e1d76a5ec&amp;dn=Coast+to+Coast+AM+-+10+-+20+-+10+-+Earth+Changes+%26+New+Science&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":4,"time":1289722801,"description":"Earth Changes &amp; New Science\nDate: 10-20-10\nHost: George Noory\nGuests: Stan Deyo, Holly Drennan Deyo, John Austin\n\nPhysicist and author Stan Deyo discussed such topics as earthquake swarms, Planet X, solar flares, UFO technology, and biblical prophecy. A comet or other body with an egg-shaped orbit might account for a 'Planet X' that cyclically approaches Earth, he said, adding that something is perturbing the orbits of Neptune and Uranus. Holly Deyo joined the conversation, and gave statistics about quake swarms in Arkansas, Oklahoma, California, and Baja, Mexico, as well as Saudi Arabia, where some 30,000 aftershocks have taken place in a volcanically active area.\n\nStan Deyo reported that the Hopi are preparing for extreme solar activity that will burn grass and trees, by building underground facilities. Solar flares will cause major disruptions including severe weather and food shortages, he suggested. Regarding UFO designs, he described how small craft can be linked together to form a triangular section, and then a fake skin can be drawn over them to create the illusion of a gigantic mile-wide spaceship.\n\nDeyo shared his belief that the New World Order is stepping up its plans, and that after America's infrastructure fails, the country will be attacked by a Russian/Chinese invasion. He also predicted that Damascus, Syria will be wiped out in the near future, triggering a global war. Citing biblical prophecy, he further warned that a great deception will fool people into accepting an alien god, in tandem with the arrival of the Antichrist. For more, see this special page the Deyos set up.\n\nAll About Zombies\nFirst hour guest, John Austin talked about zombies, and his handbook for the 'undead,' which features illustrations and diagrams. According to pop culture lore, there are three types of zombies, he said: the walking undead (reanimated people on the hunt for human brains), ragers (humans infected with rabies), and the supernatural (such as mummies guarding treasures). While these types of zombies are the stuff of science-fiction and horror, it's possible genetic or viral experiments could go awry and lead to a &quot;serious problem,&quot; Austin noted.","torrent":{"xt":"urn:btih:149dfaa4271801b4f09750d506a0890e1d76a5ec","amp;dn":"Coast+to+Coast+AM+-+10+-+20+-+10+-+Earth+Changes+%26+New+Science","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"149dfaa4271801b4f09750d506a0890e1d76a5ec","infoHashBuffer":{"type":"Buffer","data":[20,157,250,164,39,24,1,180,240,151,80,213,6,160,137,14,29,118,165,236]},"announce":[],"urlList":[]}}