{"title":"HOMO@LV (Full version)","uid":6085684,"size":1420961070,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:151ae082631467fb7059ad6f150dd8fb896c566f&amp;dn=HOMO%40LV+%28Full+version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1294274839,"description":"///////////////////////////\nTHIS IS FULL LENGHT VERSION\n///////////////////////////\n\n\nHOMO@LV, 2010\nDocumentary, 640x360, 16:9, stereo\nLanguage: Latvian, Russian, English\nSubtitles: English\n\nDirected and written by: Kaspars Goba\n\nScript advisors: Jochen Hick, Rosa von Praunheim, David Wingate\n\nCinematography: Kaspars Goba, Margeris Eglitis, Inese Apse, Elga Dudareva, Lelde Goba\n\nEditors: Gatis Belogrudovs, Visvaldis Zarakovskis\n\nProducer: Ieva Ubele\nProduction company: ELM MEDIA\n\nIn the summer of 2005, two guys came up with an idea to organise an unprecedented event - a festive lesbian, gay, bisexual and transgender people's parade through the streets of Riga, the capital of Latvia. Following the example of similar LGBT parades in Western cities, they decided to call it Pride. Little did they know that their good intention would spiral into a chain of inconceivable events lasting several years: great emotions would be stirred up and dramatically split Latvian society; the people involved would be showered, in turn, with human excrement and holy water, families would be torn apart, jobs lost, and a priest expelled from the church for free thinking. They could not have imagined that crowds of Western reinforcements would flock to support both sides or that Jesus, the devil, patriotism and human rights would all be used in the rhetoric surrounding the topic, and the press would eagerly report it all. In the end, could it be that the victims of this hostility were all those involved, because for someone, somewhere it was beneficial to set us against one another?\n\nKaspars Goba worked on this film for five years. The extensive footage collected over the years enables the spectator to get an extraordinarily deep insight into the opinions and life stories of the individuals on both the Pride and NoPride fronts.  The astonishing unearthing of Pride in Riga as shown in Kaspars Goba's work, starting from its inception in 2005 through to the announcement of Pride not being held in Riga in 2010, enables the viewer to consider these events from a different perspective. It makes one contemplate the role politicians play in manipulating people's ideals, and ask: what is the price of democracy in Latvia?","torrent":{"xt":"urn:btih:151ae082631467fb7059ad6f150dd8fb896c566f","amp;dn":"HOMO%40LV+%28Full+version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"151ae082631467fb7059ad6f150dd8fb896c566f","infoHashBuffer":{"type":"Buffer","data":[21,26,224,130,99,20,103,251,112,89,173,111,21,13,216,251,137,108,86,111]},"announce":[],"urlList":[]}}