{"title":"National Geographic Restrepo Inferno Afghanistan 2010 iTAlian DO","uid":6056756,"size":1586495488,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:154cbe759ff29c842f29510615b08d0420b3844f&amp;dn=National+Geographic+Restrepo+Inferno+Afghanistan+2010+iTAlian+DO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kumba10","files":2,"time":1292940685,"description":"Vincitore del premio del Grand Jury per la categoria documentari al Sundance Film Festival 2010, Restrepo. Inferno in Afghanistan ÃƒÂ¨ la scioccante cronaca che segue passo passo la vita di un plotone di soldati statunitensi dispiegato nella Valle di Korengal, in Afghanistan.\n\nGli autori, il fotoreporter Tim Hetherington e il giornalista/scrittore Sebastian Junger, raccontano di essere partiti con l'intenzione di &quot;catturare l'esperienza del combattimento, della noia e della paura attraverso gli occhi dei soldati. La loro vita ÃƒÂ¨ stata la nostra vita: non ci siamo seduti a parlare con le loro famiglie, non abbiamo intervistato gli afghani, non abbiamo dato spazio a dibattiti geopolitici. In questi remoti avamposti dell'Afghanistan i soldati vivono e combattono in condizioni che pochi americani in patria possono immaginare. Compredere la loro esperienza ÃƒÂ¨ importante, al di lÃƒÂ  delle convinzioni politiche di ognuno. Le convinzioni possono rappresentare un modo per evitare di guardare la realtÃƒÂ . E la realtÃƒÂ  ÃƒÂ¨ questa.&quot;\n\nIl documentario ÃƒÂ¨ interamente girato nell'estremo avamposto di Restrepo, la piccola postazione battezzata col nome di un medico militare morto in azione che i soldati statunitensi considerano una delle piÃƒÂ¹ pericolose al mondo. Un film sperimentale in cui lo sguardo resta sempre fisso nella valle, e in cui non ci sono interviste con generali o diplomatici a spezzare il continuum dell'azione. Lo scopo ÃƒÂ¨ quello di far sentire lo spettatore completamente immerso, per 94 minuti, nel cuore dell'inferno. Questa ÃƒÂ¨ la guerra, nuda e cruda, senza commenti e senza orpelli.","torrent":{"xt":"urn:btih:154cbe759ff29c842f29510615b08d0420b3844f","amp;dn":"National+Geographic+Restrepo+Inferno+Afghanistan+2010+iTAlian+DO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"154cbe759ff29c842f29510615b08d0420b3844f","infoHashBuffer":{"type":"Buffer","data":[21,76,190,117,159,242,156,132,47,41,81,6,21,176,141,4,32,179,132,79]},"announce":[],"urlList":[]}}