{"title":"Friday Trilogy. DVDR (By Rod)","uid":6019941,"size":4499820544,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:160e0c51862f3c799856062b02a5b6d177d50d24&amp;dn=Friday+Trilogy.+DVDR+%28By+Rod%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rodallenz","files":18,"time":1291771219,"description":"Friday (1995)\n\nCraig and Smokey are two guys in Los Angeles hanging out on their porch on a Friday afternoon, smoking and drinking, looking for something to do. Encounters with neighbors and other friends over the course of the day and night, and their ensuing antics, make up the rest of the movie.Two homies, Smokey &amp;Craig, smoke up a dope dealer's weed and try to figure a way to get the $200 they owe the dope dealer by 10:00pm that night. In that time they smoke weed, get jacked, and they get shot at in a drive-by.Having just been canned from his job on his day off, Craig and his best friend Smokey spend the day smoking up in their South Central neighborhood while dealing with a neighborhood bully, relationship troubles, an angry drug dealer, and a lot of other odd characters.\n\nNext Friday (2000)\n\nUncle Elroy and Day Day owe money on taxes so Craig finds a way to steal from the next door neighbors to pay off the taxes so Uncle Elroy's house doesn't get put up for auction.\n\nFriday After Next (2002)\n\nCousins Craig and Day-Day are back in the old neighborhood and ready for Christmas. Although they've left behind the security of living with their parents, at least they're on their own. The rundown apartment they now share is filled with all the accoutrements and spirit of the holiday season. It's a time for giving and joy--until Craig wakes up in the middle of the night and discovers a ghetto Santa Clause stealing their presents and anything else he can stuff into his bag--including the rent money they had hidden and stuffed into their stereo speakers. Faced with the harsh reality of having a Christmas without presents--as well as having to face the unwanted advances of their landlady's recently paroled son, if they can't pay the rent--Craig and Day are forced to score some quick cash. They go to the local strip mall where their fathers Mr. Jones and Uncle Elroy have opened Bros. Bar-B-Q restaurant and help land them jobs as unarmed security guards. While Craig handles the chaos of the Christmas Eve shopping crush, Day Day's renegade rent-a-cop tactics put the put the pair's jobs and lives in jeopardy. Nonetheless, in the process, Craig and Day-Day learn some comic lessons about the true meaning of the holiday season.\n\nLet Me Know What You Think                Please Seed","torrent":{"xt":"urn:btih:160e0c51862f3c799856062b02a5b6d177d50d24","amp;dn":"Friday+Trilogy.+DVDR+%28By+Rod%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"160e0c51862f3c799856062b02a5b6d177d50d24","infoHashBuffer":{"type":"Buffer","data":[22,14,12,81,134,47,60,121,152,86,6,43,2,165,182,209,119,213,13,36]},"announce":[],"urlList":[]}}