{"title":"FlashPeak - Slim Browser v 5.00","uid":6016888,"size":2165215,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1672b0f16aa11d45b61201c6767426995ae32858&amp;dn=FlashPeak+-+Slim+Browser+v+5.00&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KlixXxo","files":1,"time":1291661755,"description":"Slim Browser 5.00\n-----------------\n\n\nSlim Browser is a tabbed multiple-site browser. It incorporates a large collection of powerful features like built-in popup killer, skinned window frame, form filler, site group, quick-search, auto login, hidden sites, built-in commands and scripting, online translation, script error suppression, blacklist / whitelist filtering, URL Alias. It brings you convenient and comfortable browsing.\n\nSlim Browser Features\nMultiple site browser based on tab-page interface\nSeamless integration with AI RoboForm FormFiller/Password Manager\nBuilt-in Popup Killer based on intelligent identification and pre-defined filtering\nSite windows killed by mistake are FULLY RECOVERABLE\nAbility to turn on/off Flash Animation\nBuilt-in web form spell checker.\nUniversal URL Filter: Block ad banners, flash animations, iframes or any components within any web pages by URL patterns.\nBuilt-in RSS News Rendering Engine. Now you can read RSS news directly inside SlimBrowser without additional RSS Reader software.\nActiveX Filter: block obtrusive dialogs prompting you to install unsafe ActiveX controls.\nConvenient access to major search engines by Quick-Search Bar\nSeamless integration of most Internet Explorer toolbars\nScriptPad: Built-in VBScript/Jscript/HTML/Text editor. View screenshot.\nHidden Sites : hide and show a site at users' request\nSkinned window frame.\nFree-zooming of any web page.\nAutoLogin: automatically connect and log into specified website with just one click.\nSeamless integration with online translation engine and dictionaries\nAbility to suppress script error message dialog\nSite Group: Open and save a collection of sites as a group\nFlexible control of startup actions\nURL Alias: Type short alias instead long URL.\n\n\n\n\nWhat's New in Slim Browser 5.00:\n--------------------------------\n\nVersion History of Slim Browser 5.00\n\nAdded built-in Multi-threaded Download Manager which improve file download speed by several times and can resume broken downloads.\nConfig download manager options in &quot;Tools:Options:Download Manager&quot;.\nOpen download manager window by selecting &quot;View:Explorer Bars:Download Manager&quot; or click the newly added download manager button on the standard toolbar. You need customize the toolbar to add the new button if you upgrade from an older version.\nAdded capability to search/translate/define/map selected text directly from the popup menu when you right click in a web page.\nAdded capability to translate selected text from any language into any language inside a web page without leaving the page. Check the new menu items under &quot;Language&quot; Menu.\nImproved weather forcasting feature. Enable weather display on status bar by going to tools:options:weather. You can view 5-day weather forcasting details inside a dialog when you click on the weather display area on the status bar.\nAdded &quot;Quick Bookmark&quot; menu item into Favorites Menu. It can let you bookmark a page with a single click and save it into predefined folders.\nUniversal URL Filter is now called Ad Blocker. The built-in block list is now separately managed from the user-defined block list.\nAdded capability to manually pick an AD image within a page and add it into the Ad blocker block list. All you need do is CTRL+SHIFT+Right click on the AD image and select &quot;Block this Ad&quot; from the popup menu.\nBug fix: When browsing local folders inside slimbrowser, double-clicking a folder used to open an external windows explorer. Now it will open in the same tab.\nImportant Behavior Change: &quot;Open In New Tab&quot; in the popup menu when you right click inside a page is now enabled and will open the selected link in a new tab. The &quot;Open In New Window&quot; menu item will open an external slimbrowser instead.\nBug fix: When web page is zoomed in, middle-clicking a link to open a new tab used to open incorrect link sometimes. Now it's fixed.\nBug fix: When browsing folders shared over Windows networking, there used to be unnessary security warnings. Now they are eliminated.\nBug fix: Bypass server list not working in proxy switcher.\nFeature Change: The menu item &quot;Tools:Extract search engine data&quot; menu item is now moved to the dropdown menu on the quicksearch box.\nAdded support of favicon on the quicksearch box dropdown menu.\nBug fix: Auto-hide taskbar not coming out automatically when SlimBrowser is using Skin in Windows 7.\nBug fix: ctrl+shift+left/right and ctrl+a is now working correctly inside address bar.\nFeature Change: Changed shortcut key for zooming into ctrl+ and ctrl-.\nFeature Change: All language files are now included in the setup file instead of being downloaded online.\nRemoved in-page ad-filter.\nTools:shortcuts have been renamed to Tools:Frequently used folders.\nAdded capability to set active tab in site groups.\nAdded capability to set search homepage accessible from the search button on the standard toolbar. Just drag the web page icon from the address bar onto the search button.\nNew feature: autocompletion based on search suggestions. The option can be toggled in tools:options:misc, &quot;Enable Autocompletion based on search suggestions&quot;.\n\n\n\n\nSoftware Overview\n-----------------\n\nSoftware Provider: FlashPeak\n\nOperating Systems: Windows 95, 98, 2000, XP, Vista\n","torrent":{"xt":"urn:btih:1672b0f16aa11d45b61201c6767426995ae32858","amp;dn":"FlashPeak+-+Slim+Browser+v+5.00","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1672b0f16aa11d45b61201c6767426995ae32858","infoHashBuffer":{"type":"Buffer","data":[22,114,176,241,106,161,29,69,182,18,1,198,118,116,38,153,90,227,40,88]},"announce":[],"urlList":[]}}