{"title":"Kenny Chesney - All I Want for Christmas Is a Real Good Tan","uid":6032704,"size":267210229,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:185c3f74570d2726011c63f95aa75587a304bf2c&amp;dn=Kenny+Chesney+-+All+I+Want+for+Christmas+Is+a+Real+Good+Tan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ddawg","files":-1,"time":1292130315,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61-uNaYWFZL._SS400_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61-uNaYWFZL._SS400_.jpg&lt;/a&gt;\n\n\nTitle: All I Want for Christmas Is a Real Good Tan\nArtist: Kenny Chesney \nOriginal Release Date: October 7, 2003 \nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. All I Want For Christmas Is a Real Good Tan\n02. Jingle Bells\n03. I'll Be Home for Christmas\n04. Christmas In Dixie [Feat. Randy Owen]\n05. Thank God for Kids\n06. Silver Bells\n07. Just a Kid\n08. The Angel At the Top Of My Tree\n09. Pretty Paper [With Willie Nelson]\n10. Silent Night [With the Grisgby Twins]\n11. O Little Town of Bethlehem \n\n\nAmazon Review:\nThis is Kenny Chesney's first attempt at a Christmas album, and the end result is a unique blend of influences from the islands, as well as Kenny's memories of spending Christmas in East Tennessee.\nThe title track is a really fun song. It's light-hearted and really fits the overall theme of the CD. As hard as it is to imagine spending the holidays in the island, Chesney can take you there wih his voice and with the lyrics...&quot;Instead of turkey we'll have mahi mahi grillin' and pina coladas in the blender chillen...&quot; \n\nThe same can be said about &quot;Angel At the Top of My Tree&quot;. I'm sure if it was released to radio it would be an instant holiday hit. It's energetic and upbeat...and very Kenny.\n\n\nAllmusic Review:\nAn entry for the 2003 Christmas season was a natural move for Kenny Chesney after the blockbuster No Shirt, No Shoes, No Problems made 2002 his banner year. But in typical Chesney fashion, his holiday album tries to be a little more easygoing than the usual Music City rehash of tried 'n' true yuletide chestnuts. The sunny south of the border vibe that lit up the video for No Shirt's title cut is alive and well on All I Want for Christmas Is a Real Good Tan; the album's own title track is a nice, swaying number that approximates the Cascades' &quot;Rhythm of the Rain&quot; into its breezy Buffett feel. Like Chesney's best material, it's a contemporary country number crossed effortlessly with pop, and it's just a little bit cheeky, too. &quot;Don't worry baby,&quot; he sings. &quot;We'll celebrate plenty/I'll buy you some shades and a brand new bikini.&quot; He seems truly honest when, in his liner notes, Chesney explains how as a kid he spent the season in his native east Tennessee, but now likes to head down to the Caribbean for the holidays. And he backs up that sentiment with the title track and a fun steel drum run through &quot;Jingle Bells.&quot; However, the remainder of All I Want for Christmas leans more toward Nashville safe bets than easygoing St. Bart's. Fans likely won't mind; after all, Chesney's duets with Randy Owen (on the Alabama classic &quot;Christmas in Dixie&quot;) and Willie Nelson (&quot;Pretty Paper&quot;) are solid, and -- ever the softie -- he brings his mom and Aunt Sharon in for a touching take on &quot;Silent Night.&quot; But filler like the needlessly electronicized &quot;Silver Bells&quot; or &quot;The Angel at the Top of My Tree,&quot; which is basic pop-country dressed up in Christmas ribbons and bows, might have been replaced with more of the title track's temperate climes. Chesney and his pals sure look like they're having a great time in the back cover photo, lounging in the sun and sand with their Santa caps. But All I Want for Christmas Is a Real Good Tan could have spread the Coppertone around a little more, instead of relying on Nashville conventionalism. \n\n","torrent":{"xt":"urn:btih:185c3f74570d2726011c63f95aa75587a304bf2c","amp;dn":"Kenny+Chesney+-+All+I+Want+for+Christmas+Is+a+Real+Good+Tan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"185c3f74570d2726011c63f95aa75587a304bf2c","infoHashBuffer":{"type":"Buffer","data":[24,92,63,116,87,13,39,38,1,28,99,249,90,167,85,135,163,4,191,44]},"announce":[],"urlList":[]}}