{"title":"mIRC v7.17 + Crack-Reg [ChattChitto RG]","uid":6054706,"size":7358755,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:18879fe3904b1af751b97342cc29b93d82e47308&amp;dn=mIRC+v7.17+%2B+Crack-Reg+%5BChattChitto+RG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ChattChitto","files":-1,"time":1292859766,"description":"mIRC v7.17 + Crack-Reg\n\n.exe File Format (Setup File - Crack-Reg - Instructions)\n\n***********************************************************************************\n\nmIRC 7.17 FINAL\n\nHomepage: http://www.mirc.com/index.html\n\n\nmIRC is a popular Internet Relay Chat client used by millions of people, and thousands of organizations, to communicate, share, play and work with each other on IRC networks around the world. Serving the Internet community  for over a decade, mIRC has evolved into a powerful, reliable and fun piece of technology. You can download mIRC here.\n\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\n\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\n\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\n\nmIRC has been in development for over a decade and is constantly being improved and updated with new technologies. The most recent changes can be found on the latest news page. \n\n\nMain Changes in v7.17:\n======================\nThe project to convert mIRC to Unicode has taken almost two years of development and testing and has required tens of thousands of changes to 150,000+ lines of source code. This has been the most complex and time-consuming update to mIRC since it was created in 1995, when it started out as a non-Unicode, 16-bit, Windows 3.1 application.\n\nMany areas of mIRC have had to be updated or re-written, from file handling to text processing, from display to memory allocation, from server communications to file transfers.\n\nmIRC should now be faster, more stable, and more compatible with the latest versions of Windows, and should be able to better handle the display and input of a variety of languages.\n\nIn addition to being converted to Unicode, there are a few other notable changes:\n-Improved Windows 7 compatibility\n-More reliable INI file handling\n-Faster text display/scrolling\n-Speech support\n-Improved interface design for a number of features\n-Automatic text color correction\n-Menubar ALT key show/hide feature\n-Support for italic text and other font styles\n-Optimized SSL routines\n-Status window SSL connection icon\n-IPv6 support\n-Improved portable support\n-Persistent channel history\n-Digitally signed executables\n-Automatic splitting of long channel/private messages\n-Full screen display with F11 function key\n-UPnP support\n-Many bug fixes\n-And more\n-A new and improved Log Files dialog has been added that allows you to search log files and to view them in a window in mIRC.\n-A Clear History dialog has been added to the Tools menu that allows you to clear the history of a number of features.\n-File transfers now display progress bars in different colors to indicate transfer status.\n-DCC Send transfer speed has been improved.\n-A &quot;UTF-8 encode/decode messages&quot; option has been added to the Messages dialog to enable or disable UTF-8 encoding/decoding of server messages.\n-The DNS routines have been changed to only request IPv6 if you are using features that require it, which should speed up connections for some users.\n-Many other changes and bug fixes\n\nChanges in v7.17:\n==================\nThis is a small update that addresses a number of important issues that have been reported by users since the last release. It includes improvements, changes and fixes to a number of features, including:\n-The active window now correctly receives the focus when maximized windows are switched or closed.\n-Hash table commands hadd/hinc/hdec when used with the -cuNz switches no longer cause data corruption in hash tables.\n-Custom DLLs that perform window/message hooking no longer cause mIRC to crash on exit.\n-The Alt+Minus key combination has been changed to allow the use of Alt+NumberPadMinus for zooming in screen readers.\n-The socket identifier $sock() now returns the correct saddr/sport values for UDP connections.\n-The Server and DCC connection issue that resulted in the &quot;Address already in use&quot; message should now be resolved.\n-Other changes and bug fixes. \n\nThis update builds on and improves the stability of the new Unicode version of mIRC (see the previous v7.1 release announcement for details). \n\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something &quot;Un-Clean&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\n[Please Leave A Comment Confirming This Pack]","torrent":{"xt":"urn:btih:18879fe3904b1af751b97342cc29b93d82e47308","amp;dn":"mIRC+v7.17+%2B+Crack-Reg+%5BChattChitto+RG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18879fe3904b1af751b97342cc29b93d82e47308","infoHashBuffer":{"type":"Buffer","data":[24,135,159,227,144,75,26,247,81,185,115,66,204,41,185,61,130,228,115,8]},"announce":[],"urlList":[]}}