{"title":"Bad Religion - 21st Century Digital Boy (Live) (2nafish)","uid":6027297,"size":104183812,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:18c3d2eb5f0ec2c9b582d0670896af10e6425cb9&amp;dn=Bad+Religion+-+21st+Century+Digital+Boy+%28Live%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1291965364,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n\n&quot;21st Century (Digital Boy)&quot; is a song by the punk rock group Bad Religion. It was originally recorded in 1990 on their fifth full-length studio album Against the Grain and rerecorded on the 1994 album Stranger Than Fiction. The following year it was included on the All Ages compilation release.\n\nAlthough the Against the Grain version was not released as a single, the Stranger Than Fiction version was a popular hit. The hit version was also featured on the 2002 compilation Punk Rock Songs, which was not endorsed by the band.\n\n21st Century (Digital Boy) peaked at #76 on Triple J's Hottest 100 of 1995 and is also the only Bad Religion song to feature on Triple J's hottest 100.\n\nThe lyrics of the song could be interpreted as a rejection of modern consumerist culture, as exemplified in the lyrics &quot;I'm a 21st Century Digital Boy / I don't know how to live, but I've got a lot of toys&quot;. This alienation and rejection of consumerism and mainstream culture is a common theme in the music of Bad Religion. The bridge includes references to the group's two previous records (as of the original recording), Suffer and No Control.\n\nThe song pays homage to King Crimson's &quot;21st Century Schizoid Man&quot;, even interpolating some of its lyrics towards the end:\n\nCat's foot iron claw\nNeuro-surgeons scream for more\nInnocents raped with napalm fire\n\nThe line &quot;everything I want I really need&quot; that follows is a play on &quot;21st Century Schizoid Man&quot;'s &quot;nothing he's got he really needs.&quot; After that line, as the song fades out, Greg Graffin sings &quot;21st Century Schizoid Boy&quot;.\n\nExcerpt from an interview with Greg Graffin in Scientific American magazine:\n\nQ: Your most famous song is &quot;21st Century Digital Boy,&quot; which pokes fun at our gadget-laden era. A: Oh no, we love technology and gadgets. We use irony in 60 percent of our music. &quot;21st Century Digital Boy&quot; is an ironic twist characterizing the youth of today. The truth is that even though the song was written in 1990, it was clear that the youth were going to be affected for good and bad by digital technology. It's probably because we loved video games so much.\n\nAgainst the Grain is the fifth album (and seventh release overall) by punk rock band Bad Religion released on November 23, 1990. This is the last album recorded with drummer Pete Finestone who left in 1991 to concentrate with his new project The Fishermen. Following his departure, the band's music would take a different direction on their next album, 1992's Generator.\n\nLike Bad Religion's albums up to Generator, Against the Grain was remastered and reissued on April 6, 2004, along with their 1992 long-out of print live video Along the Way, which was recorded live during their 1989 European tour. As of 2008, the album's original pressing has been out of print. Against the Grain also marked the 10th anniversary of Bad Religion playing together after their formation.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:18c3d2eb5f0ec2c9b582d0670896af10e6425cb9","amp;dn":"Bad+Religion+-+21st+Century+Digital+Boy+%28Live%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18c3d2eb5f0ec2c9b582d0670896af10e6425cb9","infoHashBuffer":{"type":"Buffer","data":[24,195,210,235,95,14,194,201,181,130,208,103,8,150,175,16,230,66,92,185]},"announce":[],"urlList":[]}}