{"title":"Maximus iXtreme LT+ UART Enable Patch for LiteOn","uid":5987230,"size":239254,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:18e0f0096d253fd1d468cc16f0a25e9b11f03ee6&amp;dn=Maximus+iXtreme+LT%2B+UART+Enable+Patch+for+LiteOn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sunblock.","files":1,"time":1290731553,"description":"Maximus iXtreme LT+ UART Enable Patch for LiteOn\n\nMaximus released an UART Enable Patch for C4E's iXtreme LT+ FW for LiteOn drives that will allow you to read the DVD-key again on LiteOn drives flashed with LT+ without having to cut/repair extra traces.\n\nFrom the README/NFO:\n\nWHAT IT IS:\nSilly patch to re-enable the READ KEYS OVER SERIAL On LT+\nThis will save you from having to do (or re-do) the cuts on the drives or also will save you of being FORCED to install board clips of any kind on your drive to do later reads. (of course if its a 83V2 or 93 stock drive you still need do cuts the first time)\nSince the releases are based on the 93450 its possible with a really quick patch re-enable that functionality. It should work for all LT+ releases of liteon as all are based on the 93450 fw.\nPlease note will not work on non-93450 based firmwares.\n\nHOW TO APPLY\na) Prepare your LT+ file (with the spoof, keys, etc) but dont flash it just yet.\nb) Open LT+ file with ppf-o-matic and apply the attached ppf file.\nc) After ppf applied just flash your drive and you will have later the option to read keys over the UART port (just like old Liteon 74) using spear or Usbxtractor, whatever\n\nAlternatively you can also patch the template files to avoid doing each time. If JF complains about opening the patched firmware just use an older (without restrictions) version or better use dosflash\n\nThanks to geremia for the firmware descrambler. The software is being distributed with an &quot;I dont care&quot; license so use at your own risk.\n\n\n*Update* C4Eva said on IRC (#fw) the patch is &quot;less secure&quot;, Maximus (carranzafp) said it's as safe as the unpatched LT+ - you decide.\n[c4eva on #FW] btw, avoid the mamimus patch for lt+,less secure!\n[carranzafp via forums] The hack is as safe as LT+ can be, if we remember a bit the 93450 had the uart serial removed with simple hex edit, so this just revert back the functionality doing the same.\nUnless of course the console had a small hand and put a probe on the spot by itself to check if its enable. Wich is not likely happen\n\n","torrent":{"xt":"urn:btih:18e0f0096d253fd1d468cc16f0a25e9b11f03ee6","amp;dn":"Maximus+iXtreme+LT%2B+UART+Enable+Patch+for+LiteOn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18e0f0096d253fd1d468cc16f0a25e9b11f03ee6","infoHashBuffer":{"type":"Buffer","data":[24,224,240,9,109,37,63,209,212,104,204,22,240,162,94,155,17,240,62,230]},"announce":[],"urlList":[]}}