{"title":"Democracy Now - 15 dec 2010","uid":6042734,"size":452380163,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:195d272f88511aa416737885d06c170b7295ea9a&amp;dn=Democracy+Now+-+15+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1292430212,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 15, 2010\n\n- Assange Remains Jailed Pending Bail Appeal\n- Supporters Rally for Assange in Australia\n- U.S. Air Force Blocks Sites that Published WikiLeaks Cables\n- Incoming GOP Lawmaker: Censor News Agencies for WikiLeaks\n- Suicide Attack Kills 38 in Iran\n- 27 Asylum Seekers Die in Australia Boat Crash\n- Ivory Coast Opposition Calls for Mass Protests in Election Dispute\n- Report: Halliburton to Pay $250M in Nigeria Bribery Case\n- Obama to Host Corporate CEOs at White House\n- Marine General: DADT Repeal Would Endanger U.S. Troops\n- Appeals Court Rules Emails Protected by 4th Amendment\n- Police Occupy Puerto Rico Campus\n\n\nSpecial reports\n\n- Attorney: Swedish Case is a &quot;Holding Charge&quot; to Get Julian Assange Extradited to U.S.\n\nWikiLeaks founder Julian Assange remains in a London prison after Swedish authorities challenged the court's decision to release him on bail with conditions. Assange's attorney Mark Stephens joins us to discuss his possible extradition to Sweden for questioning on alleged sexual crimes amidst rumors the Obama administration has convened a grand jury to indict Assange in the United States.\n\n\n- John Pilger: Global Support for WikiLeaks is &quot;Rebellion&quot; Against U.S. Militarism, Secrecy\n\nThe award-winning investigative journalist and documentary filmmaker John Pilger is one of many high-profile public supporters of Julian Assange and his organization WikiLeaks. Pilger has attended Assange's court proceedings in London and has offered to contribute funds for his more than $300,000 bail. Pilger's latest film, The War You Don't See, includes interviews with Assange. Pilger says that WikiLeaks is revolutionizing journalism and galvanizing public opinion to stand up to global elites.\n\n\n- Richard Holbrooke Dies at 69: Remembering Veteran Diplomat's Overlooked Record in East Timor, Iraq and the Balkans\n\n      Since his death this week at the age of 69, veteran U.S. diplomat Richard Holbrooke has been remembered for a storied career that includes brokering the 1995 Dayton peace accords that ended the war in Bosnia. But little attention has been paid to his role in implementing and backing U.S. policies that killed thousands of civilians. Independent journalists Jeremy Scahill and John Pilger join us to discuss Holbrooke's record in carrying out U.S. policy in Vietnam, East Timor, the Balkans, Iraq, Afghanistan and Pakistan. Scahill says Holbrooke &quot;represented the utter militarization of what is called 'U.S. diplomacy.'&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:195d272f88511aa416737885d06c170b7295ea9a","amp;dn":"Democracy+Now+-+15+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"195d272f88511aa416737885d06c170b7295ea9a","infoHashBuffer":{"type":"Buffer","data":[25,93,39,47,136,81,26,164,22,115,120,133,208,108,23,11,114,149,234,154]},"announce":[],"urlList":[]}}