{"title":"Oorlog van de eeuw dvd 7(Dutch)(TinkerBell) TBS","uid":6037161,"size":4683977134,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1bd7040909e621794949f4c7d8fd878a1c9760f1&amp;dn=Oorlog+van+de+eeuw+dvd+7%28Dutch%29%28TinkerBell%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mad_Parrot","files":51,"time":1292272813,"description":"\n\n\nDe Oorlog van de Eeuw 7/10       \n \n \nDe Tweede Wereldoorlog woedde meer dan 60 jaar terug en eiste meer dan 50 miljoen mensenlevens, in veldslagen van NormandiÃƒÂ« tot de Kaukasus, bij de marine en in de luchtgevechten en bombardementen op steden. Dit was een oorlog die duidelijk aantoonde hoe diep de mensheid kan zinken.\nDe machtsstrijd tussen twee totalitaire ideologieÃƒÂ«n, de overwinning van democratie over dictatorschap, de triomf van technologie in oorlogsvoering en het misbruik ervan voor gemechaniseerde slachtpartijen bewees uiteindelijk, in Hiroshima, dat de mensheid nu in staat was om zichzelf uit te roeien... De Oorlog van de Eeuw.\n\nDe slag om Parijs\nAugustus 1944: Vijf lange bezettingsjaren hebben de metropool aan de Seine gebroken. Maar halverwege augustus verandert ineens alles. \nZonder waarschuwing worden de bezetters aangevallen. Parijzenaren werpen barricades en wegversperringen op, verzetsmensen lokken Duitsers in de val, partizanen vallen Duitse tanks aan met Molotov cocktails en gendarmes die tot dan toe loyaal waren geweest aan het Vichy regime veroveren en bezetten hun politiestations. \nIn het centrum van de stad wordt fel gevochten en de bezetters worden gedwongen om zich terug te trekken in verstevigde posities. \nHitler geeft opdracht om de stad liever te verwoesten dan zonder slag of stoot over te geven, terwijl de invasiemacht van de Geallieerden nog te ver weg zijn moet de Franse hoofdstad stand zien te houden...\n\nDe laatste veldslag\nOp 17 september 1944 werd in Engeland het startsein gegeven voor de &quot;Operatie Market Garden&quot;. Meer dan 1500 vliegtuigen met Britse en Amerikaanse parachutisten stegen op om de strategisch belangrijke bruggen over de Maas, Waal en Rijn te bereiken.\nDe slag om Arnhem bleek een waagstuk van de eerste orde te zijn. Ook bij de Duitse stad Aken werd in de herfst en de winter van 1944 een bittere strijd geleverd. \nTalloze geallieerde soldaten en Duitse burgers vonden hierbij de dood. In de ochtend van 16 december 1944 werden oprukkende Amerikaanse troepen volkomen verrast door een Duitse aanval. \nHitler zette alle mogelijke beschikbare manschappen in om de strijd te winnen en het Ardennenoffensief was begonnen.\n \n \n \n\n\nNEDERLANDS GESPROKEN\n\nSpotinformatie\n \nCategorie    : Beeld \nFormaat      : DVD5 \nBron         : Retail\nOndertitels  : Nederlands (instelbaar)\nGenre        : Documentaire\n\n\n &lt;a href=&quot;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+5/10&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+5/10&lt;/a&gt; \n\n\n \n \n \n\n\n*****************************************\n\nBrought to you by TinkerBell TBS\n\n\n\n\n","torrent":{"xt":"urn:btih:1bd7040909e621794949f4c7d8fd878a1c9760f1","amp;dn":"Oorlog+van+de+eeuw+dvd+7%28Dutch%29%28TinkerBell%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bd7040909e621794949f4c7d8fd878a1c9760f1","infoHashBuffer":{"type":"Buffer","data":[27,215,4,9,9,230,33,121,73,73,244,199,216,253,135,138,28,151,96,241]},"announce":[],"urlList":[]}}