{"title":"1378km The inner german border game","uid":6030039,"size":325833643,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1c9f7d40012eb00e6c34f1797f891667047a8398&amp;dn=1378km+The+inner+german+border+game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"itchythekiller","files":1,"time":1292063791,"description":"1378(km) will be released! A Beta version will be released in an initial test phase for players 18 years and over, with the aim of improving the game through feedback. The final version will be released accompanied by a public discussion with dignified guests at the Karlsruhe University for Arts and Design at the beginning of December.\n\nThe BILD newspaper's indictment of the game as &quot;revolting&quot; (&quot;Will the revolting East German shoot-'em-up be banned?&quot;, German title &quot;Wird das widerwÃƒÂ¤rtige DDR-Ballerspiel verboten?&quot;, BILD-Online, 29.09.2010) means that the intended release and presentation date of October 3 is no longer realistic, since an objective discussion of the game is presently impossible.\n\nA large part of the criticism is a consequence of my chosen medium, the computer game. Computer games as a medium are often quick to be judged without being more closely examined, as was also the case with my art project. It was designed to enable a younger generation to access information on recent German history using a medium familiar to them. I have been pleased about the lively discussion about the game, and about the positive feedback and encouragement from which the game can only profit.\n\nOn that point, it should also be noted that 1378(km) is a modified version of &quot;Half-Life 2: Deathmatch&quot; that is freely available, and upon which the censorship recommendation of 18 years and over is based.\n\nIn this computer game - which would not be the case in, for example, a documentary film - I personally have the control over my behavior and my reactions, which take place in real time and in changing situations. The game 1378(km) does not force someone playing the &quot;border soldiers&quot; to shoot the &quot;refugees&quot;. Players are left with the freedom of choice. You are only able to win 1378(km) when you do not shoot. The rules of the game are inspired by the situation at the former Inner German Border. Border camps, death strips, and orders to shoot are what make the game brutal.\n\nI deeply regret that the victims of the former border and their families and relatives have felt cause for injury. This was never part of my intention.\n\nJens M. Stober ","torrent":{"xt":"urn:btih:1c9f7d40012eb00e6c34f1797f891667047a8398","amp;dn":"1378km+The+inner+german+border+game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c9f7d40012eb00e6c34f1797f891667047a8398","infoHashBuffer":{"type":"Buffer","data":[28,159,125,64,1,46,176,14,108,52,241,121,127,137,22,103,4,122,131,152]},"announce":[],"urlList":[]}}