{"title":"Newton's Dark Secrets  (Nova)","uid":6119969,"size":646190128,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1cb973b21e9a5c9e5ac6bc14408cb66c18a0ac7f&amp;dn=Newton%5C%27s+Dark+Secrets++%28Nova%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lucy1948","files":2,"time":1295704745,"description":"In addition to the reputation afforded him in the centuries following his death as a world-shaking scientific provocateur, Isaac Newton was also extraordinarily devout, and something of a mystic. As one who did his life's work during an unusual period when both modern science and theology were on the upswing, he simultaneously invented calculus, laid the foundation of alchemy, attempted to predict the date of Christ's return based on Biblical clues, and disclosed grave heresies buried deeply in Catholicism and Anglicanism -- to name only a few among hundreds of gifts that Newton brought to the world. He also established himself as one of the most profound mathematicians in world history, attaining the wickedly difficult Lucasian mathematics post at Cambridge and acquiring a professorial reputation that terrified prospective students by virtue of Newton's genius and esotericism. And the great irony is that a number of Newton's key discoveries have never been publicized, thanks to his unwillingness to make known many of his thoughts and conclusions. An episode of the critically and popularly acclaimed long-running PBS series that has instilled an adoration of science in hundreds of thousands of viewers during its 32-year run, NOVA: Newton's Dark Secrets plunges into the bizarre and brilliant corners of Newton's scientific genius, offering a fascinating, unflinching look at the many facets of this deep and complicated man.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:1cb973b21e9a5c9e5ac6bc14408cb66c18a0ac7f","amp;dn":"Newton%5C%27s+Dark+Secrets++%28Nova%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cb973b21e9a5c9e5ac6bc14408cb66c18a0ac7f","infoHashBuffer":{"type":"Buffer","data":[28,185,115,178,30,154,92,158,90,198,188,20,64,140,182,108,24,160,172,127]},"announce":[],"urlList":[]}}