{"title":"Democracy Now - 01 mar 2011","uid":6211385,"size":454600699,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1e32d59df0ab48bc8b5322b1f0a57409db078cfd&amp;dn=Democracy+Now+-+01+mar+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1298997640,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 01, 2011\n\n- Libyan Regime Attacks Rebel-Held Towns\n- U.S. Deploys Naval, Air Forces Near Libya\n- 100,000 Flee Libya, Death Toll Remains Unknown\n- Protests Shut Out of Wisconsin Capitol\n- Ohio Lawmakers to Vote on Anti-Union Bill\n- Obama Urges Support for Public Unions\n- Polls: Majority Supports Collective Bargaining; Walker Would Lose Election Re-Do\n- Report: GOP Budget Plan Would Eliminate 700,000 Jobs\n- Trial for Environmental Activist Opens in Utah\n- Massey Security Chief Charged With Obstructing Blast Probe\n- Gov't Issues First Gulf Deepwater Drilling Permit Since Moratorium\n- Immokalee Workers Launch 5-City Protest\n- Pro-Democracy Protests Spread to Oman Capital\n- 29 Killed in Iraq Clashes; 300 Arrested in Sweep Targeting Dissidents\n\n\nSpecial reports\n\n- Terror in Tripoli: Libyan-American Describes Country in State of Fear, But Hopeful of Gaddafi's Ouster\n\nThe Libyan regime has launched a new assault on the opposition amidst growing international pressure. Forces loyal to Libyan leader Muammar Gadaffi tried to re-take two rebel-controlled towns overnight, but both attacks appear to have been repelled. Speaking to western journalists, Gaddafi said that he is loved by all his people and has denied there have been any protests. We speak to Tareq, a Libyan-American just back from Libya after a spending week with his family. He discusses the situation in the capital Tripoli.\n\n\n- Arab League Secretary General Amr Moussa on Egypt's Revolution, His Potential Presidential Candidacy and Middle East Uprisings\n\nSecretary General Amr Moussa is widely expected to run for president of Egypt in the country's upcoming elections. Democracy Now! senior producer Sharif Abdel Kouddous sits down with Amr Moussa in the headquarters of the Arab League next to Tahrir Square in downtown Cairo for a conversation about Egypt's revolution, his potential presidential candidacy, the military's role in Egypt, treaties with Israel, and popular uprisings across the Middle East. [includes rush transcript]\n\n\n- Labor Organizers Consider General Strike in Wisconsin As Gov. Scott Walker Refuses to Negotiate Over Anti-Union Bill\n\nWisconsin Republican Gov. Scott Walker is expected to propose deep cuts to the state's health programs for the poor and aid to local governments. Walker has also threatened to start the process of laying off 1,500 state workers unless 14 Democratic senators return to the state and vote to refinance millions in debt. The Walker administration is coming under intense criticism for largely shutting off the state Capitol to protesters ahead of his speech. Democracy Now! Senior Producer Mike Burke speaks to Frank Emspak, founder and producer of Workers Independent News.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:1e32d59df0ab48bc8b5322b1f0a57409db078cfd","amp;dn":"Democracy+Now+-+01+mar+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e32d59df0ab48bc8b5322b1f0a57409db078cfd","infoHashBuffer":{"type":"Buffer","data":[30,50,213,157,240,171,72,188,139,83,34,177,240,165,116,9,219,7,140,253]},"announce":[],"urlList":[]}}