{"title":"Runtime GetDataBack for NTFS &amp; FAT v4.10 - (x32-x64)","uid":6052042,"size":5358810,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1ef1594eaf0fc75fda935a189f474fe149d619b9&amp;dn=Runtime+GetDataBack+for+NTFS+%26+FAT+v4.10+-+%28x32-x64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":-1,"time":1292772205,"description":"Data Recovery Software for NT file systems - GetDataBack is a highly advanced data recovery \n\nsoftware, which will help you to get your data back when your drive's partition table, boot \n\nrecord, Master File Table or root directory is corrupt or lost, when a virus has hit the \n\ndrive, files were deleted, the drive was formatted or struck by a power failure. GetDataBack \n\ncomes in two flavours, NTFS and FAT depending on what file system you have.\n\nGetDataBack will recover your data if the hard drive's partition table, boot record, FAT/MFT \n\nor root directory are lost or damaged, data was lost due to a virus attack, the drive was \n\nformatted, fdisk has been run, a power failure has caused a system crash, files were lost \n\ndue to a software failure, files were accidentally deleted...\n\n\nGetDataBack can even recover your data when the drive is no longer recognized by Windows. It \n\ncan likewise be used even if all directory information - not just the root directory - is \n\nmissing.\n\nThe tool works at partition level and will restore files and folders exactly how they used \n\nto be. It recovers data from floppy and ZIP disks, drive images and even remote drives \n\nconnected by a serial cable or TCP/IP. As the name says, it restores files from FAT/ NTFS \n\ndisks - file system used by Windows 95, 98, ME, NT, 2000, XP, 2003, Vista or Windows 7, yet \n\nworks on all Windows systems. Make sure you never install the program on the to-be-recovered \n\ndrive and you will never lose important data.\n\nAdvanced algorithms will make sure that all directories and sub directories are put together \n\nas they were, and that long file names are reconstructed correctly. GetDataBack is \n\nread-only, meaning the program will never attempt to write to the drive you are about to \n\nrecover. Please make sure to read the safety instructions...\n\nThe software enables the regular user to conduct his own data recovery by guiding him \n\nthrough three easy to understand steps, thus gives the advanced user the possibility to \n\ninterfere with the recovery and improve the results, by examining the scan log, the file \n\nsystem details, file and directory information, by selecting the sector range to be scanned, \n\nby choosing excessive search for file systems or search for lost files, by calling Runtime's \n\nDiskExplorer.\n\nRecover files over your local network or over a serial cable - This feature enables you to \n\nrun GetDataBack on one computer (&quot;remote&quot;) while accessing the drives of another computer \n\n(&quot;host&quot;). Recovering data over a network is useful, especially when you are not able to \n\nremove the drive you want to recover from and attach it to another computer.\n\nGetDataBack recovers from:\n* Hard drives (IDE, SCSI, SATA)\n* USB drives\n* Firewire drives\n* Partitions\n* Dynamic Disks\n* Floppy drives\n* Drive images\n* Zip/Jaz drive\n* Compact Flash Cards\n* Smart Media Cards\n* Secure Digital Cards\n* USB Flash Drive\n* iPod Disks\n\nOperating Systems:  Windows 95, 98, ME, NT, 2000, XP, 2003, Vista or Windows 7\n","torrent":{"xt":"urn:btih:1ef1594eaf0fc75fda935a189f474fe149d619b9","amp;dn":"Runtime+GetDataBack+for+NTFS+%26+FAT+v4.10+-+%28x32-x64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ef1594eaf0fc75fda935a189f474fe149d619b9","infoHashBuffer":{"type":"Buffer","data":[30,241,89,78,175,15,199,95,218,147,90,24,159,71,79,225,73,214,25,185]},"announce":[],"urlList":[]}}