{"title":"Urusen...One Day in June(2007)[FLAC]","uid":5980590,"size":351294914,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:201816562ff8f14cd6af95f352f01590bebd4e34&amp;dn=Urusen...One+Day+in+June%282007%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":22,"time":1290582399,"description":"Urusen - One Day in June(20007) URUCD002A\n\nThe 16-track album One day in June is Urusen's second album. Shifting from the delicate to the epic, songs from One day in June echo a cross fertilisation between acoustic folk influences, such as Crosby, Stills and Nash or John Martyn, the bluesy tinge of Tim Buckley or Gomez, with rockier influences, like Radiohead and U2. The feel is predominantly acoustic (Now that she has flown, Impossibly), but the arrangement is always eclectic (Vote for me, Hugo) and occasionally unleashed (One day in June, Nobody knows). Nearly three years in the making, One day in June began with home made roots in one of the world's tiniest (and more curious) studios, created in the band's hometown of Bath. As the album progressed, the band grew in size and a number of other musicians also squeezed their way into the studio to add contributions. On the merit of the recordings, the project garnered the interest of Peter Gabriel's Realworld Studios, who offered support and assistance with the final track mixes. Top mastering engineer Jon Astley (The Who, The Rolling Stones) also offered his time for the production of the album master. Peter Beatty's rich illustration for the album artwork is as much a part of the band as their music, where we see a character by the name of Urusen (an anagram of 'unsure') drifting through different scenarios and experiences, reflecting the album's songs. One day in June is released as a limited first edition, each one numbered and hand bound. The inner sleeves printed on a 19th century Heidelberg printer by Richard Lawrence, who printed the artwork for Thom Yorke's album The Eraser. 'Urusen's uplifting and modern folk-tinged vibe is all about impressive guitar fretwork, catchy melodies, delicious harmonies and intelligent lyrics' (Spitz) 'songs of amazing depth and beauty' (Rockpulse.com) 'sunshine-dripping and optimistic melancholy nuzzles and charms on this much welcomed comeback' (Loud And Quiet) \n\n01.\tVote for 03:47\n02.\tNow that she has flown 05:25\n03.\tLacuna 02:16\n04.\tDaylight soon 03:30\n05.\tCrone 01:11\n06.\tNosediving\t 05:27\n07.\tMap of nowhere 04:13\n08.\tGuitar song 02:01\n09.\tAngel 05:18\n10.\tHugo 03:50\n11.\tNobody knows 05:02\n12.\tThe end of Rob's car 01:44\n13.\tOne day in June 06:12\n14.\tHave a go now 01:55\n15.\tImpossibly\t03:41\n16.\tEnd of the night 04:15\n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/11/15/urusen/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/11/15/urusen/&lt;/a&gt;","torrent":{"xt":"urn:btih:201816562ff8f14cd6af95f352f01590bebd4e34","amp;dn":"Urusen...One+Day+in+June%282007%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"201816562ff8f14cd6af95f352f01590bebd4e34","infoHashBuffer":{"type":"Buffer","data":[32,24,22,86,47,248,241,76,214,175,149,243,82,240,21,144,190,189,78,52]},"announce":[],"urlList":[]}}