{"title":"Rick Springfield - Christmas with You (Extra Track)","uid":5994466,"size":332587734,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:204d6041d8d5f35c15933a037086dcb8ce9496c7&amp;dn=Rick+Springfield+-+Christmas+with+You+%28Extra+Track%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ddawg","files":-1,"time":1290993125,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51tBKhaqIcL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51tBKhaqIcL.jpg&lt;/a&gt;\n\n\nTitle: Christmas with You (Extra Track)\nArtist: Rick Springfield\nAudio CD (November 6, 2007) \nOriginal Release Date: 2007\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Christmas With You\n02. The First Noel\n03. Hark The Herald Angels Sing\n04. Whiat Child Is This\n05. God Rest Ye Merry Gentlemen\n06. It Came Upon a Midnight Clear\n07. Away in a Manager\n08. O Come All Ye Faithful\n09. Carol of the Bells\n10. Do You Hear What I Hear\n11. I'll Be Home for Christmas\n12. Silent Night\n13. Oh Little Town of Bethlehem\n14. I Saw Three Ships\n15. Deck the Halls (With Boughs of Longboards) \n16. White Christmas\n\n\nAmazon Review:\nFor all lovers of Traditional Christmas Music, this is an amazing album. It's filled with warm and traditional carols. With Rick's rich voice and subtle backgrounds, it really gives a wonderful feeling of Christmas. The title track, Christmas With You, is dedicated to all the fallen troops who served our country. It hits home to anyone who has had to celebrate a holiday away from those they love. There are 2 instrumental sons in the album as well, and they give this album a little something different. Recommend it to all those who are lookin gfor a little Christmas spirit heading their way. \n\nAllmusic Review:\nIt seems that any veteran recording artist eventually winds up recording their own holiday album, so it makes perfect sense that Rick Springfield finally got around to releasing his own in 2007 with Christmas with You. Apart from the original title song, Springfield relies on standards here, with traditional carols far outweighing relatively recent secular holiday tunes; in fact, only &quot;I'll Be Home for Christmas&quot; can qualify in the latter category. Springfield not only sticks to the classics, he gives many of these spare, baroque acoustic treatments that emphasize their folk origin. These stark arrangements combined with the clean production can give Christmas with You almost a new age feel, but Springfield's raspy voice prevents this from getting spacy, and he does cut loose on a surf music version of &quot;Deck the Halls&quot; (thereby earning the subtitle &quot;With Boughs of Longboards&quot;) and gives &quot;I'll Be Home for Christmas&quot; a bit of a goofy doo wop feel. The album could use just a little bit more of this dose of fun, but in its measured, inventive way, Christmas with You is far from the standard holiday album, and it's hard not to admire that Springfield opted for something different on his Christmas record than the same warm, toasty arrangements of the same songs that show up on most seasonal albums by veteran artists.","torrent":{"xt":"urn:btih:204d6041d8d5f35c15933a037086dcb8ce9496c7","amp;dn":"Rick+Springfield+-+Christmas+with+You+%28Extra+Track%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"204d6041d8d5f35c15933a037086dcb8ce9496c7","infoHashBuffer":{"type":"Buffer","data":[32,77,96,65,216,213,243,92,21,147,58,3,112,134,220,184,206,148,150,199]},"announce":[],"urlList":[]}}