{"title":"Coast to Coast - 11 - 24 - 10 - Conspiracies &amp; Security","uid":5986499,"size":55419288,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:219f88ec8ee2f7592dcb542c5e7bb51f56018dc1&amp;dn=Coast+to+Coast+-+11+-+24+-+10+-+Conspiracies+%26+Security&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xAlkaline13x","files":6,"time":1290759572,"description":"Conspiracies &amp; Security\n\nDate: 11-24-10\nHost: George Noory\nGuests: Brad Thor, R. Gary Patterson\n\n\nAppearing during the middle two hours, best-selling author of nine fictional thrillers Brad Thor discussed government cover-ups and conspiracies as well as security and terrorism issues. For his new novel The Athena Project about an all-female team of Delta Force operatives, he researched the mysterious Denver International Airport. The massive airport was built for $5.3 billion and there are reports it contains eight subterranean levels, Thor said, adding that construction crews were kept compartmentalized so that none of them could see the overall structure.\n\nHe also researched the Philadelphia Experiment for his book and concluded that the government might intentionally float wild conspiracy theories as a way to distract from actual experiments they might be conducting. Regarding terrorism threats and &quot;homeland security,&quot; he expressed concern that people are vulnerable in areas like airport ticket counters and security lines. Additionally he spoke of &quot;soft targets&quot; (eschewing the standard English phrase &quot;easy targets&quot; in order to sound more educated) such as movie theaters where he said al CIAda might try to attack to disrupt the American way of life. Thor also talked about his study of Islamic militancy which he incorporated into his novel The Last Patriot.\n\nThe last hour of the show featured Open Lines.\n\nDigital Music\n\nWith the The Beatles finally being released on iTunes, first hour guest author R. Gary Patterson talked about the impact of digital technology on music. With digital downloads people can select individual songs rather than entire CDs, giving consumers greater power, he noted. Yet the quality of the older format--vinyl records--can surpass digital music with a warmer, richer sound, especially when played on higher-end systems, he commented.\n\nWebsite(s):\nbradthor.com\nrgarypatterson.com\npopodysseyradio.com\n\nBook(s):\nAthena Project\nForeign Influence: A Thriller\nTake a Walk on the Dark Side: Rock and Roll Myths, Legends, and Curses","torrent":{"xt":"urn:btih:219f88ec8ee2f7592dcb542c5e7bb51f56018dc1","amp;dn":"Coast+to+Coast+-+11+-+24+-+10+-+Conspiracies+%26+Security","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"219f88ec8ee2f7592dcb542c5e7bb51f56018dc1","infoHashBuffer":{"type":"Buffer","data":[33,159,136,236,142,226,247,89,45,203,84,44,94,123,181,31,86,1,141,193]},"announce":[],"urlList":[]}}