{"title":"Krokus - Midnight Maniac (2nafish)","uid":5948311,"size":143816708,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:21c9876bbd1daa8353645e5e0f2b5c583f0b2521&amp;dn=Krokus+-+Midnight+Maniac+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1289447417,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe Blitz is the eighth studio album from hard rock band Krokus. It became a gold album in the United States. While preparing to record it, Patrick Mahassen had been tapped to join the band on guitar, Mark Kohler having switched to bass. Mahassen did not join, and the album was recorded as a quartet; Andy Tanas played bass on the subsequent tour.\n\nKrokus is a hard rock/heavy metal band from Switzerland. They enjoyed moderate success in North America during the 1980s.\n\nKrokus was founded in Solothurn in 1974 by bassist (and original lead vocalist) Chris von Rohr and guitarist Tommy Kiefer. Former Eazy Money vocalist Marc Storace joined the band as frontman in time for their Metal Rendez-vous album in 1980.\n\nThe band name &quot;Krokus&quot; evolved from the word for a flower common to the region of southern Europe, the crocus. Early in the spring of 1975, band founder Chris von Rohr observed a field of these flowers while traveling by train. He was returning from L'Ecole des Chefs located in France after an aborted career in the culinary arts, and it was around this time the idea for a Metal band was formed. The band members stated that it was the perfect name, since it features &quot;Rock&quot; right in the middle.\n\n1983's Headhunter was awarded platinum album status in the United States and hit number 25 in the 1983 album charts. The album was Krokus' most successful album to date, both commercially and critically. It boasted the hit power ballad &quot;Screaming in the Night&quot;, which saw heavy rotation on MTV and would become one of the band's most recognizable songs. Judas Priest's Rob Halford contributed backing vocals on the song &quot;Ready to Burn&quot;.\n\n1984 saw the band move in a more commercial direction with The Blitz, which featured a cover of Sweet's 1973 hit song The Ballroom Blitz. Though a commercial success, the album was panned critically. Capitalizing on the wave of success enjoyed by heavy metal in the mid-1980s, the band then released Change of Address in 1986, which featured a cover of the Alice Cooper standard School's Out. The album was a commercial and critical failure. Krokus then released a live album entitled Alive &amp; Screamin' as the band transitioned from Arista Records to MCA.\n\nIn 2005, longtime lead guitarist Fernando von Arb left the band after continuing wrist problems required surgery. Mandy Meyer, who had played with the band in the mid-1980s, replaced von Arb in the lineup. The new formation recorded the studio album Hellraiser in 2006, which went to gold in Switzerland on the first day of sales. It generally received very good reviews. In an interview in 2008, Marc Storace stated that Krokus was becoming more and more &quot;metal&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt; ","torrent":{"xt":"urn:btih:21c9876bbd1daa8353645e5e0f2b5c583f0b2521","amp;dn":"Krokus+-+Midnight+Maniac+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21c9876bbd1daa8353645e5e0f2b5c583f0b2521","infoHashBuffer":{"type":"Buffer","data":[33,201,135,107,189,29,170,131,83,100,94,94,15,43,92,88,63,11,37,33]},"announce":[],"urlList":[]}}