{"title":"Democracy Now - 04 jan 2011","uid":6082115,"size":446927675,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2269d0596461d328cfd96884d648d77508d14b40&amp;dn=Democracy+Now+-+04+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1294158494,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 04, 2011\n\n- Pakistani Governor Assassinated in Islamabad\n- Rep. Issa to Big Business: What Regulations Should GOP Fight?\n- GOP House to Vote to Repeal Entire Healthcare Bill\n- JPMorgan Exec Considered for White House Chief of Staff\n- Union &amp; State Workers Come under Increasing Attack\n- Survey: 61 Percent Support Higher Taxes on the Rich\n- Iran Offers Access to Nuclear Facilities\n- WikiLeaks: Israel is Preparing for &quot;Major War&quot; in Middle East\n- Obama Prepares to Defy Congress on Guantanamo Limitations\n- Goldman Sachs Invests $450 Million in Facebook\n- Psychologists Protest Army's Treatment of Bradley Manning\n\n\nSpecial reports\n\n- Eyewitnesses Describe Death of Palestinian Woman in Israeli Tear Gas Attack\n\nA Palestinian woman died Friday after Israeli forces shot her with tear gas during a peaceful protest against the West Bank separation wall in the village of Bil'in. Israeli and Palestinian eyewitnesses, as well as staff at a hospital in Ramallah, say that Jawaher Abu Rahma died after inhaling massive amounts of tear gas fired by the Israeli military at the demonstration. She was 36 years old. We speak with an Israeli activist and an Israeli doctor who were at the protest.\n\n\n- Ivory Coast Showdown: A Discussion on the Political Crisis in West Africa\n\nIvory Coast's political crisis remains in a deadlock following a day of talks with visiting African heads of state. On Monday, a delegation of leaders from Nigeria, Sierra Leone, Cape Verde and Kenya met with both Ivory Coast President Laurent Gbagbo and longtime opposition leader Alassane Ouattara. Gbagbo and Ouattara have each claimed victory in November's disputed election. Ouattara has received the backing of the international community. We speak with Horace Campbell of Syracuse University and Gnaka Lagoke, an Ivory Coast political analyst.\n\n\n- Sudan Referendum: &quot;A Real Turning Point For the People of Africa,&quot; Says Horace Campbell\n\nOn Sunday, Southern Sudan will begin a week-long referendum on whether to break off from Sudan and form a new independent state. The vote is being held under the 2005 peace agreement that ended a nearly four-decade civil war between the North and South that killed some 2.5 million Sudanese. The people of South Sudan are widely expected to approve secession, and the vote has stoked fears of renewed violence in Africa's largest nation.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2269d0596461d328cfd96884d648d77508d14b40","amp;dn":"Democracy+Now+-+04+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2269d0596461d328cfd96884d648d77508d14b40","infoHashBuffer":{"type":"Buffer","data":[34,105,208,89,100,97,211,40,207,217,104,132,214,72,215,117,8,209,75,64]},"announce":[],"urlList":[]}}