{"title":"Brady Bunch Season One","uid":6116054,"size":4689573544,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:23f7664335a13b01e18b24f1ba568c435bd97eaf&amp;dn=Brady+Bunch+Season+One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rickcrid","files":27,"time":1295556329,"description":"The Brady Bunch was first seen in September 1969, Friday nights on ABC. The series was created by Sherwood Schwartz the same person who had created Gilligan's Island, 5 years earlier. In this series, Michael Paul Brady marries Carol Ann Tyler Martin and they combine their families. Mike had three sons from a previous marriage and Carol had three daughters also from a previous marriage. Mike's previous wife had died and the fate of Carol's previous husband was never explained. However, creator Sherwood Schwartz, originally intended Carol to have been divorced, but ABC balked at that idea. So thus we have two parents (Mike and Carol),six kids (Greg, Marcia, Peter, Jan, Bobby &amp; Cindy), one housekeeper (Alice), and the family dog (Tiger), all living under one roof. Thus setting the scene for one of the most popular family sitcoms of all-time. The first season revolved mainly around the family adjusting to living together. The following seasons then revolved mainly around the six kids growing up and going through puberty and childhood adolescents.","torrent":{"xt":"urn:btih:23f7664335a13b01e18b24f1ba568c435bd97eaf","amp;dn":"Brady+Bunch+Season+One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23f7664335a13b01e18b24f1ba568c435bd97eaf","infoHashBuffer":{"type":"Buffer","data":[35,247,102,67,53,161,59,1,225,139,36,241,186,86,140,67,91,217,126,175]},"announce":[],"urlList":[]}}