{"title":"Robinson Crusoe Rescued Again - Audio Documentary - MP3 - Slimoo","uid":6116027,"size":26427107,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:25fe4f59152ee564022a8adf1cd79c07e1af6331&amp;dn=Robinson+Crusoe+Rescued+Again+-+Audio+Documentary+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"_Slimoo_","files":1,"time":1295554561,"description":"Robinson Crusoe Rescued Again - Audio Comedy - BBC 4\n1 x 30 minute - 128Kbps - Mp3 - Slimoo  \n\n\n\n\n\nGlenn Mitchell examines the impact of the French television series The Adventures of Robinson Crusoe along with its extremely popular and iconic music score.\n\nAnyone who was a child in Britain between 1965 and 1981 will remember BBC1's The Adventures of Robinson Crusoe, based on Daniel Defoe's novel - or, at least, they will remember the music. The theme tune, with its rumbling introductory notes suggesting the rolling waves of the on-screen title sequence, remains distinctive, as does the full incidental score, comprising numerous cues that in each case represent some part of Crusoe's existence.\n\nIt was filmed in the Canary Islands as a group of mini-series based on classic novels. Unlike most adaptations of the novel, this production concentrated not merely on events on the island, but incorporated Crusoe's other adventures, told in flashback.\n\nIn 1964 the series was shown both in Europe and, in an English-dubbed edition, on American TV. By the time this version was screened on BBC1 in October 1965, it had been divided into thirteen 25-minute episodes. The series immediately captured the imagination of schoolboys everywhere - among them the writer and presenter of this programme, Glenn Mitchell.\n\nThe programme sets out to track down Crusoe actor Robert Hoffman, whose subsequent international career has included numerous features and the TV series Dallas. Now in his seventies, he still lives in his native Salzburg.\n\nInitial tea-time screenings made way for early-morning repeats in every school holiday until 1981. Crusoe had become almost a clichÃƒÂ©, and few noticed its departure from the schedules when black-and-white shows such as these were being consigned to skips.\n\nSome claim the BBC prints were simply dumped, and others maintain that they were returned to a vault in France in 1982. When, after almost two decades, interest was expressed in a video release, the only surviving copies proved to be this 13-part English edition, in material requiring extensive restoration. Crusoe was rescued only from this single, fragile source and subsequently released on VHS and, more recently, DVD. Of the original French version, nothing remained but the first episode, rendered useless by Portuguese subtitles. It did, however, reveal that the French original had a different, and inferior, music score, fortunately replaced by the music of Robert Mellin - formerly a hit songwriter in Britain - and Gian-Piero Reverberi.\n\nBefore the series itself was recovered, the original music recordings had been rescued by Mark Ayres, a composer who has worked on incidental scores for Dr Who, has remastered audio tracks for the commercial release of vintage Who episodes, and was involved in the latter days of the BBC Radiophonic Workshop. Ayres' work on the few remaining tapes produced a CD of the score in 1990, followed by an expanded edition in 1997 after composer Mellin had supplied some second-generation tapes of the edited cues.\n\nThe programme features contributions from fans Lawrence Marcus and David West, along with composer's Mark Ayres and Gian-Piero Reverberi.\n\nWith readings by Barnaby Gordon the programme is produced by Stephen Garner\n\n\n\n\n\n\n\nAudio Format    : MP3\nDuration        : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n\n[\n\n\nI post quite a few torrents if this site is down when I post a new one I don't have time to keep trying.\nIf it's down then it's skipped.\n\nYou can follow me on Twitter so you don't miss any\n\n\nOr add the RSS feed in uTorrent (In FEEDS on the left add)\n\n.","torrent":{"xt":"urn:btih:25fe4f59152ee564022a8adf1cd79c07e1af6331","amp;dn":"Robinson+Crusoe+Rescued+Again+-+Audio+Documentary+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25fe4f59152ee564022a8adf1cd79c07e1af6331","infoHashBuffer":{"type":"Buffer","data":[37,254,79,89,21,46,229,100,2,42,138,223,28,215,156,7,225,175,99,49]},"announce":[],"urlList":[]}}