{"title":"Coast to Coast AM - 11 -20 - 10  - Druids &amp; English Magic","uid":5978198,"size":57687094,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:26716b55b58ec790011b1ccb55900a86f45a2b3e&amp;dn=Coast+to+Coast+AM+-+11+-20+-+10++-+Druids+%26+English+Magic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":6,"time":1290508221,"description":"Druids &amp; English Magic\n\nDate: 11-20-10\nHost: Ian Punnett\nGuests: Philip Carr-Gomm, James Chiles\n\nPracticing Druid Philip Carr-Gomm joined Ian to talk about his life as a Druid and the magical world of England. He traced his evolution within Druidry to his teenage years when he first began studying under an old Druidic chief. He explained the main focus of training within Druidry is to &quot;open you up to the potential that you have within you.&quot; Eventually joining the man's Order, Carr-Gomm went on to become the chief of the group after his mentor died in 1988. Nine years later he was contacted by his deceased mentor via a series of lucid dreams which contained profound sychronicities that revealed themselves over the following year.\n\nOn why England has been a hotbed for magical activity throughout the ages, Carr-Gomm offered a variety of reasons. From an esoteric point of view he noted the island has had a magical reputation dating back to Julius Caesar's writings. In addition to that Carr-Gomm pointed out it also has a &quot;secret history&quot; of magical figures such as John Dee who are fleetingly revealed to be major players behind the political powers-that-be. From a sociological perspective Carr-Gomm observed as theempire grew, it fanned out around the world, and as its native denizens returned home they brought with them many magical traditions and secrets from the realms they explored. He also creditedculture which celebrates eccentric personalities as well as the expanse of the English language as reasons &quot;which might explain why it has become a crucible for these magical traditions.&quot;\n\nCarr-Gomm also shared an introductory lesson in what he called the &quot;psychological side&quot; of magical skills. During difficult or tense situations such as an encounter with a surly waiter or an upset spouse he suggested one imagine they are wearing a pair of &quot;magical bifocals.&quot; These glasses, he said, still allow the wearer to see a person's aggressive behavior, but &quot;when you move your vision up, you see the divine part of them. You see them as a radiant soul, as who they really are.&quot; From there he advised that one should pause and then simply smile at them, be warm to them and &quot;connect at that level with them.&quot; This methodology, Carr-Gomm said, shifts us from being reactionary or &quot;fear-based&quot; and instead creates a connection that allows us to &quot;work out of a place of trust.&quot; Ultimately this simple technique encapsulates one level of magic which Carr-Gomm described as &quot;a way of transforming ourselves, a kind of technology of personal change.&quot;\n\nAtmospheric Anomaly\n\nDuring the first half hour, researcher James Chiles discussed an odd photo he took which shows a &quot;brief atmospheric anomaly.&quot; A self-described &quot;cloud chaser,&quot; Chiles said he's been photographing the sky as a hobby for the last three years and stumbled upon this picture while evaluating his archive of photos. While he likened the anomaly to some kind of &quot;plasma ring&quot; and mused that it could be &quot;a lucky shot of a new phenomena,&quot; Chiles was open to other interpretations, noting the image constitutes a &quot;tabula rasa&quot; where the viewer can impose their own interpretations of what is in the picture.\n\nWebsite(s):\nphilipcarrgomm.druidry.org\n\nBook(s):\nBook of English Magic\nDruid Mysteries\nInviting Disaster\nSacred Places","torrent":{"xt":"urn:btih:26716b55b58ec790011b1ccb55900a86f45a2b3e","amp;dn":"Coast+to+Coast+AM+-+11+-20+-+10++-+Druids+%26+English+Magic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26716b55b58ec790011b1ccb55900a86f45a2b3e","infoHashBuffer":{"type":"Buffer","data":[38,113,107,85,181,142,199,144,1,27,28,203,85,144,10,134,244,90,43,62]},"announce":[],"urlList":[]}}