{"title":"Democracy Now - 09 nov 2010","uid":5945058,"size":449186017,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:271e5b54e2ab2488a8400eef61c83ed8ab743f0c&amp;dn=Democracy+Now+-+09+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1289331826,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 09, 2010\n\n- U.S. Defends Right to Assassinate U.S. Citizens\n- Move to Repeal DADT Stalling in Senate\n- Connecticut Couple Sues to Overturn Defense of Marriage Act\n- Commission: Cost Cutting Had No Role in BP Spill\n- Netanyahu Speech Disrupted in New Orleans\n- U.S. Offers to Drop Sudan from List of Terrorist Nations\n- Lori Berenson Released on Parole\n- Anti-Nuke Protests Continue in Germany\n- Federal Court Holds Hearing on Mumia Abu-Jamal Sentencing\n- Hedge Fund Manager Escapes Felony Charges Thanks to His Job\n- Bush: Waterboarding Was Legal &quot;Because the Lawyer Said It Was&quot;\n- Bush: Kanye West's Remark Was &quot;Disgusting Moment, Pure and Simple&quot;\n\n\nSpecial reports\n\n- As Obama Arrives in Jakarta, Secret Docs Show U.S.-Backed Indonesian Special Forces Unit Targets Papuan Churches, Civilians\n\nPresident Obama arrived in Indonesia today on the second stop of a ten-day trip to Asia. It's Obama's first state visit to Indonesia after having lived there for four years as a child. We go to Jakarta to speak with investigative journalist and activist Allan Nairn, who has just released secret documents from Kopassus-the feared Indonesian special forces to which Obama has just restored funding. While Obama talks about human rights, the documents indicate that Kopassus targets churches and civilians and includes a Kopassus enemies list topped by a local Baptist minister in West Papua. [includes rush transcript-partial]\n\n\n- Widow of Poisoned Indonesian Human Rights Activist Munir Calls on Indonesia To Hold His Killers Responsible\n\nWe look at the case of Munir Thalib, an Indonesian human rights activist and a prominent critic of the Indonesian government and military. He was poisoned to death aboard a flight to Holland in September 2004. An off-duty pilot was found guilty for his death, but prosecutors ignored the findings of an independent investigation that pointed to the involvement of Indonesia's State Intelligence Agency. We speak with his widow, Suciwati Munir, who has led the struggle for justice in her husband's murder.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:271e5b54e2ab2488a8400eef61c83ed8ab743f0c","amp;dn":"Democracy+Now+-+09+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"271e5b54e2ab2488a8400eef61c83ed8ab743f0c","infoHashBuffer":{"type":"Buffer","data":[39,30,91,84,226,171,36,136,168,64,14,239,97,200,62,216,171,116,63,12]},"announce":[],"urlList":[]}}