{"title":"America - The Border (Version 2) (2nafish)","uid":5953966,"size":150259716,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2786ab6159941852edc3cccb4a9432c8e2555b40&amp;dn=America+-+The+Border+%28Version+2%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1289642654,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nYour Move is the eleventh original studio album by American folk rock duo America, released by Capitol Records in June 1983. It was produced by Russ Ballard who also wrote most of the songs.\n\nThis album was a minor hit in the US, reaching number 81 on the Billboard album chart. It includes America's last top 40 hit &quot;The Border&quot; which reached 33 on the Billboard singles chart and number 4 on the Adult Contemporary chart. &quot;Cast the Spirit&quot; was also released as a single but failed to chart (peaking at #185). &quot;Tonight is for Dreamers&quot; and &quot;She's a Runaway&quot; received some radio airplay.\n\nAmerica is an American folk rock musical band, composed originally of members Gerry Beckley, Dewey Bunnell, and Dan Peek. The three members were barely past their teenage years when they became a musical sensation during 1972, scoring #1 hits and winning a Grammy for best new musical artist. Their recording success was almost entirely throughout the 1970s; some of the band's best known songs are &quot;A Horse with No Name&quot;, &quot;Sister Golden Hair&quot; (both of which reached #1), &quot;Ventura Highway&quot;, &quot;Tin Man&quot;, &quot;Daisy Jane&quot;, and &quot;Lonely People&quot;.\n\nSome of the band's singles and albums were successful commercially, and they attracted the services of The Beatles' producer, George Martin, for a series of seven albums.\n\nThe band suffered a heavy blow when Dan Peek quit the group in 1977, right at its apex, but Beckley and Bunnell returned America to the top 10 as a duo with &quot;You Can Do Magic&quot; in 1982. Continuing to tour (for almost four decades now), America maintains a loyal fan base and performs over 100 shows per year.\n\nOn January 16, 2007, America released Here &amp; Now, the band's first major label studio album in over twenty years.\n\nHaving had some success with Russ Ballard, Beckley and Bunnell decided to have the former Argent performer produce their album, Your Move, in its entirety. In the end, Ballard wrote most of the songs and performed most of the instruments in addition to his production duties. For the most part Beckley and Bunnell were singers on an album that Ballard had crafted for them, although they did contribute some material of their own. On one track, Bunnell decided to rewrite Ballard's lyrics, and the successful song &quot;The Border&quot; was the result. Set to the backing of the Royal Philharmonic Orchestra and the saxophone work of Raphael Ravenscroft, the single scored #33 on the charts in August 1983. &quot;The Border&quot; was much more successful on the adult contemporary charts, where it scored #4 (even besting &quot;You Can Do Magic&quot;). It also made #24 on the Dutch Top 40. A second single, Ballard's &quot;Cast The Spirit&quot;, failed to chart. The album itself, released in June 1983, was reasonably successful at #81, but something of a disappointment when compared to its predecessor.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2786ab6159941852edc3cccb4a9432c8e2555b40","amp;dn":"America+-+The+Border+%28Version+2%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2786ab6159941852edc3cccb4a9432c8e2555b40","infoHashBuffer":{"type":"Buffer","data":[39,134,171,97,89,148,24,82,237,195,204,203,74,148,50,200,226,85,91,64]},"announce":[],"urlList":[]}}