{"title":"Motorhead - Going To Brazil (Live-Germany) (2nafish)","uid":6072454,"size":84856836,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2796f0ca5135556a22617926bb48f26f754bc3ac&amp;dn=Motorhead+-+Going+To+Brazil+%28Live-Germany%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":1,"time":1293687567,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n1916 is the ninth studio album by the British band MotÃƒÂ¶rhead. It was released on February 26, 1991 on WTG Records.\n\nThis was their first album recorded for WTG after the legal battle with GWR Records was resolved. In the album's liner notes, the band says &quot;...to the people we left behind - we didn't want to leave ya, but we really had to go! This album is the better for it. Stale and on a treadmill in our career, a change was needed.&quot;\n\nThe title track is a reflection on World War I killings, it is an uncharacteristically slow ballad in which Lemmy's singing is only lightly accompanied. &quot;Love Me Forever&quot;, a ballad which was later covered by Doro Pesch. &quot;R.A.M.O.N.E.S.&quot;, a tribute to punk band the Ramones, was later recorded by the Ramones, which can be found as one of the two studio tracks on Greatest Hits Live. The Ramones also performed it at their final show with Lemmy, with that show being released on video and CD as We're Outta Here.\n\nIn the studio the band recorded four songs with the producer, Ed Stasium, before deciding he had to go. When Lemmy listened to one of the mixes of &quot;Going to Brazil&quot;, he asked for him to turn up four tracks, and on doing so heard claves and tambourines Stasium had added. Stasium was fired and Pete Solley was hired as producer. The story, according to Stasium, was Lemmy's drug and alcohol intake had far exceeded the limitations of Stasium's patience so he quit.\n\nThe album reached number 24 in UK charts and was nominated for the Grammy Award for Best Metal Performance at the 1992 Grammys, but lost to Metallica's Metallica.\n\nDue to an unintentional oversight, the French, Bulgarian, Russian, Serbian and Portuguese flags were not featured on the album artwork.\n\nThe postergramme would be the last programme for the band until the 30th Anniversary Tour in 2005.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2796f0ca5135556a22617926bb48f26f754bc3ac","amp;dn":"Motorhead+-+Going+To+Brazil+%28Live-Germany%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2796f0ca5135556a22617926bb48f26f754bc3ac","infoHashBuffer":{"type":"Buffer","data":[39,150,240,202,81,53,85,106,34,97,121,38,187,72,242,111,117,75,195,172]},"announce":[],"urlList":[]}}