{"title":"Cyber Update Jan.2011-------DB-11394 LillaKatt","uid":6121210,"size":760584619,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:29014f62f4065fe0052b2702a0930747a1aa12bf&amp;dn=Cyber+Update+Jan.2011-------DB-11394+LillaKatt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":267,"time":1295749367,"description":"From Kink.com   ( Device Bondage )  + Pics\n\n\n\nQ: What happens when you give two seasoned BDSM lifestyle players free rein over the Device Bondage set for a day? A: Agonizingly heavy corporal punishment and overwhelming screaming orgasms.\n\nSergeant Major locks Lilla's neck and hands into some heavy wooden stocks and chains them to the ceiling. He gives her some incentive to stay still by running a chain across her crotch, putting cold, metallic pressure on her pussy. The Sarge breaks out the cane and stripes Lilla's ass a lovely pink color while she marches in place. Weighted clover clamps tug on Lilla's puffy nipples as she takes some hard flogging on her ass and pussy. The Sarge gags Lilla with her wet panties and rips an orgasm from her cunt. He fills her tight pussy with a dick and watches her rock back and forth, fucking herself while he canes her ass hard.\n\nThe Sarge straps Lilla onto the Sybian, arms straight up, and gagged with vet wrap. He covers the front of her body with vicious black clips, and runs a cane over them so Lilla can feel them biting into her tender skin. The Sybian does its job while Sarge canes Lilla's ass and whips those clips off one at a time, bringing Lilla to screaming thrashing orgasm. The Sarge blindfolds her, pulls off the remaining clips and flogs Lilla's raw overstimulated pussy while she comes hard again and again, letting us all know whose little slut she is.\n\nFinally, the Sarge bends Lilla over a metal horse and straps her in place with leather belts, leaving her ass and pussy open for general abuse. He runs the Whartenberg wheel all over her body, paying special attention to her puckering asshole and pussy lips. He pokes her with a nasty sharpened chopstick, and then snaps it hard against her skin, stinging her ass and legs. He fills her wet cunt with Omega, and cranks it up high, giving Lilla one of the most intense orgasms of her life. The Sarge then hooks Lilla's fine ass, ties it off to her hair and watches her try not to squirm as he closes out the day with one last hard caning.\n\n\n\nScreens &lt;a href=&quot; http://www.devicebondage.com/site/shoot.jsp?shootId=11394&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.devicebondage.com/site/shoot.jsp?shootId=11394&lt;/a&gt;\n\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:29014f62f4065fe0052b2702a0930747a1aa12bf","amp;dn":"Cyber+Update+Jan.2011-------DB-11394+LillaKatt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29014f62f4065fe0052b2702a0930747a1aa12bf","infoHashBuffer":{"type":"Buffer","data":[41,1,79,98,244,6,95,224,5,43,39,2,160,147,7,71,161,170,18,191]},"announce":[],"urlList":[]}}