{"title":"Salvando.las.Distancias.HDRip. ","uid":6102077,"size":1945280512,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:295149ec22b49e8d5bcc5ac748ec450deec27227&amp;dn=Salvando.las.Distancias.HDRip.+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1295011008,"description":"Calidad de video: HD Rip\nPeso: 1800 mb\nIdioma del audio: Castellano AC3 5.1\n\nLa ironia y la franqueza sin rodeos de Erin (Drew Barrymore) cautivan al recien declarado soltero Garrett (Justin Long) con unas cervezas, una conversacion trivial de bar y un desayuno a la manana siguiente de por medio. La quimica existente entre ellos origina una aventura de verano en toda regla, pero ninguno de los dos cree que vaya a durar una vez que Erin vuelva a casa a San Francisco y Garrett se quede en Nueva York, donde trabaja. Sin embargo, cuando seis semanas dandose revolcones por la ciudad se convierten sin querer en algo significativo, ninguno de los dos esta seguro de querer que eso acabe. Aunque los amigos de Garrett, Box (Jason Sudeikis) y Dan (Charlie Day), hagan bromas sobre su metodo para perder calorias y su relacion a tiempo completo con el telefono movil, no les hace gracia la idea de perder a su mejor companero de juergas por culpa de otra incierta historia de amor. Al mismo tiempo, Corrine (Christina Applegate), la nerviosa y sobreprotectora hermana casada de Erin, quiere evitar que recorra otra vez un camino de sobras conocido. No obstante, a pesar de vivir cada uno en un extremo del pais, de las reticencias de los amigos y la familia y de algunas tentaciones inesperadas, la pareja podria haber encontrado algo parecido al amor y, con la ayuda de mucho SMS, algunos de ellos subidos de tono, y llamadas a deshora podrian acortar las distancias. \n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:295149ec22b49e8d5bcc5ac748ec450deec27227","amp;dn":"Salvando.las.Distancias.HDRip.+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"295149ec22b49e8d5bcc5ac748ec450deec27227","infoHashBuffer":{"type":"Buffer","data":[41,81,73,236,34,180,158,141,91,204,90,199,72,236,69,13,238,194,114,39]},"announce":[],"urlList":[]}}