{"title":"Watch the Skies (TV) [2005]","uid":6043704,"size":560654455,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:29b260062789700c355a34d1f009a47886b30bb7&amp;dn=Watch+the+Skies+%28TV%29+%5B2005%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1292465607,"description":" &lt;a href=&quot;http://bayimg.com/eABhaAAdh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/eABhaAAdh&lt;/a&gt;\n\nWatch the Skies!: Science Fiction, the 1950s and Us (TV 2005) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0469222/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0469222/&lt;/a&gt;\n\nFrom George Melies' 1903 fantasy A Trip to the Moon to Steven Spielberg's War of the Worlds and George Lucas' Star Wars Episode III: Revenge of the Sith, science fiction has been an important fixture of the cinematic medium. \n\nWATCH THE SKIES! looks at the history of science fiction movies from the silent era all the way up to the present. The one-hour documentary will look at six different areas within the genre:\n\n- Atomic Anxiety: During the 1950s, especially, atomic bombs were on everyone's mind, and that made the issue ripe for adaptation to film. Among the movies have used the atomic story angle are The Beat from 20,000 Fathoms, Godzilla: King of the Monsters, The Incredible Shrinking Man and even the low-budge Attack of the Killer Tomatoes.\n\n- Rockets to the Moon: Space travel has been the subject of science fiction since Melies' A Trip to the Moon, which set off a tradition that would later include such movies as Rocket Ship XM, The Angry Red Planet and the classic Forbidden Planet.\n\n- Mars (and Everything Else) Attacks: Beings from outer space had a horrible reputation for destruction in the movies for a long time, with such spine-tingling entries as The Thing (From Another World), Earth vs. The Flying Saucers, I Married a Monster from Outer Space, Invasion of the Body Snatchers andThe Blob, not to mention The War of the Worlds, both the George Pal original and the upcoming Spielberg remake.\n\n- The Word from on High: Not all visitors to this planet have been malevolent. Beginning with Robert Wise's The Day the Earth Stood Still, aliens with a message of peace have been preaching to their lowly human counterparts. Even Spielberg's ET: The Extra Terrestrial had something to teach the world.\n\n- Post-Apocalypse Now: With the threat of nuclear bombs, it would only make sense that post-apocalyptic visions would also become a staple of the science fiction genre, with such movies as The Omega Man, The Planet of the Apes and The Terminator movies.\n\n- Escapes to the Future: Envisioning the future put Jules Verne and H.G. Wells on the map and continues to serve science fiction cinema with such classics as 2001: A Space Odyssey, Things To Come and Metropolis. \n\nSchickel, perhaps best known as a film critic for Time magazine for more than two decades, is also the author of more than 20 books, mostly about the movies. The latest of them, Matinee Idylls: Reflections on the Movies, was named a New York Times notable book. He has also written, directed and produced a wide variety of television programs, including Shooting War, AFI's 100 Years' 100 Movies, Eastwood on Eastwood, The Harryhausen Chronicles, The Moviemakers and Elia Kazan: A Director's Journey. He also created &quot;The Men Who Made the Movies&quot; series, as well as profiles of such stars as James Cagney, Gary Cooper, Myrna Loy and Barbara Stanwyck. In addition to Matinee Idylls, Schickel's other books include The Disney Version, Intimate Strangers, Schickel on Film, Marlon Brando: A Life, Double Indemnity and Clint Eastwood: A Biography. \n\n","torrent":{"xt":"urn:btih:29b260062789700c355a34d1f009a47886b30bb7","amp;dn":"Watch+the+Skies+%28TV%29+%5B2005%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29b260062789700c355a34d1f009a47886b30bb7","infoHashBuffer":{"type":"Buffer","data":[41,178,96,6,39,137,112,12,53,90,52,209,240,9,164,120,134,179,11,183]},"announce":[],"urlList":[]}}