{"title":"ABOVE US THE WAVES","uid":5943631,"size":4218517504,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2a8fd01d30f647530c992890a0b03c8ecfd9418d&amp;dn=ABOVE+US+THE+WAVES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sexyboy1982","files":12,"time":1289271328,"description":"The Royal Navy is concerned about constant attacks on convoys and wants to remove the support given to German submarines. Despite scepticism in higher echelons that such an operation is feasible, Commander Fraser (Mills) is determined to prove that it is practical.\n He trains a force of officers and ratings at their Scottish base, from where an attack is launched on the Tirpitz, using miniature submarines (X Class) to attach mines.\n The initial operation, using \\\\\\&quot;chariots\\\\\\&quot; (manned torpedoes), fails and the crew are forced to abandon ship and land in Norway. They walk to neutral Sweden, from where they are returned to Scotland.\n The next operation uses three small submarines (X1, X2, X3)with the crew inside. They are initially towed by conventional submarines, and are then left to penetrate the area where the German ship is anchored.\n Two crews manange to approach undetected and drop their mines. They then scuttle the submarines and are picked up by the crew of Tirpitz, to be taken away as POWs. The third (X2) is too badly damaged to surface and explodes, killing the crew.\n The other mines explode as planned, badly damaging the ship\n","torrent":{"xt":"urn:btih:2a8fd01d30f647530c992890a0b03c8ecfd9418d","amp;dn":"ABOVE+US+THE+WAVES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a8fd01d30f647530c992890a0b03c8ecfd9418d","infoHashBuffer":{"type":"Buffer","data":[42,143,208,29,48,246,71,83,12,153,40,144,160,176,60,142,207,217,65,141]},"announce":[],"urlList":[]}}