{"title":"Democracy Now - 17 dec 2010","uid":6047221,"size":432295034,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2aebc27990b41c6636c85674bd1a9a234a3fd785&amp;dn=Democracy+Now+-+17+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1292602908,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 17, 2010\n\n- WikiLeaks Founder Assange Freed from London Jail\n- House Judiciary Chair Voices Concern on WikiLeaks Attacks\n- U.S. to Sign U.N. Declaration on Indigenous Rights\n- Congress Sends Tax Package to Obama; Estate Tax Kept at Lower Rate\n- GOP Blocks Passage of Spending Bill\n- New U.S. Guidelines Reject Afghan Demand to End Night Raids\n- War Review Claims U.S. Progress in Afghanistan\n- Dozens Arrested at Veteran-Led Antiwar Protest\n- Red Cross Warns of Deteriorating Conditions in Afghanistan\n- Lockdown Ends in Georgia Prison Strike\n- Appeals Court Rejects Admin on Cell Phone Tracking\n- Report: Prince to Sell Blackwater, Keep Financial Stake\n\n\nSpecial reports\n\n- WikiLeaks Founder Julian Assange Vows to Resume Whistleblowing After Release From London Jail\n\nWikiLeaks founder Julian Assange has been freed from a London prison after a High Court ruled he could be released on bail. Assange spent the past nine days in solitary confinement following his arrest on an international warrant to face sex crimes allegations in Sweden. In a brief statement outside the courthouse, Assange thanked his supporters and vowed to continue his work.\n\n\n- WikiLeaks Cables: Pfizer Targeted Nigerian Attorney General to Undermine Suit Over Fatal Drug Tests\n\nDiplomatic cables released by WikiLeaks show the pharmaceutical giant Pfizer hired investigators to find evidence of corruption against the Nigerian attorney general to pressure him to drop a $6 billion lawsuit over fraudulent drug tests on Nigerian children. Researchers did not obtain signed consent forms, and medical personnel said Pfizer did not tell parents their children were getting the experimental drug. Eleven children died and others suffered disabling injuries including deafness, muteness, paralysis, brain damage, loss of sight, slurred speech. We speak to Washington Post reporter Joe Stephens, who helped break the story in 2000; and Musikilu Mojeed, a Nigerian journalist who has worked on this story for the Next newspaper in Lagos.\n\n\n- Deadly Medicine: FDA Fails to Regulate Rapidly Growing Industry of Overseas Drug Testing\n\nPharmaceutical companies are increasingly conducting clinical trials for new drugs outside the U.S., usually in countries where regulations are less stringent and trials are much cheaper, often leading to deadly results. Twenty years ago, only 271 trials of drugs intended for use by Americans were conducted overseas. By 2008, the number had risen to nearly 6,500-many taking places in areas with poor and illiterate test subjects. Journalist Jim Steele joins to talk about his special investigation just published in Vanity Fair.\n\n\n- Study: Pharmaceutical Drug Companies Top Military Industry in Defrauding U.S. Gov't\n\nA new study by the watchdog group Public Citizen has found that the pharmaceutical drug industry has become the biggest defrauder of the federal government, surpassing the defense industry. Public Citizen found that the drug industry paid out nearly $20 billion in penalties over the past two decades for violations of the False Claim Act. More than half of the industry's fines were paid by just four companies: GlaxoSmithKline, Pfizer, Eli Lilly and Schering-Plough.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2aebc27990b41c6636c85674bd1a9a234a3fd785","amp;dn":"Democracy+Now+-+17+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aebc27990b41c6636c85674bd1a9a234a3fd785","infoHashBuffer":{"type":"Buffer","data":[42,235,194,121,144,180,28,102,54,200,86,116,189,26,154,35,74,63,215,133]},"announce":[],"urlList":[]}}