{"title":"Driven DVDR PAL Catellano Ingles","uid":6106923,"size":4680843264,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2b52d0f171db4896d0d8e689ce8156c87fd4ffdd&amp;dn=Driven+DVDR+PAL+Catellano+Ingles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"20484","files":46,"time":1295200465,"description":"Drama de acciÃƒÂ³n ambientado en el peligroso y emocionante mundo de las carreras de co-ches, &quot;Driven&quot; sigue la pista a cuatro pilotos adictos a la adrenalina. El dotado pero impe-tuoso principiante Jimmy Bly (Kip Kardue) pierde posiciones en los rankings al no poder aguantar la presiÃƒÂ³n a la que le somete su ambicioso hermano y promotor (Robert Sean Leonard). Tampoco le ayuda el hecho que Bly quiere empezar una relaciÃƒÂ³n con Sophia (Estella Warren), la novia de su mÃƒÂ¡ximo com-petidor, el campeÃƒÂ³n Beau Brandenburg (Til Schweiger). Con tantos problemas encima, el veterano dueÃƒÂ±o de la escuderÃƒÂ­a Carl Henry (Burt Reynolds), pide ayuda a la antigua estrella del automovilismo Joe Tanto (Sylvester Stallone), cuya esplÃƒÂ©ndida carrera se vio trun-cada tras un trÃƒÂ¡gico accidente que casi le cuesta la vida a ÃƒÂ©l y a otro piloto. Pero para conseguir que Bly llegue a la cima, Tanto de-berÃƒÂ¡ lidiar con su terrible pasado, lidiar con una incisiva reportera (Stacy Edwards) que se halla cubriendo el exclusivamente mascu-lino mundo de las carreras, y pelearse con Cathy (Gina Gherson), su ex mujer, ahora casada con el que fue su rival directo, Memo Moreno (CristiÃƒÂ¡n de la Fuente). Atrapado entre el ÃƒÂ©xito, el fracaso, los remordimientos y la necesidad imperiosa de velocidad, los cua-tro pilotos no tienen mÃƒÂ¡s remedio que apretar a fondo el acelerador en pos de la redenciÃƒÂ³n y la gloria.","torrent":{"xt":"urn:btih:2b52d0f171db4896d0d8e689ce8156c87fd4ffdd","amp;dn":"Driven+DVDR+PAL+Catellano+Ingles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b52d0f171db4896d0d8e689ce8156c87fd4ffdd","infoHashBuffer":{"type":"Buffer","data":[43,82,208,241,113,219,72,150,208,216,230,137,206,129,86,200,127,212,255,221]},"announce":[],"urlList":[]}}