{"title":"Salvando Las Distancias[BRScreener].avi","uid":5963613,"size":1693483008,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2baea4f6b62027fe1828490769a0db957a5e968a&amp;dn=Salvando+Las+Distancias%5BBRScreener%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sonyds","files":1,"time":1290035449,"description":"Calidad de video: Blu-Ray Screener\nPeso: 1570 mb\nIdioma del audio: EspaÃƒÂ±ol \n\nLa ironÃƒÂ­a y la franqueza sin rodeos de Erin (Drew Barrymore) cautivan al reciÃƒÂ©n declarado soltero Garrett (Justin Long) con unas cervezas, una conversaciÃƒÂ³n trivial de bar y un desayuno a la maÃƒÂ±ana siguiente de por medio. La quÃƒÂ­mica existente entre ellos origina una aventura de verano en toda regla, pero ninguno de los dos cree que vaya a durar una vez que Erin vuelva a casa a San Francisco y Garrett se quede en Nueva York, donde trabaja. Sin embargo, cuando seis semanas dÃƒÂ¡ndose revolcones por la ciudad se convierten sin querer en algo significativo, ninguno de los dos estÃƒÂ¡ seguro de querer que eso acabe. Aunque los amigos de Garrett, Box (Jason Sudeikis) y Dan (Charlie Day), hagan bromas sobre su mÃƒÂ©todo para perder calorÃƒÂ­as y su relaciÃƒÂ³n a tiempo completo con el telÃƒÂ©fono mÃƒÂ³vil, no les hace gracia la idea de perder a su mejor compaÃƒÂ±ero de juergas por culpa de otra incierta historia de amor. Al mismo tiempo, Corrine (Christina Applegate), la nerviosa y sobreprotectora hermana casada de Erin, quiere evitar que recorra otra vez un camino de sobras conocido. No obstante, a pesar de vivir cada uno en un extremo del paÃƒÂ­s, de las reticencias de los amigos y la familia y de algunas tentaciones inesperadas, la pareja podrÃƒÂ­a haber encontrado algo parecido al amor y, con la ayuda de mucho SMS, algunos de ellos subidos de tono, y llamadas a deshora podrÃƒÂ­an acortar las distancias.\n\n\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:2baea4f6b62027fe1828490769a0db957a5e968a","amp;dn":"Salvando+Las+Distancias%5BBRScreener%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2baea4f6b62027fe1828490769a0db957a5e968a","infoHashBuffer":{"type":"Buffer","data":[43,174,164,246,182,32,39,254,24,40,73,7,105,160,219,149,122,94,150,138]},"announce":[],"urlList":[]}}