{"title":"Super Chikan  What You See (blues)(flac)[rogercc]","uid":5994276,"size":235874329,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2c9aef45635f32133f1abbac831fb083bc352cd0&amp;dn=Super+Chikan++What+You+See+%28blues%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rogercc1","files":12,"time":1290988534,"description":"SUPER CHIKAN  WHAT YOU SEE\nLabel Fat Possum \nOrig Year 2000\nFormat:Flac\n\n\nIs Super Chikan (aka James Johnson) a soul man or a blues man? And where's the line between the two anyway? On What You See, Chikan certainly blurs them: The title cut roars out of the blocks as if it has come straight from the funk store, a greasy wah-wah riff over some blues licks (although one of those licks sounds worryingly like the Stranglers' &quot;Peaches&quot;) and an infectious backbeat. &quot;Ain't Nobody&quot; brings in some great horns, straight out of the Stax studio, while &quot;El Camino&quot; comes close to surf blues over a New Orleans second-line rhythm. In other words, Super Chikan isn't a big believer in boundaries, and he continues to cross them at will throughout the disc -- which makes for some wonderful listening. &quot;Okie Doak&quot; is pure soul-blues, &quot;Good Thing&quot; could teach a lot of rockers how to approach the blues -- it needs to be laid-back like this -- and &quot;You Said&quot; gives it up on one of the funkiest basslines ever to emerge. There's plenty of '60s and '70s influence running through this, like the playful 12-bar synthesizer line on &quot;Willie Brown Jr.,&quot; which tends to distract from some fine blues guitar work from the man himself, stretching out a little and showing excellent taste and chops. &quot;Big Boy Now&quot; takes an archetypal blues riff, and while it doesn't add anything new, it does generate plenty of excitement, with the inevitable rooster crows (a Chikan trademark), and a humorous lyric about country music and yodeling. It all rounds out with &quot;Fighting Cock,&quot; with a riff any bluesman would give his eye teeth for, not taken too seriously (another Chikan trademark), stripped-down to the point of falling apart, and a guaranteed good time for all. Soul to blues and back again, Chikan knows his way around the rootsy side of music. ~ \n\n\nTracklist\n1.What Ya See \n2.Ain't Nobody \n3.Camino, El \n4.Okie Doak \n5.Good Thing \n6.You Said \n7.Willie Brown Jr. \n8.Blank Trip \n9.Big Boy Now \n10.Fighting Cock\n\n\n\nSuper Chikan: James &quot;Super Chikan&quot; Johnson (vocals, guitar, keyboards); Harvell Thomas (bass); Dion Thomas (drums)\n","torrent":{"xt":"urn:btih:2c9aef45635f32133f1abbac831fb083bc352cd0","amp;dn":"Super+Chikan++What+You+See+%28blues%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c9aef45635f32133f1abbac831fb083bc352cd0","infoHashBuffer":{"type":"Buffer","data":[44,154,239,69,99,95,50,19,63,26,187,172,131,31,176,131,188,53,44,208]},"announce":[],"urlList":[]}}