{"title":"Made In Xspana 5 (2011)","uid":6208795,"size":1468852224,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2e5d789de1ad9330caf4374e40e9651740d05589&amp;dn=Made+In+Xspana+5+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":2,"time":1298906124,"description":"Made In Xspana 5 (2011)\n &lt;a href=&quot;\nhttp://www.excaliburfilms.com/AdultDVD/828070D5_Made_In_Xspana_5_dvd.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.excaliburfilms.com/AdultDVD/828070D5_Made_In_Xspana_5_dvd.htm&lt;/a&gt; &lt;a href=&quot;\nhttp://www.sugardvd.com/browse/dvd/details/196609/?refaff=13335&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sugardvd.com/browse/dvd/details/196609/?refaff=13335&lt;/a&gt;\n\nStudio  Evil Angel Ea-Productions \nRelease Date  Feb 22, 2011 \nCategory  All Sex, Latin \nDirector  Nacho Vidal \nStarring  Pantera, Olga Cabraeva, Noemi Jolie, Ava Monte Real, Agatha Red, Nacho Vidal \n\nNacho Vidal's Made In X-Spana 5 presents mad Spaniard director Nacho in intense boy-girl fuck sessions with Europe's sexiest sluts! Curvy, big-assed Russian babe Olga Cabaeva gets fingered to the point of squirting and fucked beyond the point ...    Full Descriptionof no return. The husky-voiced bitch slurps Nacho's massive cock until she gets a mouthful of semen. Spanish model Agatha Red poses in a skin-tight, black latex dress and spike heels while Nacho takes still photos. It doesn't last long, though; soon he's got her sucking his huge dong and bouncing up and down on his lap, taking his fat dick to the hilt. He spurts a load on Agatha's pussy mound and watches her rub the goo into her skin.\n\nPortuguese blonde Amazon bitch Ana Monte Real bends over and spreads her mighty ass cheeks so that Nacho can admire her butthole before jamming his cock into her sopping-wet cunt. He gives the tall Latina a G-spot massage to a juicy climax, and gets his dick stroked by the bare soles of her large feet. Nacho interrupts yet another photo shoot with Spanish sexpot Noemi Jolye, dry-humping her and squeezing her gravity-defying tits. Noemi licks every inch of his veiny manhood, and rides his pole until Nacho spews hot cum in her face.\n\nFinally, dark-skinned Brazilian fuckstress Pantera has an intimate and kinky private session with Nacho. He suckles her huge, wide nipples and they compete to get each other worked up by hand. Pantera gets suspended in a harness from the ceiling and used for the Spanish stud's pleasure. In the end, she takes his pole between her big knockers and tit-fucks Nacho until he cums on her chest.\n","torrent":{"xt":"urn:btih:2e5d789de1ad9330caf4374e40e9651740d05589","amp;dn":"Made+In+Xspana+5+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e5d789de1ad9330caf4374e40e9651740d05589","infoHashBuffer":{"type":"Buffer","data":[46,93,120,157,225,173,147,48,202,244,55,78,64,233,101,23,64,208,85,137]},"announce":[],"urlList":[]}}