{"title":"Kylie Minogue - Wow (Xvid-2nafish)","uid":5964695,"size":101945688,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2f2df35783c238df2bfe02e41762b5a57a307a31&amp;dn=Kylie+Minogue+-+Wow+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1290072711,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:18\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 3977 Kbps\nQuality Factor : 0.59 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Wow&quot; is a dance-pop song performed by Australian singer Kylie Minogue for her tenth studio album, X (2007). The song was written by Minogue, Greg Kurstin and Karen Poole and was produced by Kurstin. The song was released as the album's second single in Australia and the United Kingdom in February 2008 to mixed reviews from music critics. &quot;Wow&quot; was a commercial success, reaching the top twenty on the majority of the charts it entered. The song was released as the third single from the album in Europe in June. Three CD Singles were released in New Zealand, however, due to an supposed to be amount of downloads, it did not chart on RIANZ.\n\nThe music video for &quot;Wow&quot; was directed by Melina Matsoukas and filmed in Los Angeles, California along with the video for &quot;In My Arms&quot; in early January 2008. The video features Minogue in dancing in a futuristic nightclub surrounded by dancers in alien outfits. The video begins with Minogue's silhouette dancing against a lighted background. She is then shown in a white tracksuit surrounded by a group of dancers. Scenes of Minogue and her dancers dancing in front of a lighted background are intercut throughout the video.\n\nPerezHilton.com hosted the world premiere the music video on January 29, 2008. It was scheduled to premiere on Channel 4 in the United Kingdom on January 30, 2008, but was postponed. Media regulator Ofcom removed the video after they found it did not follow viewer guidelines due to the use of strobe lighting. The video was re-edited and broadcasted in the United Kingdom the following week. In the video appears Dani Artaud (also known as DaniGORE), from the band Millionaires, as an extra.\n\nThe video is Kylie's 2nd highest viewed on YouTube, with views of 36,238,185 as of 24 August 2009.\n\n&quot;Wow&quot; received mixed reviews from pop music critics. Alex Fletcher of Digital Spy wrote that the song's &quot;disco swirls and whooshing synths are great fun&quot;, but said that &quot;Wow&quot; &quot;doesn't have the 'oomph' factor to make us fall for her like we have in the past&quot;. In a review for The Guardian, Alexis Petridis called the song &quot;fantastic&quot; and compared it to Minogue's songs with Stock, Aitken and Waterman. Pitchfork Media reviewer Tom Ewing wrote that the song's &quot;excitement is infectious&quot; even though its &quot;funked-up electro sexiness may feel contrived&quot;.\n\nThe song was first performed live on The Kylie Show in November 2007, a one off showcase of new tracks from her 2007 album X. The performance had Kylie in pigtails and foil streamer dress on a circular stage with dancers in new wave costumes and wigs, who would walk up an down a catwalk throughout the song. The video is available on YouTube.\n\nAdditionally, the song was used in the series finale montage of the American TV Show So You Think You Can Dance &quot;Wow&quot; was also used as background music in a few commercials for ABC's Desperate Housewives and Brothers and Sisters in April 2008. Minogue also performed the single &quot;All I See&quot; live on the show earlier in the year while promoting X in North America.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2f2df35783c238df2bfe02e41762b5a57a307a31","amp;dn":"Kylie+Minogue+-+Wow+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f2df35783c238df2bfe02e41762b5a57a307a31","infoHashBuffer":{"type":"Buffer","data":[47,45,243,87,131,194,56,223,43,254,2,228,23,98,181,165,122,48,122,49]},"announce":[],"urlList":[]}}