{"title":"Lost Land of the Tiger","uid":6124478,"size":3406729170,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:33264938e4be8a42b2fdc8cdf4598dd8446a9f85&amp;dn=Lost+Land+of+the+Tiger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"QuarterBall","files":-1,"time":1295883899,"description":"Lost Land of the Tiger (BBC HD)\n\nAir Date        : E1-21/09/2010, E2-22/09/2010, E3-23/09/2010\nRelease Date    : 23/01/2011\nSource          : HDTV\nGenre           : Documentary\n\nSeason #        : N/A\nEpisode #       : COMPLETE\nVideo Codec     : AVC\nVideo Container : MP4\nSize            : E1-1.06GB, E2-1.06GB, E3-1.04GB\nVideo Bitrate   : 2,542-2,585kbps\nAspect Ratio    : 16:9\nResolution      : 1280x720\nAudio Codec     : AAC\nAudio Bitrate   : Min-96kbps Max-96.5kbps\n\n\nEpisode Summaries\n\nEpisode 1:\n\nDocumentary series following a dramatic expedition searching for tigers hidden in the Himalayan Kingdom of Bhutan.\n\nWith tigers heading for extinction, an international team of big cat experts and wildlife filmmakers are given unique access to the jungles and mountains of Bhutan for what could be the last chance to save this magnificent animal.\n\nExplorer Steve Backshall is joined by sniffer dog Bruiser; together, they hunt for tigers through the dense forest undergrowth. High in the mountains, wildlife cameraman Gordon Buchanan drives himself to exhaustion tracking tigers that seem as elusive as the yeti. And in a jungle base camp, scientist George McGavin organises a firefly disco, while camerawoman Justine Evans is stuck at the top of a tree during a tropical lightning storm.\n\nFor the final team member, big cat biologist Alan Rabinowitz, time to save the tiger is running out, as he has been diagnosed with incurable leukaemia. Alan bugs the forest with remote cameras to capture whatever secretive creatures are lurking there, but ultimately he needs to find tigers if his ambitious plan to protect them across the Himalayas is to succeed.\n\nWe follow the expedition every emotional step of the way as they strive to find evidence that could help to bring wild tigers back from the brink of extinction and safeguard their future.\n\nEpisode 2:\n\nThe second part of the BBC Natural History Unit's wildlife adventure series following an expedition to search for tigers in the Himalayas.\n\nThe team strikes out from base camp to track down tigers throughout Bhutan. Kayaker Steve Backshall heads to the eastern jungles, and is pushed to the absolute limit when he takes on a mighty white-water river. Big cat cameraman Gordon Buchanan deploys remote cameras far and wide, and uses a clever fingerprinting technique to identify individual tigers from their unique stripe patterns.\n\nMeanwhile, biologist Dr George McGavin is on a mission to India, where he finally comes face-to-face with the king of the jungle.\n\nWe follow the expedition every emotional step of the way as they strive to find evidence that could help to bring wild tigers back from the brink of extinction and safeguard their future.\n\nEpisode 3:\n\nThe climax to the BBC Natural History Unit's wildlife adventure series searching for tigers in the Himalayas.\n\nFollowing extraordinary rumours of tigers living in the mountains of Bhutan, the expedition shifts to high altitude. Cameraman Gordon Buchanan captures remarkable footage of a snow leopard cub from over 5,000 metres in the air.\n\nAlong the Tibetan border, explorer Steve Backshall treks to the mystical Tiger Mountain. Helped by a remote tribe, he has a very close encounter with the world's most elusive predator.\n\nThe plight of the endangered tiger brings biologist Dr George McGavin to tears, and the team present their findings to the Bhutanese Prime Minister. As the expedition culminates, Gordon makes the discovery of a lifetime.\n","torrent":{"xt":"urn:btih:33264938e4be8a42b2fdc8cdf4598dd8446a9f85","amp;dn":"Lost+Land+of+the+Tiger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33264938e4be8a42b2fdc8cdf4598dd8446a9f85","infoHashBuffer":{"type":"Buffer","data":[51,38,73,56,228,190,138,66,178,253,200,205,244,89,141,216,68,106,159,133]},"announce":[],"urlList":[]}}