{"title":"Alyssa Branch - GloryHole.com","uid":6074774,"size":175871693,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:334459a0fdd17eaa6941901179952c142e28f914&amp;dn=Alyssa+Branch+-+GloryHole.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1293781823,"description":"Screens: &lt;a href=&quot;\nhttp://www.picswan.com/adult/share-D097_4D1D7D13.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picswan.com/adult/share-D097_4D1D7D13.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picswan.com/adult/share-1D94_4D1D7D13.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picswan.com/adult/share-1D94_4D1D7D13.html&lt;/a&gt;\n\n\nGloryHole - Alyssa Branch\nAdded: December 30, 2010\n\nThere\\'s no better way for a white girl to really piss off the family. Getting into trouble with the law is one way. Fucking a cock that\\'s a few shades off of white is another excellent way. Throw in both scenarios and you have daddy\\'s little girl getting thrown out of the inheritance. Alyssa Branch has just entered an exclusive club:White girls who crave black cock in public places. She\\'s heard through the grapevine that this bathroom stall has frequent African-American visitors that give white girl\\'s thrills and their parents the chills. Alyssa relaxes into her new surroundings by getting naked and rubbing her white love button until the rumored black cock makes its appearance. Much like a hungry whore Alyssa\\'s mouth wastes no time in housing a black cock that rivals the kind she\\'s watched in the interracial porn her older sister has on her computer. The bobbing, the sucking, the gagging and the slurping are what Alyssa is all about with the black stranger behind the wall feeling the full benefits. The white pussy she\\'s been walking around with is about to have it\\'s seal of freshness broken by the black cock she\\'s been using to give herself an oral exam with. The screams coming from her lung kick start right when the tip of the black cock makes its way past her clit and deep in her uterus. Alyssa\\'s blond hair sticks to her face from the sweat dripping down her forehead. This interracial ordeal only ends when her pussy nearly falls off and the black cock spits its black venom directly at her blue eyes.[/center]","torrent":{"xt":"urn:btih:334459a0fdd17eaa6941901179952c142e28f914","amp;dn":"Alyssa+Branch+-+GloryHole.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"334459a0fdd17eaa6941901179952c142e28f914","infoHashBuffer":{"type":"Buffer","data":[51,68,89,160,253,209,126,170,105,65,144,17,121,149,44,20,46,40,249,20]},"announce":[],"urlList":[]}}