{"title":"Zimbabwe - State of Denial  2011 01 20  Aljazeera ","uid":6121522,"size":284071464,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3449fce3fa980aee67510a4dc3330d61aff10a39&amp;dn=Zimbabwe+-+State+of+Denial++2011+01+20++Aljazeera+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"john1942","files":1,"time":1295771610,"description":"Zimbabwe - State of Denial  2011 01 20  Aljazeera \n\n\n270mb/48mins/avi\n\nThe Rageh Omaar Report examines the state of Zimbabwe as it turned 30. Thirty years after becoming a nation, and 30 years after Robert Mugabe and ZANU PF came to power, Zimbabwe does not appear to have fulfilled the hopes that so many had at independence.\n\nA country which was meant to have buried the racism of white minority rule has once again become a place where some Zimbabweans are more equal than others. A land which once exported billions in agricultural products will, it seems, spend another year reliant on food aid.\n \nThe disputed 2008 election brought about a government of national unity in which ZANU PF, in theory, ceded some of its power to the opposition Movement for Democratic Change (MDC). But this is a marriage of convenience which appears to have satisfied neither party.\n\nZANU PF feel they should not have to share power with a party they consider to be a puppet of the West, while the MDC are unable to exercise authority as an equal partner in government. The explanations for this crisis are equally polarised.\n\nThe MDC says it is the result of 30 years of bad governance and kleptocracy. ZANU PF says it is the responsibility of the international community which has, it claims, isolated Zimbabwe economically in response to ZANU PF's policy of land reform.\n\nBoth ZANU PF and the MDC appear to be in a state of denial about the true condition of Zimbabwe at 30, and this cannot be the best way for the country to start its fourth decade as a nation.\n\nAs flv at: &lt;a href=&quot;\nhttp://english.aljazeera.net/programmes/ragehomaarreport/2010/04/2010412122425857194.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://english.aljazeera.net/programmes/ragehomaarreport/2010/04/2010412122425857194.html&lt;/a&gt;\n\n\nOther shunster posts","torrent":{"xt":"urn:btih:3449fce3fa980aee67510a4dc3330d61aff10a39","amp;dn":"Zimbabwe+-+State+of+Denial++2011+01+20++Aljazeera+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3449fce3fa980aee67510a4dc3330d61aff10a39","infoHashBuffer":{"type":"Buffer","data":[52,73,252,227,250,152,10,238,103,81,10,77,195,51,13,97,175,241,10,57]},"announce":[],"urlList":[]}}