{"title":"The Sound of Music (3.7GB HD) English-German moviesbyrizzo","uid":5985125,"size":3988304872,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:35001491d5da4e318686031e884571fe3769cf14&amp;dn=The+Sound+of+Music+%283.7GB+HD%29+English-German+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1290712845,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0059742/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0059742/&lt;/a&gt; \nSelect between Dual English - German audio tracks 256k and 224k respectively\n\nThe Sound of Music is the greatest movie ever produced.\nSince its first release in 1965, it has supposedly since raked in a billion,\nconsidered in current dollar values (adjusted for inflation).\n\nThere is a great opportunity for learning and for joy in hearing the songs\nsung in German, as this movie is first and foremost a celebration of the \nGermanic spirit of competence, civility and passion for life correctly lived. \nIt is a preaching of a more kindly Christianly spirit that is espoused by Ms.\nJulie Andrews, a German woman, of the righteducation equally.\n\nWhat there is of brilliance and supremacy in what ismust rightly\nbe seen to be the Germanic element of quality - and this I say in all \nearnestness not just in respect of protecting this spirit that keeps me sane\nto do (as I can live with nothing else than the greatest spirited Ms. Julie\nAndrews in all my dealings in life)but in simply being a good Christian\nthat seeks fairness on matters of true merit.  \n\n\nThis is better than buying a standard DVD we think, we it offers outstanding\npixel and bitrate specifications by comparison. It comes in at 1280X 584 with\na video bitrate at this pixel setting (as indicated) of 2622k - How's that for\nan achievement!\n\nSome who offer DVD5 movie files on the net tend to make an error in \nthinking a standard DVD has 4.7GB available on it for recording on.\nFact is the actual space available for some reason is closer to\n4.3GB instead. So care must be taken when creating folders intended\nto fit on a single layer disc with ease. Blank larger Dual layer discs and\nthose that store even larger files from bluray conversions, are expensive to\nbuy and to burn. We think most would think twice before deciding they need\nthat much more in movie file size than the sort of specs I indicate above.\nbut then today, some can own a huge theatre with screens that can fill an \nentire wall in a room perhaps!\n\nWe also have subtitles for those that want to learn German using this movie\nfile and it took little space to make it possible to do so. We also have some\ntreats including some newer karaoke song offerings for those that want to \nrightly celebrate this movie with their families and friends, at home and\nschool and at karaoke clubs too - why not!\n\nThe Sound of Music teaches us that we must be disciplined, as a great\npeoples, certainly! But we must also even importantly be sensible in this\nso as to preserve the good spirit. we must celebrate and have joy as reasons\nfor living. we must bestow it on those that need it - or we have no sense in\nwhat purpose it is we might live for instead.\n\nThis was the most formative movie experience in my own growing up, I saw\nthis movie at aboarding school run by a great man from Australia\nDr. David Nettlebeck, our Headmaster. It changed my life and can do so\nfor all children that are drawn to these teachings on merit.\n\nIf you are viewing on you computer, the DivX plus player shows off best \nwhat is the picture quality, however its too bulky a player to use most\nof the time (despite its great dual monitor support - to show on your hooked\nup TV and computer simultaneously), and its ability to provide chapter \ncontrol capability on a movie file such as this which has embedded chapter\npoint placed by the DivX Converter Plus program capabilities. It can\ntherefore act as a DVD using a compatible such DivX player on your PC.\n\nAt this point, however, We  suggest a lightweight player such as VLC instead.\nIts free as well. We do not find lately that downloaded movies appear intended\nto be played on a computer as they aren't converted as regular DivX/DivX HD \navi files but to some other format that causes extreme sluggishness when\nattempted to be used with the same player and equipment, as we found \nin any event.\n\nIt plays beauifully and instantly on our DivX HD (plus bluray) disc\nplayer from Sony as Im afraid to admit that no European models were \non the shelf at the downtown stores in Toronto when we made the purchase.\nVery very unfortunate indeed!\n\nSo I hope you will consider that the German endowment of Intelligence and \ngeneoristy of spirit with competence is within the reach and grasp\nof your children equally - if you could only getthem to see this movie\noften enough with the right teachers around! what else could possibly' be\nneeded, i say!\n\n\nMichael Rizzo Chessman\n\n\n\n\n \n","torrent":{"xt":"urn:btih:35001491d5da4e318686031e884571fe3769cf14","amp;dn":"The+Sound+of+Music+%283.7GB+HD%29+English-German+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35001491d5da4e318686031e884571fe3769cf14","infoHashBuffer":{"type":"Buffer","data":[53,0,20,145,213,218,78,49,134,134,3,30,136,69,113,254,55,105,207,20]},"announce":[],"urlList":[]}}