{"title":"Coast to Coast AM - 10 - 31 - 10 - Ghost to Ghost 2010","uid":5963479,"size":56630879,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3564018ca017dd00626df5faa0799353ccae5262&amp;dn=Coast+to+Coast+AM+-+10+-+31+-+10+-+Ghost+to+Ghost+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":4,"time":1290029550,"description":"Ghost to Ghost 2010\n\nDate: 10-31-10\nHost: Art Bell\nGuests: Open Lines\n\nArt Bell hosted Ghost to Ghost AM in which he opened the lines to listeners to share their tales of ghostly encounters. A number of callers reported interactions with strange entities -- Brian of California saw a being that grew in size, and had a face like a Punch doll, while a caller to the Wild Card line said he witnessed the ghost of a rain-coated girl, who was later seen moving in slow motion. Another listener described a childhood memory of seeing a man in a Santa suit fall down a well in Vallejo, CA. Later he saw a vision of the man floating over his bed telling him to go downstairs to get his Christmas presents. According to the caller's father, it was unknown where several gifts came from, including an old wooden handmade train.\n\nGreg from Chicago talked about his recent project of photographing the locations where people were murdered, and said at one of the spots &quot;a really weird ghostly...image stain&quot; appeared on his film. Maggie from Arkansas shared an intriguing account of how her deceased best friend made warnings from beyond the grave about her new boyfriend-- she literally heard him making remarks about him in her ear. Subsequently, she found out his warnings were true, and dropped the boyfriend.\n\nDelbert, a trucker driving through Amarillo, told of how his wife's sister died in a car accident. Later, he and his wife were taking care of the sister's three year-old son at their home in Nebraska, when the door of the room suddenly closed and the temperature &quot;dropped so cold you could see your breath.&quot; The boy said 'Hi Mommy,' and seemed to be listening to her. He then said 'OK Mommy,' and then 'Bye Mommy.' After that, the door swung back open, and the room warmed up &quot;like nothing ever happened.&quot;","torrent":{"xt":"urn:btih:3564018ca017dd00626df5faa0799353ccae5262","amp;dn":"Coast+to+Coast+AM+-+10+-+31+-+10+-+Ghost+to+Ghost+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3564018ca017dd00626df5faa0799353ccae5262","infoHashBuffer":{"type":"Buffer","data":[53,100,1,140,160,23,221,0,98,109,245,250,160,121,147,83,204,174,82,98]},"announce":[],"urlList":[]}}