{"title":"The Monarch of the Glen - Compton Mackenzie  (Unabridged)","uid":6029205,"size":147997550,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:35f09220b807a5d9a6594df0792794469bcfb8c2&amp;dn=The+Monarch+of+the+Glen+-+Compton+Mackenzie++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lucy1948","files":10,"time":1292014574,"description":"Unabridged and read by David Rintoul. 10 hours 16 mins duration. 8 CD's. (Fraunhofer CBR 32 kbit/s 22050 Hz Mono).\n\n\nThe trials and tribulations of one Donald MacDonald of Ben Nevis, the 23rd clan chieftain of Glenbogle Castle, as he tries to unsuccessfully adjust to life in the 20th Century and the constraints this imposes upon him. This means for instance, that unlike his predecessors, he cannot burn his opponents in church to the piped strains of 'Mac 'ic Eachiann's Return to Glenbogle'. Central to the plot is Donald's (or 'Ben Nevis' as he is also known) plot to try and ensnare the sister of a wealthy American financier into marrying one of his sons. Add to this the fact that the lady in question, Myrtle Royde, actually fancies a trespassing Scottish Nationalist poet called Alan Macmillan, and also that at this time, Donald is effectively in a state of war against the National Union of Hikers under the formidable leadership of Percy Buckham (the 'Little Songster' portable wireless manufacturer) and you have a recipe for hilarity.\nA delightful, gentle comedy, from the master of the Scottish farce. This book was the inspiration for the BBC series of the same name starring Richard Briers. Best read with a glass of whisky in hand and some Scottish bagpipe music playing quietly in the background!. (aaamack)","torrent":{"xt":"urn:btih:35f09220b807a5d9a6594df0792794469bcfb8c2","amp;dn":"The+Monarch+of+the+Glen+-+Compton+Mackenzie++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35f09220b807a5d9a6594df0792794469bcfb8c2","infoHashBuffer":{"type":"Buffer","data":[53,240,146,32,184,7,165,217,166,89,77,240,121,39,148,70,155,207,184,194]},"announce":[],"urlList":[]}}