{"title":"Patent Pending - She's A Ho Ho Ho Merry Christmas (2nafish)","uid":6032982,"size":156145668,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:37a55f32777135f61dd3aaaea268a8b188e12a6a&amp;dn=Patent+Pending+-+She%5C%27s+A+Ho+Ho+Ho+Merry+Christmas+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292144241,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nPatent Pending is a ska punk band from Mt. Sinai, New York. The band has been together since 2001 and has played hundreds of shows all across the United States. They have played with many bands, including Taking Back Sunday, Motion City Soundtrack, Catch 22, MC Lars, Cobra Starship, Suburban Legends and Gym Class Heroes.\n\nPatent Pending started out as a Ska Punk band in 2000 with Joe Ragosta, Steve Chirichella, and Josh Bolt. With the departure of Steve and Josh in 2001 Michael Ragosta, Anthony Mingoia, and Drew Buffardi were added Mt. Sinai, New York. The band started out playing in people's backyards, church basements, and any place that people would let them play. The band added sax player, Pat Cauchi, in 2002. Many fans say they have never been the same since Steve Chirichella went away to college and became a professional Deep Sea Fisherman, where he is known as Steve 'The Marlin Master' Chirichella. Before being signed, the band shifted their focus to pop punk when Pat Cauchi quit the band in order to pursue his studies.\n\nPatent Pending started to gain a local following, known as the P-UNIT (a play on G-Unit, devised by former saxophone player Pat Cauchi). After attracting local attention, the band played hundreds of shows across the country, sold thousands of CDs &amp; DVDs, and gained a large following on MySpace.\n\nIn 2005, We Put Out Records, signed Patent Pending. Later in the year, the band headed over to Big Blue Meanie Studios (Taking Back Sunday, Mighty Mighty Bosstones, Stretch Arm Strong) in Hoboken, New Jersey to record their We Put Out Records debut, Save Each Other, the Whales Are Doing Fine. The band chose producer Joseph A. Pedulla (Thursday, We.re All Broken) to guide them throughout the studio. The CD was released on June 6, 2006.\n\nOn April 16, 2007, Marc Kantor (Rhythm guitar) began riding his bicycle from Levittown, New York to San Diego, California. His mission was to help raise money and awareness for The American Heart Association. A portion of the proceeds were also donated to the Rhiannon Chloe Foundation, a foundation started to help children in need with leukemia. He successfully completed this on June 7, 2007.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:37a55f32777135f61dd3aaaea268a8b188e12a6a","amp;dn":"Patent+Pending+-+She%5C%27s+A+Ho+Ho+Ho+Merry+Christmas+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37a55f32777135f61dd3aaaea268a8b188e12a6a","infoHashBuffer":{"type":"Buffer","data":[55,165,95,50,119,113,53,246,29,211,170,174,162,104,168,177,136,225,42,106]},"announce":[],"urlList":[]}}