{"title":"Alex Jones interviews Jeffrey M. Smith about GMO","uid":5945151,"size":215074548,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3826c56b356868fdcc425d357539fdcb18d86ba9&amp;dn=Alex+Jones+interviews+Jeffrey+M.+Smith+about+GMO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"metamyst","files":1,"time":1289335332,"description":"Jeffrey M. Smith, author of the #1 GMO bestseller Seeds of Deception, talks about his campaign to force mass rejection of genetically modified foods in order to expunge them form the market entirely. Smith explains how the FDA allowed GMO foods to enter the market with no safety testing whatsoever, and that the man primarily responsible for this is now food safety czar in the Obama administration.\n\nSmith notes how Obama has broken his pre-election promise that every GMO food should be properly labeled, and also installed pro-GMO executives in the USDA and FDA who have close ties to Monsanto and the biotechnology industry.\n\nSmith documents how consumption of genetically modified foods has been directly linked with reproductive problems, immune system deficiencies, accelerated ageing, organ damage and gastrointestinal problems. The immune system problem has been seen consistently in mice and rats who are fed GMO food, explains Smith, and now since humans have started consuming genetically modified foods, auto-immune diseases and allergies have increased.\n\nSmith explains how research exposing the dangers of genetically modified food has been censored and shut down by the establishment, with scientists involved in such studies finding themselves blacklisted and shunned by their peers before being fired from their jobs in many cases as big agriculture throws its weight around.\n\nSmith covers a plethora of vital issues in this one hour interview, and offers workable solutions to phase GMO out of the market, by pushing for proper labeling standards and an intensive education outreach that will help people realize how big a threat genetically modified food poses to their health.","torrent":{"xt":"urn:btih:3826c56b356868fdcc425d357539fdcb18d86ba9","amp;dn":"Alex+Jones+interviews+Jeffrey+M.+Smith+about+GMO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3826c56b356868fdcc425d357539fdcb18d86ba9","infoHashBuffer":{"type":"Buffer","data":[56,38,197,107,53,104,104,253,204,66,93,53,117,57,253,203,24,216,107,169]},"announce":[],"urlList":[]}}