{"title":"Democracy Now - 26 jan 2011","uid":6129133,"size":438343379,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:39b1eb276bcb5eb40b97f29bc9cdb01627a1d0c4&amp;dn=Democracy+Now+-+26+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1296059248,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 26, 2011\n\n- Obama Calls for Spending Freeze, Lower Corporate Taxes\n- Republicans, Tea Party Respond to Obama Address\n- Dems, Republicans Sit Together in Bipartisan Gesture\n- Anti-Gov't Protests Sweep Egypt; Public Gatherings Banned\n- Clinton: U.S. Backs Egyptian Gov't\n- Palestine Papers: PA, Israel Discussed Targeting Palestinian Militants\n- British Intelligence Aided Crackdown on Hamas\n- PA Negotiator Claims Palestine Papers Endangering His Life\n- U.N. Coordinator: Palestine Papers Underscore Palestinian Compromise, Israeli Intransigence\n- U.S. Deaths from Roadside Bombings Soar in Afghanistan\n- Suit by Families of Slain Blackwater Contractors Dismissed\n- Ex-Gitmo Prisoner Sentenced to Life Term\n- Indonesian Soldiers in Videotaped Torture Sentenced to Less Than Year\n- Emanuel Wins Appeal, Back in Chicago Mayoral Race\n- Probe: Bush White House Violated Law on Campaigning\n\n\nSpecial reports\n\n- Obama Calls for Spending Freeze Lowering Corporate Taxes in State of the Union\n\nPresident Obama delivered his second State of the Union address last night. Speaking before a newly divided Congress, Obama said the United States was in a 21st century version of the space race and in a global competition to create jobs in science and research. Obama focused much of his speech on the issue of jobs and proposed a number of deficit-cutting measures, including a five-year freeze in spending on some domestic programs.\n\n\n- Consumer Advocate Joan Claybrook and Former Salt Lake City Mayor Rocky Anderson Respond to State of the Union\n\nPresident Obama began his second State of the Union address by paying tribute to Rep. Gabrielle Giffords of Arizona, but did not address the issue of gun control. He spoke about the need for clean energy, but did not mention the word &quot;climate&quot; once in his address. He talked about the economy, but never mentioned foreclosures. We get response on Obama's the State of the Union speech with longtime consumer advocate, Joan Claybrook and the former mayor of Salt Lake City, Rocky Anderson, who is now director of High Road for Human Rights.\n\n\n- Dr. Atul Gawande Compares Obama's 'Frustrating' Record on Healthcare Reform and LBJ's Leadership in Passing Medicare\n\nIn his State of the Union address, President Obama defended his healthcare overhaul and invited Republicans to help him move forward with essential fixes to the law. We hear from Dr. Atul Gawande, a surgeon at Brigham and Woman's Hospital in Boston, staff writer at The New Yorker magazine and an associate professor at Harvard Medical School. &quot;There's leadership needed to give meaning to the policies for the public and to explain what the value is,&quot; Gawande says. &quot;Obama] allowed the opponents to brand every one of those policies as failures, even though they passed.&quot;\n\n\n- Harry Belafonte on Obama: 'He Plays the Game That He Plays Because He Sees No Threat From Evidencing Concerns for the Poor'\n\nWe speak with legendary singer, actor, humanitarian and activist, Harry Belafonte. &quot;I think [Obama] plays the game that he plays because he sees no threat from evidencing concerns for the poor,&quot; Belafonte says. &quot;He sees no threat from evidencing a deeper concern of the needs of black people, as such. He feels no great threat from evidence of greater policy toward the international community for expressing thoughts that criticize the American position on things and turns that around. Until we do that, I think we will be forever disappointed in what that administration will deliver.&quot;\n\n\n- Thousands Protest in Egypt in Largest Popular Challenge to Mubarak in 30 Years\n\nTens of thousands of people have taken to the streets across Egypt in the largest popular challenge to longtime President Hosni Mubarak since he came into office 30 years ago. Drawing inspiration from the recent uprising in Tunisia, an estimated crowd of 15,000 packed Cairo's Tahrir Square. We go to Cairo to speak with independent journalist and blogger, Hossam Hamalawy.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:39b1eb276bcb5eb40b97f29bc9cdb01627a1d0c4","amp;dn":"Democracy+Now+-+26+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39b1eb276bcb5eb40b97f29bc9cdb01627a1d0c4","infoHashBuffer":{"type":"Buffer","data":[57,177,235,39,107,203,94,180,11,151,242,155,201,205,176,22,39,161,208,196]},"announce":[],"urlList":[]}}