{"title":"Nihilum Vs Illidan World First","uid":6090560,"size":728179200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3af60f73c07972654d9aa3117a08abb232ddc255&amp;dn=Nihilum+Vs+Illidan+World+First&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kitee","files":1,"time":1294535837,"description":"Illidan Stormrage was the self-proclaimed Lord of Outland, ruling from the Black Temple. He was born a night elf, and, as stated by Maiev Shadowsong, became \\&quot;neither demon nor night elf, but something more\\&quot;. He was the twin brother of Malfurion Stormrage and was in love with Tyrande Whisperwind. Once an unusually gifted sorcerer, the extent of his powers became difficult to classify due to his powers increasing in large bursts as a demon hunter and having absorbed the powers of the Skull of Gul\\'dan.\n\n\n\nHis pursuit of power and arcane mastery led him to commit a number of horrific acts against his own people and the races of Azeroth, including defecting to Sargeras during the War of the Ancients and creating the second Well of Eternity. For his actions, he was imprisoned for ten thousand years, until his release during the Third War. He came to be called the Betrayer for his acts against the night elf people and carried the title of Lord of Outland. Seeking to bring down her erstwhile prisoner, Maiev allied with Akama to invade the Black Temple, where she cornered Illidan in his inner sanctum and struck him down, bringing an end to one of the most tragic stories in Azeroth\\'s history.\t\t","torrent":{"xt":"urn:btih:3af60f73c07972654d9aa3117a08abb232ddc255","amp;dn":"Nihilum+Vs+Illidan+World+First","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3af60f73c07972654d9aa3117a08abb232ddc255","infoHashBuffer":{"type":"Buffer","data":[58,246,15,115,192,121,114,101,77,154,163,17,122,8,171,178,50,221,194,85]},"announce":[],"urlList":[]}}