{"title":"Dont talk about the weather (Poison in the sky), Tools for the R","uid":6112581,"size":4443451392,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3b3b23925bb38734a0dbc8fb5f6a9a46d6b10dc9&amp;dn=Dont+talk+about+the+weather+%28Poison+in+the+sky%29%2C+Tools+for+the+R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thezoo_","files":1,"time":1295417973,"description":"Dont talk about the weather (Poison in the sky), Tools for the Revolution, Victory over the New World Order. Produced by the Sacred Earth Society\n\nHave you ever wondered about those condensation trails from airplanes that dont seem to disappear? Well those are not condensation trails and theyve only been seen since 1995, and yes there has been a public outcry of concern but no US government agency (or UK agency) has seemed to care too much. Physical samples of debris found after heavy incidents of these persistent white trails have been collected from surfaces and the ground and presented to agencies like the EPA (environmental protection agency) and the CDC (center for disease control) but they have refused to identify the substance and the substance has been unidentifiable by all private researchers as well. If you pay attention to the sky you might notice airplanes streaming these (persistent contrails) across the sky in criss-cross formations, in parallel lines, or in big As. Dont take it from me, look at the sky. very strange. This documentary provides a huge amount of information collected over a large time span and from all over the world. It is a great source for anyone curious, I would urge anyone looking this over to please check it out. I am somewhat limited in my abilities to seed for long periods of time, but I will seed all day every day when possible, but not (approximately) between the hours of 9-10pm and 6am (Pacific time). So if you see no seeders right now go ahead and download the .torrent file and I will be shortly along to seed. Thank you so much for having the courage to know the truth. Good luck and trust yourself. I will reply to comments, I dont care who you are; lets have a conversation.","torrent":{"xt":"urn:btih:3b3b23925bb38734a0dbc8fb5f6a9a46d6b10dc9","amp;dn":"Dont+talk+about+the+weather+%28Poison+in+the+sky%29%2C+Tools+for+the+R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b3b23925bb38734a0dbc8fb5f6a9a46d6b10dc9","infoHashBuffer":{"type":"Buffer","data":[59,59,35,146,91,179,135,52,160,219,200,251,95,106,154,70,214,177,13,201]},"announce":[],"urlList":[]}}