{"title":"P!nk - Fuckin' Perfect  (mp4-2nafish)","uid":6117195,"size":79901379,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3bbab5c1b464903d29e7e8af99fefb042ba98582&amp;dn=P%21nk+-+Fuckin%5C%27+Perfect++%28mp4-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1295604640,"description":"File Info:\n\nFormat            : MPEG-4\nLength            : 76 MiB\n\nVideo #0          : AVC at 2 449 Kbps\nAspect            : 1920 x 1080 (1.778) at 23.977 fps\n\nAudio #0          : AAC at 128 Kbps\nInfos             : 2 channels, 44.1 KHz\n\n\nThis video has no logos or titles.\n\n\n&quot;Fuckin' Perfect&quot; (clean version is called &quot;Perfect&quot;) is a song by American singer-songwriter Pink. The song was written by Pink, Max Martin, and Shellback, and produced by the latter two for Pink's first compilation album, Greatest Hits... So Far!!!. The song debuted at #10 on the Australian ARIA Singles Chart, as well as peaking at #71 on the UK Singles Chart. The single was released in the US on December 14, 2010, with a UK release expected on February 21, 2011.\n\nThe video begins with a man and a woman having sex on a bed. The woman looks unhappy and depressed. When they are done, each takes a side of the bed and the woman stares at a teddybear on the chair near the bed, that's when the song starts and the woman remembers how when she was a little girl, a boy stole that teddybear and threw it on the floor. The little girl is shown beating the boy up in the school playground while the teacher yells at her. P!nk is then shown singing and other stages of the girl's life are shown: As an almost 10 year old, the girl is in a painting room, with paint all over her face, as a teenager, she is being locked in her room by her mother as they fight and at school, she is given a test sheet with an F grade, which she turns into a funny face using her pen. P!nk sings the chorus and the background shows different scenes of the girl's life. The latter is shown doing drugs in a bathroom and starring at her other mates, who she calls on the bathroom wall &quot;skinny bitches.&quot; The girl then decides to steal a dress. She ultimately gets caught and the other girls take pictures of her as she gets arrested. The scene switches to a bathroom where this girl stands on a balance as an anorexic patient. As the bridge begins, she lays in the bathroom tub, grabs a blade and cuts herself and then gets up and cuts her hair.\n\nNear the end of the video, she is shown painting, with a smile on her face. She ultimately becomes a successful artist, and her painting is hung on a wall in an exhibit. P!nk is shown raising her glass for her, the girl smiles and raises her glass back. In the end, she meets a man, the same man that was making love to her in the beginning of the video. The video switches back to its very first scene, where the guy puts his arm around the girl in the bed. She gets up from the bed, now a grown woman, grabs her old teddybear and enters her daughter's room. The last scene shows the woman saying the words, &quot;You are perfect to me,&quot; as P!nk sings them.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:3bbab5c1b464903d29e7e8af99fefb042ba98582","amp;dn":"P%21nk+-+Fuckin%5C%27+Perfect++%28mp4-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bbab5c1b464903d29e7e8af99fefb042ba98582","infoHashBuffer":{"type":"Buffer","data":[59,186,181,193,180,100,144,61,41,231,232,175,153,254,251,4,43,169,133,130]},"announce":[],"urlList":[]}}