{"title":"Grandprix4 2010 (ultimate torrent)","uid":6066505,"size":3635057197,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3be698aaf1f930c018e036eef243a1b4a2d72d2e&amp;dn=Grandprix4+2010+%28ultimate+torrent%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mikey75","files":101,"time":1293387041,"description":"Hello.\n\nFirst of all. This torrent is for high-end machines and I mean it. Well, you can play it with low-end computer, but I don`t suggest to do so. I also want to thank people, who had made suht a great mods, utilies to this game and keeping this great game alive. I don`t take any credits by myself. The only thing I do is that I put few things together. Hope you enjoy the game.\n\nHow to install:\n   -unrar grandprix4.rar and play the game\n\nor(better choice)\n\nInstall grandprix4(full)\n   -When you install the game first, you can use all kind of tweakers and utilities.\n   -Original GP4 is in the grandprix4(original) folder.\n\nInstall 9.6 patch\n\nCopy decrypted gp4.exe to the install folder\n\nRun game once, calibrate settings if you want to. Then exit game(You have to be administration user and run it xp servicepack3 mode)\n\nInstall gpxpatch(You have to start the game allways by useing gpxpatch.exe)\n\nAfter that, unrar grandprix4.rar to game folder and overwrite everything\n\nThere are many utilities in the game folder and I suggest that you use then.You have to reinstall some of them.\n\nIf you use the grandprix.rar version of the game. It is already tweaked to season 2010, so just unrar and play. if you want to chance graphics setting, you have to do it by using f1graphics.cfg. Remember that the game is set to 1920*1080 resolution, so if you have lower resolution monitor the car cockpit view looks strange and you may ever harm your system. So be careful, if your monitor can`t do 1920*1080 resolution. I hope you enjoy the game. Dont`t get frustrated. You have to be ace to win the races.\n\nP.S. I haven`t tweak all the circuit .dat files, so you have to do it yourself. Use magicdata utility to do so. Track 1-6 are tweaked. Also, if you play championship season mode, you must, after finish track eight(Montreal), copy the contest of the singapore track folder to game folder(montreal2001.wad and dat with bumps folder to circuit folder). ","torrent":{"xt":"urn:btih:3be698aaf1f930c018e036eef243a1b4a2d72d2e","amp;dn":"Grandprix4+2010+%28ultimate+torrent%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3be698aaf1f930c018e036eef243a1b4a2d72d2e","infoHashBuffer":{"type":"Buffer","data":[59,230,152,170,241,249,48,192,24,224,54,238,242,67,161,180,162,215,45,46]},"announce":[],"urlList":[]}}