{"title":"Anthony B - Mr. Heartless (2nafish)","uid":6077799,"size":152039428,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3c6d73f3149c2461b69092cde1d02dfb70c4e8c7&amp;dn=Anthony+B+-+Mr.+Heartless+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1293966135,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nAnthony B is the stage name of Keith Blair (born March 31, 1976, Clark's Town, Trelawny, Jamaica), a Jamaican musician and member of the Rastafari movement.\n\nWhile attending high school, Anthony B debuted as a deejay for the local sound system, Shaggy Hi-Power. In 1988, he befriended reggae artists such as Determine, Mega Banton, Ricky General and Terror Fabulous.\n\nAt this point in the reggae industry, singing &quot;slack&quot; songs about women was the popular thing to do. Anthony B did not believe in degrading women and chose to pen politically-slanted songs instead. He hooked up with Little Devon the Half Pint sound-a-like singer and made his debut single &quot;The Living is Hard&quot; on the Wizard label in 1993. Anthony B tried many different producers but found that their production values didn't give him the sound that he wished for. Finally, Anthony B teamed up with Richard &quot;Bello&quot; Bell, creating hits such as &quot;Fire Pon Rome&quot;, &quot;Raid Di Barn&quot;, &quot;Rumour&quot;, and &quot;Repentance Time&quot;. Anthony B's 1996 debut album entitled Real Revolutionary in the U.K. and So Many Things in the U.S. was highly acclaimed in the reggae community. In late 1997, Anthony B released Universal Struggle which showed that Anthony B had a consistent, high-caliber talent. Anthony B has released a large number of albums since including 1999's Seven Seals, 2003's Street Knowledge, 2004's Untouchable which featured collaborations with artists including Wyclef Jean, Snoop Dogg &amp; Bone Crusher, 2005's Black Star &amp; My Hope, and most recently, Life Over Death in 2008.\n\nAnthony B tours extensively in Europe and North America and is known for his fiery, high-energy performances.\n\nBlair grew up in rural Clark's Town in the northwestern parish of Trelawny in Jamaica. His deeply religious family life (his mother was a Seventh-day Adventist and his grandmother a Revivalist) imbued him with a profound spirituality. During his youth, his favorite singers were reggae legends Bob Marley and Peter Tosh, musicians who strongly influenced his own style. Peter Tosh's influence can definitely be heard in Anthony B's vocal delivery and revolutionary stance.\n\nAnthony B adopted Rastafari movement beliefs as a teenager, a decision which was not well-received by his family. The stubborn and determined Anthony B refused to give up his new religion and his dreadlocks and moved to the home of his aunt and uncle in the Kingston suburb, Portmore. He is a member of the Bobo Ashanti branch of the movement. &quot;Bobo Dreads&quot;, as they are known, are recognizable by their long robes and turbans. The strong Afrocentric pride and the other Rastafarian beliefs (or &quot;overstandings&quot; as Rastafarians prefer to call them) which are reflected in his songs.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:3c6d73f3149c2461b69092cde1d02dfb70c4e8c7","amp;dn":"Anthony+B+-+Mr.+Heartless+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c6d73f3149c2461b69092cde1d02dfb70c4e8c7","infoHashBuffer":{"type":"Buffer","data":[60,109,115,243,20,156,36,97,182,144,146,205,225,208,45,251,112,196,232,199]},"announce":[],"urlList":[]}}