{"title":"Teens On Cock XXX DVDRiP XviD (Split Scenes) - [ErG]","uid":5967231,"size":1469609266,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3cc5ef32fbe5e4e9878754b045d33e0762272288&amp;dn=Teens+On+Cock+XXX+DVDRiP+XviD+%28Split+Scenes%29+-+%5BErG%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fun2shh","files":-1,"time":1290153730,"description":"Info:\n\nCast:\nMelanie Rios, Ally Kay, Jessie Andrews, Gigi Rivera, Tristyn Kennedy\n\n\nDescription:\n\nMelanie Rios enjoys her after school time bouncing around town on her POGO Stick until she has a pogo stick breakdown. Lucky for her Erik Everhard has\na pogo stick repair kit! After luring Melanie back to his house for some needed repairs Melanie decides to bounce her 19 year old pure Colombian pussy on Erik's stick!\n\nBig Booty Blonde Ally Kay has a breakdown of her own, not to worry! Bruce Venture is on the case. After some small talk and some big cock, Ally shows\nher appreciation by polishing Bruce's knob and burying his man hood in her Teen Hood.\n\nNot All Blondes are Dumb! And then there is Jessie Andrews, after trying to put air in her tire with the water hose she notices Chris Strokes and asks for help... The horny teen pours it on Chris and before ya know it he' s balls deep between her pussy cheeks.\n\nThe ever so promiscuous Gracie Glam explains to the closet installer just how long her mom would like the shelves to be. After a bit more measuring Bruce Venture shows Gracie exactly what 10&quot; looks like up close...\n\nIt seems Tristyn Kennedy is having trouble counting past the # 9. Mr. Hand pulls out the flash cards and before ya know it Tristyn is riding Mr.Hand's big stick.\n\n\n\nWhatever you grab, remember to seed back, ok? \n\ntq =)\n\nEnjoy !!!","torrent":{"xt":"urn:btih:3cc5ef32fbe5e4e9878754b045d33e0762272288","amp;dn":"Teens+On+Cock+XXX+DVDRiP+XviD+%28Split+Scenes%29+-+%5BErG%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cc5ef32fbe5e4e9878754b045d33e0762272288","infoHashBuffer":{"type":"Buffer","data":[60,197,239,50,251,229,228,233,135,135,84,176,69,211,62,7,98,39,34,136]},"announce":[],"urlList":[]}}