{"title":"Birth Control - Live [German LP (1st pressing)]-aksman  ","uid":5963410,"size":1404778246,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d55da458b015461df123f9c5d0133252f7dfdb1&amp;dn=Birth+Control+-+Live+%5BGerman+LP+%281st+pressing%29%5D-aksman++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"insinuendo","files":18,"time":1290026727,"description":"Birth Control - Live [German LP (1st pressing)] 24-bit/96kHz \nPosted By : aksman | Date : 15 Nov 2010 23:31:52 |\n\n\nBirth Control - Live\nGerman LP (1st pressing) / CBS 88088\nVinyl rip in 24-bit/192 kHz (converted to 24/96) | FLAC | m3u, cue &amp; Tech Log\nDR Analysis | Artwork | 1.5 gb |&amp; Filefactory | Krautrock | 1974\n\nAllmusic.com rating: 3 / 5\n\nBirth Control Live wraps up as a pleasurable excerpt of the band in a live atmosphere, and a tad stronger than Live '79 since it was recorded during Birth Controls heyday.\n- Mike DeGagne/AMG\n\t\n\nMy personal favorite from Birth Control. Great version of Gamma Ray...\n\n\n\n\nBirth Controls straightforward progressive rock sound is perfectly demonstrated on Birth Control Live, recorded in June 1974. With Zeuss B. Helds organ and Wurlitzer contributing to their simplistic keyboard and vocal arrangements, the album takes favorites like The Work Is Done and Shes Got Nothing on You and dresses them up a bit, proving that the band can be just as exciting in concert as on their studio albums. Much like Amon Duul II or even Atomic Rooster to a certain extent, Birth Control puts great emphasis on their keyboards, with lead vocalist Peter Foller adding some humorous support from time to time. The best example of their early-70s sound can be found on the 15 minutes of Back from Hell and on the even longer Gamma Ray, combining an entertaining mix of improvised guitar and keyboard interplay that wonderfully stretches itself out. Ending with the frolicsome Long Tall Sally with Zeuss playing some rather spirited harmonica segments, Birth Control Live wraps up as a pleasurable excerpt of the band in a live atmosphere, and a tad stronger than Live 79 since it was recorded during Birth Controls heyday.\n- Mike DeGagne/AMG\n\n\nTrack listing\n\n      1. The Work Is Done (Frenzel) 17:01\n      2. Back from Hell (Frenzel, Steffens) 15:43\n      3. Gamma Ray (Frenze)l 20:54\n      4. Shes Got Nothing on You (Frenzel) 5:41\n      5. Long Tall Sally (Johnson) 11:07\n\n\n\nPersonnel\n\n      Bruno Frenzel - Guitar; Vocals\n      Bernd &quot;Nossi&quot; Nosske - Drums; Vocals\n      Zeus B. Held - keyboards, reed\n      Peter Fuller - Bass, Vocals\n\n\nTechnical Log\n\nRCM Hannl limited with Circulating Brush\nMusic Hall MMF 9.1 Turntable\nTonearm: Pro-Ject 9cc evo with Pure Silver Wires\nCartridge: Nagaoka MP-500\nBrocksieper Phonomax (Tube Phono PreAmp) (temporarily replaced by &quot;ProJect Tube-Box 2 SE)\nE-MU 0404 external USB 2.0 Audiointerface\nInterconnections : Silent Wire NF5\nWaveLab 6 recording software\niZotope RX Advanced 1.21 for resampling and dithering\n\nVacuum cleaning - TT - Brocksieper Phonomax - E-MU 0404 - WaveLab 6 (24/192) - manual click removal - analyze (no clipping, no DC Bias offset) - converted to 24/96 with iZotope RX Advanced 1.21 - split into individual Tracks - FLAC encoded (Vers. 1.21)\n\nNo silence been removed, please burn gapless to match original tracklayout.\n\n\nPersonal Note\n\nWith my vinyl transfers, I try to catch the whole beauty of vinyl records; therefore I don't use any post-processing or any sound improvement. What you get is a clear and flat transfer. For getting a clear sound, I'll do an extended washing of each record with my RCM, which can take up to 30 minutes brushing on each side. Resistant ticks and clicks I try to remove as good as possible, but the priority is not to lose any musical information in the process. Surface noises, as long they are not too high, are left in place. Only on bad pressings or on records recorded at extremely low levels do I use a fade in-/-out. As John Peel said, &quot;Life is full of surface noises.&quot; In some cases this means that I have to make a compromise.... The result has to pass my personal quality criteria, which is IMO quite high.","torrent":{"xt":"urn:btih:3d55da458b015461df123f9c5d0133252f7dfdb1","amp;dn":"Birth+Control+-+Live+%5BGerman+LP+%281st+pressing%29%5D-aksman++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d55da458b015461df123f9c5d0133252f7dfdb1","infoHashBuffer":{"type":"Buffer","data":[61,85,218,69,139,1,84,97,223,18,63,156,93,1,51,37,47,125,253,177]},"announce":[],"urlList":[]}}