{"title":"Caught in the Light - Robert Goddard  (Unabridged)","uid":6052848,"size":299696490,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3d6362664fab3f2ff0c3720e5b79743560236253&amp;dn=Caught+in+the+Light+-+Robert+Goddard++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lucy1948","files":226,"time":1292797883,"description":"Unabridged, read by Michael Kitchen\n\nOn assignment photographing wintry Vienna, Ian Jarrett meets and falls in love with a Marian Esguard. In between horizontal engagements, the couple agree to start divorce proceedings against their spouses and meet in a few days at Lacock Abbey, the site of one of pioneer British photographer William Fox Talbot's best-known pictures. But although Ian tells his wife Faith and his teenaged daughter Amy about the new woman in his life, unburdening himself with a directness that bums his bridges, he waits in vain at Lacock. It's all been a mistake, Marian tells him in a tantalizing phone call; he'll never see her again, and mustn't look for her. Naturally, Ian immediately does exactly that, unearthing Daphne Sanger, a therapist who treated Marian for what amounts to delusions of possession. Eris Moberly, the woman Ian knew as Marian Esguard, has become convinced that she's the reincarnation of Marian Esguard (1787-1847), who may have invented photography 20 years ahead of Fox Talbot. As Ian peers deeper into Eris's unsettling echoes of Marian's life - complete with tyrannical husband, unhelpful relatives, importunate lover, and romantic intrigue of her own - he's drawn into a present-day mystery just as baffling. What became of the historic photographs of Marian's that Eris claimed to have gotten from old Milo Esguard? Why is Bath bookseller Montagu Quisdan-Neve so interested in the photographs? What does Eris have to fear from Milo's nephew Niall? It's all a setup, of course, as everyone but Ian and the most credulous readers will long since have realized. But precious few will figure out who's behind the intricate plot, which plays to the most exquisitely paranoid fantasies.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3d6362664fab3f2ff0c3720e5b79743560236253","amp;dn":"Caught+in+the+Light+-+Robert+Goddard++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d6362664fab3f2ff0c3720e5b79743560236253","infoHashBuffer":{"type":"Buffer","data":[61,99,98,102,79,171,63,47,240,195,114,14,91,121,116,53,96,35,98,83]},"announce":[],"urlList":[]}}