{"title":"Radio Orbit - radiOrbit - Mike Hagan - 2008","uid":6098047,"size":491214294,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3f153b81e75f9eff0ef08c521333d3dc33eaa7c7&amp;dn=Radio+Orbit+-+radiOrbit+-+Mike+Hagan+-+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bart_L","files":1,"time":1294854662,"description":"Year 2008 archive of radiOrbit with Mike Hagan\n\nAired weekly from July 2004 till June 2008\n\nwww.mikehagan.com\n\nGuests:\nPaco Ahlgren, Sterling Allan, Rush Allen, JosÃƒÂ© ArgÃƒÂ¼elles, Dr. Martin W. Ball, Kent Daniel Bentkowski, Vincent Bridges, Brooke Medicine Eagle, Judith Anne Brown, Stephen Buhner, Dr. Carl Calleman, Dr. Carlos Castro, Joseph Chilton Pearce, Sheryl Clapton, Jack Cole, Jerry Collett, Nick Cook, Neal Adams, John Crainshaw, Walter Cruttenden, Gary David, John DeCamp, Jon DePew, Yeshe Dorje, Father Thomas Doyle, Christopher Dunn, Riane Eisler, George Erikson, Larry Evans, Phyllis Galde, Dr. William Gaspar, Mary J. Getten, Dr. Neal Goldsmith, Alan Goldstein, Boyd Graves, Lewis M. Greenberg, Alex Grey, G. Edward Griffin, Dr. Terry Grossman, Neil Hague, Graham Hancock, Nassim Haramein, Joanna Harcourt-Smith, John Jay Harper, Michael Horn, Dr. Leonard G. Horowitz, Dr. Michael Hyson, Jan Irvin, James Kent, Alistair Kinnear, Paul Laffoley, John Lash, Dr. Paul A. LaViolette, Rick Levine, Peter Light, Dr. Bruce Lipton, William R. Lyne, John Major Jenkins, Elaine Matthews, Dr. Dennis McKenna, Doro Meincke, Dr. Ralph Metzner, Richard Alan Miller, Jonathon Miller-Weisberger, Shawn Montgomery, Richard K. Moore, Bill Murphy, Jeremy Narby, Paradise/Star Newland, David John Oates, Dr. Semir Osmanagic, Dr. Gordon Pedersen, Eric Jon Phelps, Lucy Pringle, Bruce Raphael, Dr. Elizabeth Rauscher, Susan Joy Rennison, Marko Rodin, Dr. Colin A. Ross, Dr. Rustum Roy, Andrew Rutajit, Dr. Richard Sauder, Nicki Scully, David Sereda, Dr. John Sheliak, Shoo, Sir Charles Shults III, Rick Simpson, Mary Sparrowdancer, Kent Steadman, Scott Stevens, Dr. Rick Strassman, Geoff Stray, Kevin Taylor, Matthew Taylor, Dr. Patti Taylor, Dr. Barbara Tedlock, Dr. Dennis Tedlock, Elena Tonetti-Vladimirova, Brian Trent, Michael Tsarion, Elizabeth Upton, Susun Weed, Jay Weidner, James Michael Wilkie, Jonathan Zap\n\nPlus: many recordings of the late Terence McKenna\n","torrent":{"xt":"urn:btih:3f153b81e75f9eff0ef08c521333d3dc33eaa7c7","amp;dn":"Radio+Orbit+-+radiOrbit+-+Mike+Hagan+-+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f153b81e75f9eff0ef08c521333d3dc33eaa7c7","infoHashBuffer":{"type":"Buffer","data":[63,21,59,129,231,95,158,255,14,240,140,82,19,51,211,220,51,234,167,199]},"announce":[],"urlList":[]}}