{"title":"Big Picture: The Communist Terror: Unconventional Warfare","uid":5950855,"size":1406859591,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f7bfb50b8717c02097383468e1fce60eccc8768&amp;dn=Big+Picture%3A+The+Communist+Terror%3A+Unconventional+Warfare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1289521783,"description":"1970s US Anti-Communist Propaganda Documentary, may be interesting for peaople interested in history.\n\nDepartment of Defense. Department of the Army. Office of the Deputy Chief of Staff for Operations. U.S. Army Audiovisual Center. (ca. 1974 - 05/15/1984). The world has long been familiar with two military challenges posed by the forces of world communism - the challenge of nuclear war and the challenge of large-scale conventional war. The United States and the free world meet these challenges by maintaining the ability to fight both kinds of war-an ability so powerful it has deterred Communists from starting either kind. Today, we are seeing with increasing frequency evidence of another technique the Communists use whenever they consider the occasion appropriate...the technique of unconventional warfare -\\&quot;The Third Challenge.\\&quot; This challenge involves conspiracy, underground organization and terror. It encourages guerrilla warfare and avoids open conflict and risks by the oblique method of conquering other countries from within. This week\\'s THE BIG PICTURE, narrated by Alexander Scourby, deals with that third challenge and depicts the United States capability to fight this type of war in the far flung reaches of the globe.\n\nPlease Help Seeding.","torrent":{"xt":"urn:btih:3f7bfb50b8717c02097383468e1fce60eccc8768","amp;dn":"Big+Picture%3A+The+Communist+Terror%3A+Unconventional+Warfare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f7bfb50b8717c02097383468e1fce60eccc8768","infoHashBuffer":{"type":"Buffer","data":[63,123,251,80,184,113,124,2,9,115,131,70,142,31,206,96,236,204,135,104]},"announce":[],"urlList":[]}}