{"title":"The Electric Light Orchestra - Calling America (Xvid-2nafish)","uid":6048661,"size":79892902,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:407584126376f6a31bf3cbdd0b37e8bbab76eb4d&amp;dn=The+Electric+Light+Orchestra+-+Calling+America+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292649482,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:28\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2937 Kbps\nQuality Factor : 0.58 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Calling America&quot; is a song by the rock music group Electric Light Orchestra released as a single from their 1986 album Balance of Power. It became the band's first hit in three years. The song is, like most of the songs on Balance of Power, musically upbeat and bright but lyrically darker, concerning a dishonest lover. Released as a single in 1986, the song peaked at number eighteen on the Billboard singles chart, making it their final hit single in the US.\n\nThere was also a UK 12 inch EPIC 3 Track version with the &quot;Destination Unknown&quot; on the B-Side.\n\nBalance of Power is an album by the Electric Light Orchestra (ELO) released in 1986.\n\nBalance of Power was the last studio album by the Electric Light Orchestra for a period of over 15 years (until Zoom was released in 2001). By this time Kelly Groucutt had departed and the group was pared down to a trio, with Jeff Lynne handling bass (in addition to his usual guitar work) and more dabbling with electronic percussion and synthesisers. ELO played some live concerts in the UK and Europe (their last for fifteen years), and in one UK show George Harrison performed as guest guitarist.\n\nThe video for the single &quot;Calling America&quot; was shot in Paris, and contains shots of the band playing in front of Centre Georges Pompidou. A video was also made for the single &quot;So Serious.&quot; The track &quot;Endless Lies&quot; was intended as an homage to Roy Orbison, and was originally recorded for the pared-down double LP Secret Messages; it reappeared on this album in a slightly reworked and more compact form. A number of &quot;ELO firsts&quot; can be attributed to this album: it was the first ELO album not to feature any strings whatsoever; the first to feature a saxophone solo; and the band's first compact disc issued. The album, in its original form has also the shortest running time in the ELO catalogue.\n\nThe singles' B-sides &quot;Caught in a Trap&quot;, &quot;A Matter Of Fact&quot; (alternative lyrics), and &quot;ELO Megamix&quot; are among the band's more collectible single tracks; &quot;Destination Unknown&quot; and the standard version of &quot;A Matter Of Fact&quot; were released on the 1990 compilation Afterglow. The remastered version of the album was released on 26 February (UK) and 20 March (US), 2007 as part of the Sony/BMG Music Epic/Legacy series. It includes an extra 21 minutes of music, considerably lengthening what had been the shortest ELO album.\n\nVery first vinyl pressings and tape recordings were labeled with the familiar JET Records label in Europe, some CBS advertisements announced even the CD release on the JET Records label, but until today there is no original CD item known to be existing with the JET Records label. Europe's CD releases were on CDEPC26467 (Epic) in March 1986. The US and Japan releases were on CBS Associated.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:407584126376f6a31bf3cbdd0b37e8bbab76eb4d","amp;dn":"The+Electric+Light+Orchestra+-+Calling+America+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"407584126376f6a31bf3cbdd0b37e8bbab76eb4d","infoHashBuffer":{"type":"Buffer","data":[64,117,132,18,99,118,246,163,27,243,203,221,11,55,232,187,171,118,235,77]},"announce":[],"urlList":[]}}