{"title":"Rahsaan Roland Kirk Introducing Rahsaan Roland Kirk(jazz)(flac)[","uid":5973038,"size":358866443,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:40e2b73d1283d67221b843caa13d1c1fec805288&amp;dn=Rahsaan+Roland+Kirk+Introducing+Rahsaan+Roland+Kirk%28jazz%29%28flac%29%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rogercc1","files":15,"time":1290360541,"description":"RAHSAAN ROLAND KIRK  INTRODUCING ROLAND KIRK\nLabel: Warner Jazz\nReleased: 2006\nFormat:Flac\n\n\nKirk was born Ronald Theodore Kirk in Columbus, Ohio, but felt compelled by a dream to transpose two letters in his first name to make Roland. He became blind at an early age as a result of poor medical treatment. In 1970, Kirk added \\&quot;Rahsaan\\&quot; to his name after hearing it in a dream.\nPreferring to lead his own bands, Kirk rarely performed as a sideman, although he did record with arranger Quincy Jones and drummer Roy Haynes and had notable stints with bassist Charles Mingus. One of his best-known recorded performances is the lead flute and solo on Jones\\' \\&quot;Soul Bossa Nova\\&quot;, a 1964 hit song repopularized in the Austin Powers films (Jones 1964; McLeod et al. 1997).\nHis playing was generally rooted in soul jazz or hard bop, but Kirk\\'s knowledge of jazz history allowed him to draw on many elements of the music\\'s past, from ragtime to swing and free jazz. Kirk also absorbed classical influences, and his artistry reflected elements of pop music by composers such as Smokey Robinson and Burt Bacharach, as well as Duke Ellington, John Coltrane and other jazz musicians. The live album Bright Moments (1973) is an example of one of his shows. His main instrument was the tenor saxophone, supplemented by other saxes, and contrasted with the lighter sound of the flute. At times he would play a number of these horns at once, harmonising with himself, or sustain a note for lengthy durations by using circular breathing, or play the flute through his nose. A number of his instruments were exotic or homemade, but even while playing two or three saxophones at once, the music was intricate, powerful jazz with a strong feel for the blues.\nKirk was politically outspoken. During his concerts, between songs he often talked about topical issues, including black history and the civil rights movement. His monologues were often laced with satire and absurdist humor.\nIn 1975, Kirk suffered a major stroke which led to partial paralysis of one side of his body. However, he continued to perform and record, modifying his instruments to enable him to play with one arm. At a live performance at Ronnie Scott\\'s club in London he even managed to play two instruments, and carried on to tour internationally and even appear on television.\nHe died from a second stroke in 1977\n\nTracklist\n01 - The Inflated Tear 04:56\n02 - A Laugh for Rory 02:52\n03 - Making Love After Hours 04:32\n04 - Volunteered Slavery 05:43\n05 - Carney and Bigard Place 05:32\n06 - Do Nothin\\' Till You Hear from Me (Duke Ellington] 04:38\n07 - Bye Bye Blackbird (Ray Henderson, Mort Dixon) 02:38\n08 - Ain\\'t No Sunshine (Bill Withers) 02:26\n09 - The Black and Crazy Blues 06:04\n10 - Old Rugged Cross (Traditional) 07:15\n11 - Blacknuss 05:11\n12 - Freaks for the Festival 03:58\n13 - Conversation 00:57\n\nRecording information: New York, NY (1967).\n\n\n\nPersonel inc:\nRahsaan Roland Kirk (vocals, whistling, flute, piccolo, harmonica, clarinet, English horn, stritch, manzello, tenor saxophone, baritone saxophone, bass saxophone, trumpet, harmonium, bass drum, cymbals, timpani, bells, gong, sound effects, flexatone, music box);\n Cissy Houston, Al Hibbler (vocals);\n Cornell Dupree, Keith Loving, Hugh McCracken (guitar);\n Pat Patrick (baritone saxophone);\n Charles McGhee (trumpet);\n Dick Griffin (trombone);\n Richard Tee (piano, keyboards);\n Hank Jones , Lonnie Liston Smith, Ron Burton, Sonelius Smith (piano);\n Mickey Tucker (organ);\n Arthur Jenkins, Jr. (keyboards, congas);\n Hilton Ruiz (keyboards);\n John Goldsmith, Khalil Mhrdi, Oliver Jackson, Sonny Brown, Steve Gadd , Bernard \\&quot;Pretty\\&quot; Purdie, Charles Crosby, Jimmy Hopps (drums);\n Ralph MacDonald (congas, percussion);\n Richard Landrum, Lawrence Killian (congas);\n Joe Habad Texidor (tambourine, percussion);\n Milt Grayson (computer).\n","torrent":{"xt":"urn:btih:40e2b73d1283d67221b843caa13d1c1fec805288","amp;dn":"Rahsaan+Roland+Kirk+Introducing+Rahsaan+Roland+Kirk%28jazz%29%28flac%29%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40e2b73d1283d67221b843caa13d1c1fec805288","infoHashBuffer":{"type":"Buffer","data":[64,226,183,61,18,131,214,114,33,184,67,202,161,61,28,31,236,128,82,136]},"announce":[],"urlList":[]}}