{"title":"Motorhead - Iron Fist (Live-Germany) (2nafish)","uid":6032809,"size":131588100,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:41dfd824cf7d17fc97973267706abb708b4de53a&amp;dn=Motorhead+-+Iron+Fist+%28Live-Germany%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1292135784,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Iron Fist&quot; is a song by the heavy metal band MotÃƒÂ¶rhead. It was released as a single in 1982, in 7&quot; pressings in blue, black and translucent red vinyl.\n\nThe title track on the single is covered with (B-side's) &quot;Remember Me, I'm Gone&quot;, which appears on CD re-issues of the Iron Fist album. In Spain, the title track was put on the B-side of &quot;Go to Hell&quot; and was issued with a picture sleeve of the band dressed as warriors in skull masks.\n\nThis is the last single featuring the classic MotÃƒÂ¶rhead line-up of Lemmy, &quot;Fast&quot; Eddie Clarke and &quot;Philthy Animal&quot; Taylor, as Clarke left following the recording of the Stand By Your Man EP.\n\nOn March 27, 1982, Lemmy, Clarke and Taylor were interviewed by Tommy Vance on BBC Radio 1's 'Rock On Saturday' show, &quot;Iron Fist&quot;, &quot;Loser&quot;, and &quot;Speed Freak&quot; were played.\n\nIron Fist is the fifth album by the British band MotÃƒÂ¶rhead. Released on 17 April 1982, it peaked at #6 on the UK album charts. It was preceded by the release of the title track &quot;Iron Fist&quot; as a single on 3 April, which peaked in the UK singles chart at #29. It was the final album to be recorded by the Lemmy, Eddie Clarke and Phil Taylor line-up.\n\nAs with previous albums, recording commenced with producer Vic Maile at his Jackson's Studio in Rickmansworth in 1981. A break in recording for the band to play some November and December dates with Tank was followed by Clarke producing Tank's debut album with help from Will Reid Dick. Clarke was unhappy with the Maile produced sessions and decided that the album should be recorded themselves, although Lemmy lamented at the time that &quot;it's a shame to have lost Vic in a way because I thought it was successful&quot;.\n\nThe album was recorded during the best part of late January and February 1982 at Morgan Studios and Ramport Studios in London, with Clarke producing and Dick engineering. The band retrospectively acknowledge that this was a bad move, with Lemmy claiming in 2000 that the album was &quot;bad, inferior to anything else we've ever done. Having Eddie produce it was a mistake that even he would now probably admit to&quot;.\n\nThe writing of lyrics and recording of vocals are tasks that Lemmy performs once the recording of the music has been completed. Struggling to think of a name for the title track for the album, he remembered the time the band had performed live under the name Iron Fist and the Hordes from Hell for contractual reasons (a subsequent album What's Wordsworth? was released of that event), and decided this was an apt name for this project. The name was eventually shortened to simply Iron Fist.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:41dfd824cf7d17fc97973267706abb708b4de53a","amp;dn":"Motorhead+-+Iron+Fist+%28Live-Germany%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41dfd824cf7d17fc97973267706abb708b4de53a","infoHashBuffer":{"type":"Buffer","data":[65,223,216,36,207,125,23,252,151,151,50,103,112,106,187,112,139,77,229,58]},"announce":[],"urlList":[]}}