{"title":"Nbox Media Player Firmware Update","uid":6075508,"size":2983441,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:4218dd2581f3c9b3fd1f269038892cbf6a268d23&amp;dn=Nbox+Media+Player+Firmware+Update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dw57481","files":1,"time":1293813668,"description":"IMPORTANT!!!  This update is for the NBox Media Player, and has othing to do with the NBox that hooks up to phones!  They are two completely seperate products that simply share the name!\n\nThis update:\n\n---Changes file organization to be by NAME, not by last date updated\n---Makes the file name smaller and easier to read\n---Increases the formats and resolutions your device will read **(see below)\n---Gives you a nifty, darker background in the file screen\n\nWhich means that you can actually watch TV shows IN ORDER on continuous play, and you're far less likely to have to wait for the title to scroll to know exactly what file you are looking at!\n\nThis is the latest firmware update I could find for the NBox Media Player.  I looked for weeks to find this online - seems the company may have gone out of business, and VERY NEARLY made a functional download section to their site first, but...you know...didn't.\n\nI searched piratebay, knowing that if anyone had it, they would! And I was wrong. So once I found it, I decided to remedy that situation!\n\nI have tested this file on my OWN Nbox, and it is fully functional!\n\nIMPORTANT: YOUR PLAYER WILL RESET TO DEFAULT SETTINGS AT THE MOMENT THIS UPDATE IS COMPLETED!!!  This means that if you had to adjust the settings on it to get it to display on your TV when you first set it up, you will have to again.  Make sure to familiarize yourself with the menu on yor device BEFORE doing this, to the point that you can do it flying blind - you may very well end up doing so.  I did't know that when I installed it, so it took me another ten minutes of blindly fiddling with buttons to get it to display properly.\n\nSimply place it on a flashdrive (or portable harddrive, or whatever you typically place your files on to be read by the player), choose &quot;Files,&quot; scroll to it, and run it.  You will get a progress readout, and at 100% the file will be installed.  Then adjust the settings on your device to make it display properly on your TV.  Voila!  You can now set it to continuous play, and it will play files in the proper (alphanumeric by name) order!\n\n**Not sure what all file formats and resolutions this new update will expand your device to accept - since I had to download it as soon as I found it, and since that site had zero information about it except &quot;Nbox Firmware Update,&quot; I'll have to acid-test it to find out.  I will update this section as soon as I have any decent info!","torrent":{"xt":"urn:btih:4218dd2581f3c9b3fd1f269038892cbf6a268d23","amp;dn":"Nbox+Media+Player+Firmware+Update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4218dd2581f3c9b3fd1f269038892cbf6a268d23","infoHashBuffer":{"type":"Buffer","data":[66,24,221,37,129,243,201,179,253,31,38,144,56,137,44,191,106,38,141,35]},"announce":[],"urlList":[]}}