{"title":"The Walking Dead S01E06 XviDTV SAFCuk009","uid":6015611,"size":307142281,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4290f1f71f19768221af007801306a99fa325147&amp;dn=The+Walking+Dead+S01E06+XviDTV+SAFCuk009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SAFCukO09","files":2,"time":1291628309,"description":"===== File Info =====\nFileSize : 292M\nPlayTime : 00:45:19.344\nVideoCount : 1\nAudioCount : 1\n===== Video Info =====\nVideo 0# Stream\nVideoCodec : XVID\nVideoWidth : 624 pixels\nVideoHeight : 352 pixels\nVideoFrameRate : 23.976fps\nVideoFrameCount : 65199\nVideoBitRate : 0\n===== Audio Info =====\nAudio 0# Stream\nAudioCodec : MP3\nAudioBitRate : 129872\nAudioChannels : 2\nAudioSampleRate : 48000\n\n\n\nn a flashback to the initial zombie outbreak, Shane attempts to evacuate Rick, but is unable to due to soldiers executing the hospital staff and zombies breaking into the building. Thinking Rick is dead, all Shane can do is barricade Rick's door and flee the hospital. In the present, Dr. Jenner explains to them the process in the brain that takes place when a person is bitten, and they enjoy they comforts of electricity and safety. However, Shane attempts to seduce Lori, attempting to rekindle their short relationship Lori attempts to get away and is almost raped by Shane when she manages to push him away, he then leaves in anger. The next morning the group discovers a timer in the lab and ask Dr. Jenner what it is for. He tells them it is the countdown for the power supply to the building, and when it hits zero the building will self destruct. The group panicking, looks for a way to keep the electricity when Dr. Jenner locks them in, telling them it is humane and that their deaths will be swift and painless, the group, however, believes they can survive, and attempt to break out. Rick convinces Jenner to let them out, but not without whispering something into Rick's ear, this message inaudible to the viewer, but the look on Rick's face indicates that it is grim. One of the members, Jacqui, tells them she will stay no matter what and die with Jenner, Andrea chooses the same fate, but is convinced by Dale to leave with them. They narrowly escape the building with the use of a Grenade Rick discovered in Atlanta. The building explodes and the group leaves safely. This marks the end of season one.\n\n\n\n\n\n\nDecided to do my own version of this just to see if its worth doing this for certain TV episodes..If anyone has any requests for smaller files on tv episodes let me know","torrent":{"xt":"urn:btih:4290f1f71f19768221af007801306a99fa325147","amp;dn":"The+Walking+Dead+S01E06+XviDTV+SAFCuk009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4290f1f71f19768221af007801306a99fa325147","infoHashBuffer":{"type":"Buffer","data":[66,144,241,247,31,25,118,130,33,175,0,120,1,48,106,153,250,50,81,71]},"announce":[],"urlList":[]}}