{"title":"Dime Que Me Quieres 1x01 Al 1x03 DVD DVB Spanish","uid":5999239,"size":1125672960,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:433ee0120d623fd12e2b2f16aaf503c196f85526&amp;dn=Dime+Que+Me+Quieres+1x01+Al+1x03+DVD+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"acer2010","files":3,"time":1291131227,"description":"El argumento se centra en tres parejas que se enfrentan a diferentes problemas en sus relaciones, lo que lleva a todas ellas a pasar por la consulta del mismo terapeuta. De ese modo se profundiza en la conexiÃƒÂ³n entre los miembros de cada pareja y en la fina lÃƒÂ­nea que separa la sexualidad de la intimidad, todo ello teniendo como testigo a la doctora May Foster, a cuya consulta acuden los seis protagonistas.\n\nLas tres parejas, de distintas edades y situaciones, son las siguientes: por un lado estÃƒÂ¡n Dave y Katie, cuarentones y muy felices con su vida matrimonial excepto en todo lo relacionado con el sexo. Carolyn y Palek, en cambio, viven inmersos en la treintena, y desean fervientemente tener un hijo, aunque la presiÃƒÂ³n por conseguirlo les estÃƒÂ¡ pasando factura en su convivencia diaria. La tercera pareja estÃƒÂ¡ formada por Jamie y Hugo, dos veinteaÃƒÂ±eros que salen juntos y estÃƒÂ¡n comprometidos, aunque tienen problemas a la hora de mantener la fidelidad que ambos se han prometido.\n\n'Dime que me quieres' ofrece una visiÃƒÂ³n directa y a veces cruda de la realidad diaria que afecta a millones de parejas en todo el mundo. Para gran parte de la crÃƒÂ­tica norteamericana, la gran cualidad de la serie es la capacidad que ofrece para que los espectadores se identifiquen con los protagonistas y sus problemas diarios, sea cual sea su edad o nivel socio-cultural. Para otros, el guiÃƒÂ±o que ofrece esta producciÃƒÂ³n de HBO es permitir al espectador convertirse en una especie de voyeur que sigue de cerca a los protagonistas no sÃƒÂ³lo en su terapia, sino tambiÃƒÂ©n en la intimidad de su dormitorio.","torrent":{"xt":"urn:btih:433ee0120d623fd12e2b2f16aaf503c196f85526","amp;dn":"Dime+Que+Me+Quieres+1x01+Al+1x03+DVD+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"433ee0120d623fd12e2b2f16aaf503c196f85526","infoHashBuffer":{"type":"Buffer","data":[67,62,224,18,13,98,63,209,46,43,47,22,170,245,3,193,150,248,85,38]},"announce":[],"urlList":[]}}