{"title":"Autosport Magazine UK 18/11/2010","uid":5974228,"size":89595421,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43e3d0e23beadcb3e16c1c84f71f8173c5a2969d&amp;dn=Autosport+Magazine+UK+18%2F11%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thorhammer2000","files":-1,"time":1290395388,"description":"CONTENTS\n10 How Alonso lost the title. Ferrari's panic over Red Bull spoils Spaniard's title bid\n12 Champion Vettel hailed. Ex-Senna engineer Giorgio Ascanelli's high praise\n15 Petrov set for Renault. Russian may keep his drive\n17 F1 rookie test round-up. All the news from Abu Dhabi\n20 Chevy back to IndyCar. GM powerhouse re-commits to US single-seaters for 2012\n22 WTCC decided in court. BMW exclusion hands Chevy's Yvan Muller his second title\n25 ART eyes sportscar move. Top single-seater outfit linked to endurance series attack\n27 Old hands in new GP2 car. Teams call on series veterans to unlock new-car potential\n29 Citroen wants top names. Citroen boss targets Solberg and Raikkonen for DS3 WRC\n\nREPORTS\n32 Abu Dhabi Grand Prix. Comeback king Vettel blitzes final GP to become youngest F1 world champion\n52 GP2 Abu Dhabi. Perez and Valsecchi take season-finale victories\n54 World of Sport. NASCAR; V8 Supercars; Japanese GT; Formula Nippon\n60 WRC GreatLoeb's third win in Wales is Citroen C4's final hurrah\n\nFEATURES\n44 Vettel: world champ! Sebastian Vettel looks back on the key moments of his title-winning season for Red Bull Racing\n68 Macau GP preview. Edoardo Mortara bids to become first two-time winner of the blue-riband F3 event as we try his Signature-run Dallara-Volkswagen racer\n\nSPORTS EXTRA\n89 FPalmer Audi axed. Single-seater series put out to pasture after 13 seasons\n90 RSF boost to Young Guns. Racing Steps Foundation throws weight behind scheme\n97 Reports. Pembrey BARC; Brands Hatch MSVR; Donington Park 750MC\n100 Formula Ford review. How Aussie youngster Scott Pye kept up Jamun Racing's FFord dominance\n103 Racer's diary. AUTOSPORT'S Ben Anderson on his latest on-track exploits\n\nREGULARS\n109 Photo finish. Erik Carlsson wins first forest-stage RAC Rally, 1960\n110 Rally of my life. Bernd Schneider, Mercedes, Sachsenring DTM '01","torrent":{"xt":"urn:btih:43e3d0e23beadcb3e16c1c84f71f8173c5a2969d","amp;dn":"Autosport+Magazine+UK+18%2F11%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43e3d0e23beadcb3e16c1c84f71f8173c5a2969d","infoHashBuffer":{"type":"Buffer","data":[67,227,208,226,59,234,220,179,225,108,28,132,247,31,129,115,197,162,150,157]},"announce":[],"urlList":[]}}