{"title":"Vampire Diaries (2011) S02E9-E11 DVD TV Rip (NL Subs) NLT Releas","uid":6125303,"size":4474393426,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:43f34bca8e5541617f52850e0dc2c4f0647ab24b&amp;dn=Vampire+Diaries+%282011%29+S02E9-E11+DVD+TV+Rip+%28NL+Subs%29+NLT+Releas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hoihiep","files":-1,"time":1295916169,"description":"Vampire Diaries Seizoen 2: Aflevering 9 tm 11 (2011)\n\nDVD 3\n\nNa de dood van hun ouders proberen Elena en Jeremy hun leven weer op te pakken. \nWanneer het nieuwe schooljaar weer van start gaat, wordt het leven van Elena \nvolledig onderste boven gedraait door een knappe en misterieuze nieuwe student \nStefan Salvatore. Wat zij niet weet, is dat Stefan een eeuwenoude vampier is welke \neen rustig en vredig leventje probeert te leiden. Stefan's broer Damon, welke ook \neen vampier is, is volledig het tegenovergestelde van hem en leeft erg geweldadig. \nHet enige wat de twee broers delen is hun liefde voor Elena.\n\nSeason 2, Episode 9: Katerina\nElena puts herself in a dangerous position as she searches for the truth about Katherine's past and \nwhat her own future may hold. Knowing that Stefan would never agree to her plan, \nElena swears Caroline to secrecy. Damon uses a new-found confidant to help him try \nto discover the real purpose and power of the moonstone. Jeremy and Bonnie meet \nLuka, a new student with a surprising family history. \n\n\n--------------------------------------------------------------------------------\n Season 2, Episode 10: The Sacrifice\nElena decides to take matters into her own hands and offers a tempting incentive to \nRose for her help. When things take an unexpected turn, however, Rose calls on \nDamon to deal with the plan Elena has set in motion. Jeremy's reckless attempt to \nhelp Bonnie retrieve the moonstone lands him in a life-threatening position and \nforces Stefan to put himself in danger. Bonnie and Luka form a closer connection. \nTyler shows Caroline the Lockwood cellar, where she makes a discovery that leaves \nthem both terrified. \n\n\n--------------------------------------------------------------------------------\n Season 2, Episode 11: By the Light of the Moon\nAs the full moon approaches, Caroline helps Tyler prepare for the transformation \nhe is powerless to stop. While Stefan and Katherine play mind games on one another, \nDamon and Alaric are suspicious when a stranger named Jules shows up in Mystic \nFalls, searching for her missing friend, Mason. Elena is frustrated at the lengths \nJeremy and her friends have gone to in order to keep her safe. Bonnie and Luca work \ntogether on a spell, while still keeping secrets from one another. Finally, Elijah \nmakes an unexpected appearance with an offer that could change everything.\n\n\nSpotinformatie:\nCategorie : Beeld \nFormaat : DVD\nBron : TV\nOndertitels : Nederlands (instelbaar)\nGenre : Romance / Drama / Fantasy / Horror\nYear: 2010\nLanguage: English\n\nWeblink: http://www.imdb.com/title/tt1405406/\n\n\nUnieke Hashcode: 43F34BCA8E5541617F52850E0DC2C4F0647AB24B\n\nThis torrent is brought to you by: NLT Release\nUploader: Hoihiep\n\nAlso visit our forum! www.nlt.ons-forum.nl","torrent":{"xt":"urn:btih:43f34bca8e5541617f52850e0dc2c4f0647ab24b","amp;dn":"Vampire+Diaries+%282011%29+S02E9-E11+DVD+TV+Rip+%28NL+Subs%29+NLT+Releas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43f34bca8e5541617f52850e0dc2c4f0647ab24b","infoHashBuffer":{"type":"Buffer","data":[67,243,75,202,142,85,65,97,127,82,133,14,13,194,196,240,100,122,178,75]},"announce":[],"urlList":[]}}