{"title":"BBC - Planet Earth - DVD 2(NL ENG Audio DTS)(TBS)","uid":5983258,"size":4510239434,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:44567fc9dd99b43e3bf3861cf3f88491685aa83a&amp;dn=BBC+-+Planet+Earth+-+DVD+2%28NL+ENG+Audio+DTS%29%28TBS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Black-Anchor","files":-1,"time":1290646996,"description":"BBC - Planet Earth - DVD 2       \n\nDe bekroonde en baanbrekende natuurserie van de BBC. Planet Earth is het epische, meeslepende verhaal van het leven op aarde. Van de grootste rivieren tot de hoogste bergen, van verborgen ondergrondse grotten tot uitgestrekte woestijnen: \ndeze serie neemt je mee op een onvergetelijke reis langs de meest extreme leefomgevingen van dieren.\n\nMeer dan vijf jaar filmen, op tweehonderd locaties: Planet Earth is niets minder dan het ultieme portret van onze aarde. Een monumentale documentaireserie waarin zeldzame gebeurtenissen, onmogelijke locaties en intieme momenten van dieren zijn vastgelegd.\n\nCaves\nDeze aflevering van Planet Earth gaat ondergronds: in grotten, gangen en holtes van alle groottes en formaten. Licht dringt er nauwelijks door, maar dat wil niet zeggen dat er geen leven mogelijk is.\nDe zogenaamde Zwaluwgrot in Mexico is de diepste verticale grot ter wereld: een gat van 400 meter waar de hele Empire State Building makkelijk in zou passen. De Lechuguilla-grot in New Mexico is 193 kilometer lang en tot 500 meter diep.\nZe bevat hele kamers met adembenemende kristallen, soms tot zes meter lang. In de Hertengrot in Borneo wonen zo?n drie miljoen vleermuizen.\nHun uitwerpselen vormen een meters dikke laag waarop dan weer honderduizenden kakkerlakken en andere ongewerveld dieren leven. Sommige diersoorten of varianten zijn zo specifiek dat ze alleen voorkomen in ÃƒÂ©ÃƒÂ©n of enkele grotten.\n\nDeserts\nBijna een derde van het landoppervlak op aarde bestaat uit woestijnen. Ze zijn goed zichtbaar vanuit de ruimte en van daar lijken ze er misschien wel allemaal hetzelfde uit te zien, maar niets is minder waar.\nDat blijkt in deze vijfde aflevering van Planet Earth. In de Gobi-woestijn in MongoliÃƒÂ« kan het tot 50Ã‚Â° warm worden, maar het kan er ook 40 graden vriezen. De zeldzame Bactrische kamelen (met twee bulten) halen hun vocht vaak uit sneeuw in plaats van uit water.\nDe Sahara is zo groot als de Verenigde Staten. Er komen zandstormen voor die heelmet zand zouden kunnen bedekken. Sommige dieren duiken dan diep in de grond weg, maar dromedarissen (ÃƒÂ©ÃƒÂ©n bult) blijven trots overeind.\nToch kunnen zo?n stormen zelfs steen doen breken: de Egyptische Witte Woestijn met zijn grillige rotsformaties is zo?n door en door geÃƒÂ«rodeerd landschap. De hoogste zandduinen zijn te vinden in de Namib-woestijn. \nSpectaculaire luchtopnames tonen hoe hun 300 meter hoge toppen en kammen voortdurend van vorm veranderen, al blijft hun kern vaak merkwaardig stabiel.\nWe gaan ook naar de Atacama in Chili, de Australische ?outback?, de Sonoran in Arizona en Death Valley in Utah. Daar zien we hoe een kortstondige en zeldzame ?woestijnbloei? een vraatzuchtige kolonne sprinkhanen doet ontstaan van 160 op 65 kilometer. \nAndere dieren die in woestijngebieden leven, zijn hagedissen en woestijnvossen, maar ook antilopen en zelfs leeuwen en olifanten.\n\nIce Worlds\nIn deze aflevering trekken we naar de poolgebieden. Antarctica bevat 90% van het ijs op de wereld. In de winter is het er erg stil, maar vanaf de lente komt er meer beweging.\nStormvogels gaan op zoek naar een partner maar worden belaagd door vraatzuchtige skuameeuwen. Bultrugwalvissen jagen op ingenieuze manier op krill.\nLater op het jaar beginnen de keizerpinguÃƒÂ¯ns aan hun lange tocht naar hun broedplaatsen, ruim 160 kilometer van de kust.\nAan de andere kant van de planeet, in het Noordpool-gebied, jagen wolven op muskusossen. Een ijsbeermoeder gaat samen met haar twee jongen op zoek naar voedsel.\nDoor de opwarming van de aarde wordt dat alsmaar moeilijker: steeds meer ijs smelt weg, zodat de beren vaak grote afstanden moeten zwemmen.\nWe zien een uitgeputte mannelijke ijsbeer die na een lange zwemtocht probeert een walrus te verschalken. Als het hem niet lukt, is hij ten dode opgeschreven. De toekomst ziet er niet rooskleurig uit voor de ijsberen?.\n\n\nSpotinformatie \n\n\nCategorie   : Beeld \nFormaat     : DVD5 \nBron        : Retail\nAudio       : NL DD 5.1 DTS 5.1 Eng DD 5.1\nOndertitels : Nederlands (instelbaar)\nMenu        : Ja\nCover       : Ja\nGenre       : Documentaire\n  &lt;a href=&quot;\nhttp://www.google.nl/search?hl=nl&amp;q=BBC+-+Planet+Earth+-+DVD+2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.nl/search?hl=nl&amp;q=BBC+-+Planet+Earth+-+DVD+2&lt;/a&gt; \n\n\n \n \n \nBrought to you by BlackAnchor TBS","torrent":{"xt":"urn:btih:44567fc9dd99b43e3bf3861cf3f88491685aa83a","amp;dn":"BBC+-+Planet+Earth+-+DVD+2%28NL+ENG+Audio+DTS%29%28TBS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44567fc9dd99b43e3bf3861cf3f88491685aa83a","infoHashBuffer":{"type":"Buffer","data":[68,86,127,201,221,153,180,62,59,243,134,28,243,248,132,145,104,90,168,58]},"announce":[],"urlList":[]}}