{"title":"Democracy Now - 30 nov 2010","uid":5999762,"size":449976810,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:45447c541a1f682c37b6034d9ec9461f8bc0de0f&amp;dn=Democracy+Now+-+30+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1291150421,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 30, 2010\n\n- U.S. Launches Criminal Probe of WikiLeaks\n- Obama Proposes Salary Freeze For 2 Million Federal Workers\n- Millions of Unemployed Workers Set to Lose Jobless Benefits\n- Big Polluters Exempted From Environmental Oversight\n- Oxfam: Climate-Related Disasters Killed 21,000 in 2010\n- Greenpeace Files Lawsuit Over Corporate Spying\n- E.U. Launches Antitrust Probe of Google\n- Election Monitors OK Haiti Election\n- U.S. Rejects Six-Party Talks With North Korea\n- Aid Groups Call for Israel to Lift Blockade of Gaza\n- Pakistani Man Threatens to Sue CIA Over Drone Strikes\n- Somali-Born Man Pleads Not Guilty to Bomb Plot\n- Pentagon Study: Most Soldiers OK With Lifting DADT Ban\n\n\nSpecial reports\n\n- &quot;We Have Not Seen Anything Yet&quot;: Guardian Editor Says Most Startling WikiLeaks Cables Still To Be Released\n\n&quot;In the coming days, we are going to see some quite startling disclosures about Russia, the nature of the Russian state, and about bribery and corruption in other countries, particularly in Central Asia,&quot; says Investigations Executive Editor David Leigh at the Guardian, one of the three newspapers given advanced access to the secret U.S. embassy cables by the whistleblower website, WikiLeaks. &quot;We will see a wrath of disclosures about pretty terrible things going on around the world.&quot; Leigh reviews the major WikiLeaks revelations so far, explains how the 250,000 files were downloaded and given to the newspaper on a thumb drive, and confirms the Guardian gave the files to the New York Times. Additional cables will be disclosed throughout the week.\n\n\n- Noam Chomsky: WikiLeaks Cables Reveal &quot;Profound Hatred for Democracy on the Part of Our Political Leadership&quot;\n\nIn a national broadcast exclusive interview, we speak with world-renowned political dissident and linguist Noam Chomsky about the release of more than 250,000 secret U.S. State Department cables by WikiLeaks. In 1971, Chomsky helped government whistleblower Daniel Ellsberg release the Pentagon Papers, a top-secret internal U.S. account of the Vietnam War. Commenting on the revelations that several Arab leaders are urging the United States to attack Iran, Chomsky says, &quot;latest polls show] Arab opinion holds that the major threat in the region is Israel, that's 80 percent; the second threat is the United States, that's 77 percent. Iran is listed as a threat by 10 percent,&quot; Chomsky says. &quot;This may not be reported in the newspapers, but it's certainly familiar to the Israeli and U.S. governments and the ambassadors. What this reveals is the profound hatred for democracy on the part of our political leadership.&quot;\n\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:45447c541a1f682c37b6034d9ec9461f8bc0de0f","amp;dn":"Democracy+Now+-+30+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45447c541a1f682c37b6034d9ec9461f8bc0de0f","infoHashBuffer":{"type":"Buffer","data":[69,68,124,84,26,31,104,44,55,182,3,77,158,201,70,31,139,192,222,15]},"announce":[],"urlList":[]}}