{"title":"Original Sin - P D James  (Unabridged)","uid":6045632,"size":231411870,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4571cf09e8db743c6785732e55bb5a4f9292337c&amp;dn=Original+Sin+-+P+D+James++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lucy1948","files":16,"time":1292537512,"description":"Unabridged and read by Michael Jayston. 16 hours 4 mins duration. 14 CD's. (Fraunhofer CBR 32 kbit/s 22050 Hz Mono).\n\n\n[ Book 9 ]\n\nA sprawling homage to the Thames River and its London environs, James's 9th mystery novel to feature New Scotland Yard Commander Adam Dalgleish is set in the modern publishing world where traditions may crumble but where such timeless emotions as grief, rage and love prevail. Peverell Press, which occupies the magnificent Innocent House, modeled on the palaces of Venice and built by the firm's founder in 1792, has been plagued by the misdeeds-misplaced manuscripts, lost illustrations-of an unknown &quot;office menace&quot; since the death, nine months earlier, of managing director Henry Peverell. The stakes are upped when a senior editor, recently sacked by the new director Gerard Etienne, kills herself. When Etienne is found dead in the same room, Dalgleish is called in to investigate. He discovers that plenty of people, including the four other partners in the firm and various employees whose jobs are threatened by Etienne's plans to sell Innocent House and modernize the firm, had reason to wish Etienne dead.","torrent":{"xt":"urn:btih:4571cf09e8db743c6785732e55bb5a4f9292337c","amp;dn":"Original+Sin+-+P+D+James++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4571cf09e8db743c6785732e55bb5a4f9292337c","infoHashBuffer":{"type":"Buffer","data":[69,113,207,9,232,219,116,60,103,133,115,46,85,187,90,79,146,146,51,124]},"announce":[],"urlList":[]}}