{"title":"Democracy Now - 12 jan 2011","uid":6098342,"size":452188199,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:459c4f4dc2f0d5b22a73bcbca27858e45dadf78c&amp;dn=Democracy+Now+-+12+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1294864742,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 12, 2011\n\n- Doctors Expect Rep. Giffords to Survive Shooting\n- Loughner Family Releases Statement on Attack\n- Family Friend of Slain Girl Remains Hospitalized\n- Haiti Marks One Year Since Earthquake\n- Spill Commission Calls for Overhaul of Oil, Gas Regulation\n- WikiLeaks to Speed Up Release of U.S. Cables\n- Illinois Set to Abolish Death Penalty\n- Study: U.S.-Led Military Operations Cause $100M in Damages in Afghan Province\n- Secretary Clinton Makes Unannounced Visit to Yemen\n- Anti-Torture Activists Hold Gitmo Protest\n\n\nSpecial reports\n\n- TÃƒÂ¨ TremblÃƒÂ©: Remembering the Earthquake in Haiti\n\nOne year ago today, Haiti was devastated by a massive earthquake. Up to a quarter of a million people were killed and more than 1.5 million were made homeless. It was one of the worst natural disasters in history. We go back to January 12, 2010, and to the aftermath of the earthquake&quot;what Haitians call TÃƒÂ¨ TremblÃƒÂ©, the earth trembles.\n\n- Wesleyan Professor Alex Dupuy: Haiti Transformed into the &quot;Republic of the NGOs&quot;\n\nOne year after the massive 7.0-magnitude earthquake that devastated Haiti, reconstruction efforts have barely begun. We speak with Alex Dupuy, a professor of sociology at Wesleyan University. &quot;There is a dramatic power imbalance between the international community&quot;under U.S. leadership&quot;and Haiti. The former monopolizes economic and political power and calls all the shots,&quot; Dupuy writes. &quot;This unequal relationship is reflected in the Interim Haiti Recovery Commission.&quot; The IHRC is co-chaired by Bill Clinton.\n\n\n- Haitian Activist Patrick Elie: &quot;Haiti is Controlled by Foreign Governments and Foreign Interests&quot;\n\nOn the first anniversary of the earthquake in Haiti, we go to Port-au-Prince to speak with Patrick Elie, a longtime Haitian democracy activist and Haiti's former Secretary of State for Public Security. &quot;I don't think the Haitian people have to be pitied or mourned, they have to get true solidarity to rebuild,&quot; Elie says. &quot;We must resist the impulse to rebuild Port-au-Prince the way it was: a city of exclusion, of hyper-concentration and of shanty towns which contributed very, very much to the high toll that we've paid after the earthquake.&quot;\n\n\n- Haitian Writer Jean Saint-Vil: One Year After Earthquake, Haitian Population Treated as a Threat, Not an Asset\n\nOn the anniversary of the earthquake in Haiti, we speak with Ottawa-based Haitian writer and activist, Jean Saint-Vil. &quot;One year after the earthquake, we are seeing the Haitian population being treated and seen as a threat, rather than as an asset,&quot; Saint-Vil says. &quot;That's the major paradigm shift that must occur if we have to get out of this mess.&quot;\n\n\n- Novelist Edwidge Danticat: &quot;Haitians Are Very Resilient, But It Doesn't Mean They Can Suffer More Than Other People&quot;\n\nOn the anniversary of the earthquake in Haiti, we go to Carrefour to speak with Haitian-American novelist Edwidge Danticat. &quot;Haitians are very resilient, but it doesn't mean they can suffer more than other people,&quot; Danticat says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:459c4f4dc2f0d5b22a73bcbca27858e45dadf78c","amp;dn":"Democracy+Now+-+12+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"459c4f4dc2f0d5b22a73bcbca27858e45dadf78c","infoHashBuffer":{"type":"Buffer","data":[69,156,79,77,194,240,213,178,42,115,188,188,162,120,88,228,93,173,247,140]},"announce":[],"urlList":[]}}