{"title":"Democracy Now - 11 nov 2010","uid":5949929,"size":451241442,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:45de19fa07fb381b38361e3013a022d53067b750&amp;dn=Democracy+Now+-+11+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1289493150,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 11, 2010\n\n- Deficit Panel Backs Raising Retirement Age, Cuts to Social Security, Medicare\n- Axelrod: Admin to Accept Extension of Bush Tax Cut for Wealthy\n- U.S. to Extend Afghan Pullout Deadline to 2014\n- NATO Attack May Have Killed 3 Afghan Civilians\n- Haitian Cholera Outbreak Reaches Earthquake Camp\n- Iraqi Factions Break Political Deadlock\n- Thousands Protest G20 in South Korea\n- Pentagon: Little Impact in Repealing &quot;Don't Ask, Don't Tell&quot;\n- Mail Bomb Was Timed to Explode Over U.S.\n- Study: Anti-Immigrant Law Causes 100,000 Hispanics to Leave Arizona\n- Oakland Elects Nation's First Asian American Woman Mayor\n- Amnesty: Prosecute Bush for Torture\n\n\nSpecial reports\n\n- Obama Deficit Commission Criticized for Proposals to Slash Social Security, Medicare\n\nThe co-chairmen of the bipartisan presidential deficit commission released a list of recommendations Wednesday on ways to reduce the nation's deficit by $4 trillion by 2020. Co-chairmen Erskine Bowles and Alan Simpson have proposed raising the retirement age for Social Security to 69 by the year 2075, decreasing the cost of living benefits for Social Security recipients, imposing new limits on the Medicare health insurance program, and ending several middle-class tax breaks. We speak with economist Robert Kuttner.\n\n\n- Over 50,000 Students Protest in London over Planned Cuts to Education Funding\n\nAn estimated 52,000 students took to the streets of London on Tuesday to protest government plans to increase university tuition fees while cutting higher education funding by 40 percent. The demonstration was one of the biggest student protests in decades and the largest turnout against the British government's austerity measures that were announced last month. We speak with Johann Hari, a columnist for the London Independent.\n\n\n- Bloomberg Taps Wealthy Media Exec to Replace Joel Klein as NYC School Chief\n\nNew York Mayor Michael Bloomberg shocked many in the city by tapping Cathleen Black, a wealthy media executive with no background in eduction, to run the city's school system, the largest in the country. Black will replace Joel Klein, who announced he is resigning to take a job at Rupert Murdoch's News Corp.\n\n\n- Haiti Cholera Outbreak Reaches Port-au-Prince, Congress Continues to Block Release of Aid Funds\n\nIn Haiti, a cholera outbreak has reached the capital Port-au-Prince, where more than a million people are still homeless and living in crowded tent cities following January's deadly earthquake. Meanwhile in Washington, Congress has put up another obstacle to delivering the $1.15 billion in reconstruction money it promised to Haiti back in March. We go to Port-au-Prince to speak with Jonathan Katz, Haiti correspondent for the Associated Press, and we are joined by Haitian American writer Edwidge Danticat.\n\n\n- Haitian American Novelist on &quot;The Immigrant Artist at Work&quot;\n\nHaiti American novelist Edwidge Danticat is the author of several books, including Breath, Eyes, Memory, The Farming of the Bones, Krik? Krak! and Brother, I'm Dying. She joins us in our studio to talk about her latest book, Create Dangerously: The Immigrant Artist at Work.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:45de19fa07fb381b38361e3013a022d53067b750","amp;dn":"Democracy+Now+-+11+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45de19fa07fb381b38361e3013a022d53067b750","infoHashBuffer":{"type":"Buffer","data":[69,222,25,250,7,251,56,27,56,54,30,48,19,160,34,213,48,103,183,80]},"announce":[],"urlList":[]}}