{"title":"Oorlog van de eeuw dvd 9(Dutch)(TinkerBell) TBS","uid":6040193,"size":4683925522,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:45e6959b36c5180ca614840c67406c8b0ad81bb7&amp;dn=Oorlog+van+de+eeuw+dvd+9%28Dutch%29%28TinkerBell%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mad_Parrot","files":51,"time":1292361970,"description":"\n\nDe Oorlog van de Eeuw 9/10       \n  \n \nDe Tweede Wereldoorlog woedde meer dan 60 jaar terug en eiste meer dan 50 miljoen mensenlevens, in veldslagen van NormandiÃƒÂ« tot de Kaukasus, bij de marine en in de luchtgevechten en bombardementen op steden. Dit was een oorlog die duidelijk aantoonde hoe diep de mensheid kan zinken.\nDe machtsstrijd tussen twee totalitaire ideologieÃƒÂ«n, de overwinning van democratie over dictatorschap, de triomf van technologie in oorlogsvoering en het misbruik ervan voor gemechaniseerde slachtpartijen bewees uiteindelijk, in Hiroshima, dat de mensheid nu in staat was om zichzelf uit te roeien... De Oorlog van de Eeuw.\n\n&quot;De Russen komen&quot;\nHoewel de Duitse propaganda nog op alle manieren de heldhaftigheid van de Duitse troepen bejubelde, was de bittere werkelijkheid in januari 1945 totaal anders. Vanuit het oosten werd het Duitse rijk reeds overspoeld door Russische troepen. \nHet Rode Leger had maar ÃƒÂ©n doel: zo snel mogelijk Berlijn veroveren en voor eens en altijd afrekenen met de zo gehate vijand. \nNiets en niemand ontkwam aan de wraak, als antwoord op de beestachtige wijze waarop de Duitsers in Rusland hadden huisgehouden. \nReservisten en Hitlerjugend kregen het bevel om zonder enige hoop weerstand te bieden tegen de niet te stoppen Russische oorlogsmachine terwijl burgers ieder vluchtverbod negeerden en een veilig heenkomen probeerden te vinden. Russische als Duitse betrokkenen vertellen hoe ze de ondergang van het Duizendjarig rijk beleefd hebben.\n\nHitler's laatste leger\nIn tegenstelling tot wat de Nazi-propaganda verkondigde, waren de Russische troepen in april 1945 over de Oder getrokken en maakten ze zich op voor de definitieve aanval op Berlijn. \nOnder leiding van generaal Zhukov maakten 900.000 Russische militairen zich op om Duitsland de doodsteek toe te dienen. \nSlechts 130.000 Duitse soldaten onder generaal Busse hadden de opdracht om dit te voorkomen. \nZij groeven zich in op de Hoogte van Seelow; het laatste obstakel voor de Russen voordat ze Berlijn zelf konden aanvallen. \nDoordat de Russen haast hadden, omdat ze op 1 mei in Berlijn wilden zegevieren en doordat de Duitsers geen enkele genade te verwachten hadden van hun vijand, waren de verliezen bij de slag om de Hoogte van Seelow uitzonderlijk hoog. \nDat de Russen echter wonnen stond bij voorbaat al vast en voor de Duitse overlevenden restte niets anders dan te proberen het vege lijf te redden, door naar het Westen; naar de Amerikanen en Britten te vluchten.\n\n \n \n\n\nNEDERLANDS GESPROKEN\n\nSpotinformatie\n \nCategorie    : Beeld \nFormaat      : DVD5 \nBron         : Retail\nOndertitels  : Nederlands (instelbaar)\nGenre        : Documentaire\n\n\n &lt;a href=&quot;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+9/10&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+9/10&lt;/a&gt; \n\n\n \n \n \n*****************************************\n\nBrought to you by TinkerBell TBS","torrent":{"xt":"urn:btih:45e6959b36c5180ca614840c67406c8b0ad81bb7","amp;dn":"Oorlog+van+de+eeuw+dvd+9%28Dutch%29%28TinkerBell%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45e6959b36c5180ca614840c67406c8b0ad81bb7","infoHashBuffer":{"type":"Buffer","data":[69,230,149,155,54,197,24,12,166,20,132,12,103,64,108,139,10,216,27,183]},"announce":[],"urlList":[]}}