{"title":"Coast to Coast AM - 11 - 22 - 10 - JFK Assassination Special","uid":5984067,"size":55770925,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4610933d65afe576638969ea3ffa89a37b3be2c0&amp;dn=Coast+to+Coast+AM+-+11+-+22+-+10+-+JFK+Assassination+Special&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":6,"time":1290676049,"description":"JFK Assassination Special VIII\n\nDate: 11-22-10\nHost: George Noory\nGuests: Donald A. Adams, Craig Hulet, Tim Miller, G. Paul Chambers\n\n\nFour different guests addressed different aspects of the JFK assassination in individual one-hour segments. Up first, former FBI investigator Don Adams argued the real killer of John F. Kennedy could have been a man named Joseph Milteer, whom he investigated shortly before the assassination in 1963. Milteer was known to be a radical right-winger who hated the Kennedys with a passion. In a conversation the FBI secretly recorded on November 9, 1963, Milteer told his friend &quot;we're going to go ahead and kill the President from an office building with a high-powered rifle...it's already in the works.&quot; Yet when Oswald was named as the shooter, Milteer was removed as a suspect, he noted.\n\nIn hour two, analyst Craig B. Hulet talked about the research of Federal Judge Jim Garrison which pointed toward a conspiracy in the assassination. Hulet befriended Garrison in the late 1980s and discussed his research into the JFK assassination with him at length. Though Garrison complained his research files had mysteriously disappeared, one of the interesting facts he'd uncovered was that Oswald, Sirhan Sirhan, and James Earl Ray all had lived within a block of each other at a housing project in Dallas, and this appeared to be more than just a coincidence. In a decade of assassinations that included John &amp; Robert Kennedy and Martin Luther King, the U.S. underwent a coup d'ÃƒÂ©tat, with a change of leadership and a demoralization of the country that still affects us today, Hulet commented.\n\nIn the third hour, publisher and author Tim Miller shared information that suggests a conspiracy took place &quot;centered around officials of the US government condoning the action taken by the Mafia&quot; in the JFK assassination. &quot;These people didn't think they were killing the President, they thought they were taking out the President who had stolen the presidency,&quot; and so they had legitimized it in their own minds, he explained. Miller also spoke about his work with Gerald Ford who served on the Warren Commission. Miller concluded that the goal of the Warren Commission was to avert war with Russia rather than uncover the truth about the assassination.\n\nLast hour guest research scientist Paul Chambers discussed the science behind the physical evidence associated with the assassination. The evidence demonstrates that the single bullet theory is false--the Zapruder film indicates multiple shots, with at least two gunmen firing, he reported. Gerald Ford admitted the Warren Commission altered medical data &quot;for clarification&quot; and that is why they got the wrong answer, Chambers added.\n\nFor more, read the recap from our 2009 JFK Special.\n\nWebsite(s):\nadamsjfk.com\ncraigbhulet.com\nflatsigned.com","torrent":{"xt":"urn:btih:4610933d65afe576638969ea3ffa89a37b3be2c0","amp;dn":"Coast+to+Coast+AM+-+11+-+22+-+10+-+JFK+Assassination+Special","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4610933d65afe576638969ea3ffa89a37b3be2c0","infoHashBuffer":{"type":"Buffer","data":[70,16,147,61,101,175,229,118,99,137,105,234,63,250,137,163,123,59,226,192]},"announce":[],"urlList":[]}}