{"title":"Democracy Now - 23 nov 2010","uid":5978798,"size":449956148,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:482e934e1983bf072de7f202f7f32c4284dc6387&amp;dn=Democracy+Now+-+23+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1290530253,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 23, 2010\n\n- North and South Korea Engage in Border Artillery Clash\n- Report: Taliban Leader in Secret Talks Was An Impostor\n- IMF Urges Ireland To Cut Jobless Benefits and Minimum Wage\n- FBI Raids Hedge Fund Offices In Insider-Trading Probe\n- Manufacturers of Full Body Scanners Increase Lobbying Effort\n- Energy Dept: Nuclear Weapons Drivers Drank on the Job\n- 2006 GOP Report on Global Warming Was Partly Plagiarized\n- Israeli 'Human Shield' Soldiers Get Suspended Sentence\n- Food Banks Struggle to Feed Growing Number of Hungry American\n- John Yoo Compares Torture to Driving Above Speed Limit\n\n\nSpecial reports\n\n- The Fear of Sicko: CIGNA Whistleblower Wendell Potter Apologizes to Michael Moore for PR Smear Campaign; Moore Says Industry Was Afraid Film Would Cause A 'Tipping Point' for Healthcare Reform\n\nWe host a joint interview with Academy Award-winning filmmaker Michael Moore and Wendell Potter, who was the head of corporate communications for the health insurance giant CIGNA when Moore's film, &quot;Sicko,&quot; was released in 2007. Potter left the company in 2008 and has since become the industry's most prominent whistleblower. In the interview, Potter apologizes for his role in the industry's attack on Moore and the film.\n       \nMichael Moore accepted his apology, but acknowledged to Potter that, &quot;I think we both know this is much larger then what was done to me or in the movie.&quot; Moore said that the industry was willing to spending hundreds of thousands of dollars trying to &quot;stop a movie&quot; because they were afraid it &quot;could trigger a populist uprising against&quot; against, what he called, a &quot;sick system that will allow companies to profit off of us when we fall ill.&quot;\n\n\n- Joe Nocera on &quot;All the Devils Are Here: The Hidden History of the Financial Crisis&quot;\n\nAs federal agents raid the offices of three major hedge funds amidst news of a sweeping probe of insider trading at Wall Street firms, we speak with New York Times business columnist, Joe Nocera, about his new book All the Devils Are Here: The Hidden History of the Financial Crisis. The book describes how most of the underlying structures and key players behind the financial crisis have emerged relatively unscathed.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:482e934e1983bf072de7f202f7f32c4284dc6387","amp;dn":"Democracy+Now+-+23+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"482e934e1983bf072de7f202f7f32c4284dc6387","infoHashBuffer":{"type":"Buffer","data":[72,46,147,78,25,131,191,7,45,231,242,2,247,243,44,66,132,220,99,135]},"announce":[],"urlList":[]}}