{"title":"All-Radio v3.20 Full","uid":6120651,"size":11774115,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:48f9c6eb978409cb6b12863400f04ba493c31f53&amp;dn=All-Radio+v3.20+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"locobot12","files":-1,"time":1295728267,"description":"I found this amazing radio soft in a forum !! \n\nthis is awesome soft... its free no keygen crack needed\n\nu can listen to all radio stations in ur country or other countries all over the world!!\njust choose ur country and thats it start listening !\n\nthis not like those online Website controlled Radios .... \n\nOn-Air Radios are played :))\n\n\nIMPORTANT :\n\nSoftware needs administrator status to run so WIN 7 and VISTA users dont install \n\nin C drive !\n\nI am using it for the past three days without no problem !! installed in D drive :)\n\n\n\nAlso software developer in Russian so dont scared when initial installation instruction is like this - &quot;????????css????????????? ????? ??????????? &quot;\n\n\nthere are No threats!!\n\n \n\n-----------------------------------------------------------------------------------\n\nThe program offers access to 2500 radio stations and 1200 television channels from all over the world (100 countries). The program collected almost all the radio and TV stations broadcast in Russian. A positive point is that you do not need to update the program to supplement the list of stations. When you run the latest lists are automatically downloaded from the server developers.\n\nThe main advantages of All-Radio:\n- A huge amount collected in the program of radio and TV stations. As not very well-known and popular. Among them, notably the Russian radio, Radio Chanson, Lighthouse, Nashe Radio, Radio Hit FM, Radio Maximum, channel Rambler TV channel Vesti TV channel RBC TV. And this is only a small part. To date, the program collected: Radio - 2498, TV stations - 1121 Videos - 135. In this case, a list of their weekly updates (for the user update occurs automatically when you start the program). All stations are grouped by country, which makes them find the most convenient;\n- Work in the background.\nAll-Radio program by one mouse click is minimized to tray. You can enjoy listening to the radio through the Internet and do their own thing, and the program will not you be an eyesore.\n- Record, as the radio (music), and TV broadcasts (streaming video).\nFeatures:\nAbility to create, its radio stations\nRecording in MP3 format with bitrates from 32 to 320 (stored in your recordings)\nRecord in MP3 format, mono, stereo, j-stereo\nLimiting MP3 recording in minutes\nAutomatic updating of the list of stations\nFunction selected\nAbility to add your favorite stations\nAbility to send their stations to the server (to be added to the list after validation)\nAbility to record streaming video (except for flash)\nRestriction to record streaming video in megabytes\nProxy support (only for the module to record video)\nSupport for password (change password, database)\nFull support for Windows Windows 2000, Windows XP, Windows Vista, Windows 7\nSupporting 15 servers databases (databases on 15 servers)\nWhen writing MP3 files, the possibility of cutting the songs, provided that in between songs, there is a pause, without a sound\n\nHome Page - www.all-radio.net\n\n\nSEED and share!!\n\nLet me know if it good ! cheers!","torrent":{"xt":"urn:btih:48f9c6eb978409cb6b12863400f04ba493c31f53","amp;dn":"All-Radio+v3.20+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48f9c6eb978409cb6b12863400f04ba493c31f53","infoHashBuffer":{"type":"Buffer","data":[72,249,198,235,151,132,9,203,107,18,134,52,0,240,75,164,147,195,31,83]},"announce":[],"urlList":[]}}