{"title":"Coast to Coast AM - 11 - 19 - 10 - Jim Sullivan Mystery","uid":5978196,"size":55764546,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:49d0c50616fab51b1ca0dc010a10624e5e57c959&amp;dn=Coast+to+Coast+AM+-+11+-+19+-+10+-+Jim+Sullivan+Mystery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":6,"time":1290508000,"description":"The Jim Sullivan Mystery/Open Lines\n\nDate: 11-19-10\nHost: Ian Punnett\nGuests: Open Lines, Al Dobbs\n\nFilling in for George, Ian Punnett welcomed music producer Al Dobbs, in the first hour, for a discussion on the mystery surrounding musician Jim Sullivan's disappearance. Dobbs reflected on discovering Sullivan playing music in Malibu and being struck by how unique his style was, compared to the other artists of the time. &quot;He wasn't singing about love and birds and flowers,&quot; marveled Dobbs, &quot;this was just totally different. I had not heard anyone put words together like this.&quot; Compelled to capture Sullivan's style on record, Dobbs gathered the funds and produced Sullivan's album &quot;U.F.O.&quot; in 1969. Despite elation from the makers of the album, it was not a commercial success. The subsequent faltering of Sullivan's career would be the catalyst for the events which led to his disappearance.\n\nDobbs explained that, in 1974, Sullivan's career had stalled to the point that he decided to move to Nashville in the hopes of reinvigorating his artistry. Setting out for Nashville, Sullivan drove for 15 hours straight, was pulled over by the police, and ordered off the road, thus landing him in a hotel in Santa Rosa, New Mexico. According to Dobbs, at some point later, Sullivan got back on the roab and drove 26 miles down a &quot;dirt path going into an absolute wilderness.&quot; After an encounter with a family who lived nearby, the details of which remain in dispute, his car was discovered the next morning and Sullivan was never seen or heard from again. Despite investigations by both the police and Sullivan's family, his disappearance remains a mystery. A wistful Dobbs speculated that &quot;something went wrong one evening, possibly, and you have a cover-up.&quot;\n\nOpen Lines\n\nThe remainder of the program was devoted to Open Lines and featured a number of callers who knew people that had disappeared. James in Shiloh, Illinois told the story of how a UFO sighting in 1986 led to the disappearance of his friend's whole family. According to James, he and his friend had a UFO sighting one night on the outskirts of St. Louis, Missouri. The next day, his friend went back to investigate the area in the daylight and was thwarted by the military, who had cordoned off the area. They instructed the friend to keep silent about the sightings and to warn James the same thing. The &quot;shaken, nervous&quot; friend did as they instructed, but James was nonplussed by the warning. However, upon going to his friend's house weeks later, the house was abandoned and the neighbors were reticent about providing any details as to where the family went.\n\nConversely, Linda in Tennessee shared the amazing tale of being offered the opportunity to disappear by a nefarious doctor. She detailed how, while taking care of her dying husband, she took out numerous million dollar life insurance policies to insure that, should she die first, her husband's care would continue. Upon learning this information, the doctor made a chilling offer to help fake her death, using the medical records of dying homeless people that he had secretly been counseling. He revealed that he had done this for other people &quot;many, many times and it was very successful.&quot; While Linda and her husband opted not to accept the doctor's offer, they promptly left the state for fear of knowing too much about his scheme. Chillingly, the last thing the doctor said during their fateful meeting was that, he too, planned to fake his own death to reap the rewards of hefty life insurance policies.\n","torrent":{"xt":"urn:btih:49d0c50616fab51b1ca0dc010a10624e5e57c959","amp;dn":"Coast+to+Coast+AM+-+11+-+19+-+10+-+Jim+Sullivan+Mystery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49d0c50616fab51b1ca0dc010a10624e5e57c959","infoHashBuffer":{"type":"Buffer","data":[73,208,197,6,22,250,181,27,28,160,220,1,10,16,98,78,94,87,201,89]},"announce":[],"urlList":[]}}