{"title":"Kylie Minogue - Wow (Version 2) (Xvid-2nafish)","uid":5967663,"size":95397968,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4a45cd26ff6427717eab1f0ba2cfc70e9ac2e732&amp;dn=Kylie+Minogue+-+Wow+%28Version+2%29+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1290165137,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:17\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 3731 Kbps\nQuality Factor : 0.55 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Wow&quot; is a dance-pop song performed by Australian singer Kylie Minogue for her tenth studio album, X (2007). The song was written by Minogue, Greg Kurstin and Karen Poole and was produced by Kurstin. The song was released as the album's second single in Australia and the United Kingdom in February 2008 to mixed reviews from music critics. &quot;Wow&quot; was a commercial success, reaching the top twenty on the majority of the charts it entered. The song was released as the third single from the album in Europe in June. Three CD Singles were released in New Zealand, however, due to an supposed to be amount of downloads, it did not chart on RIANZ.\n\nOn December 15, 2007, Minogue performed &quot;Wow&quot; on the fourth season finale of The X Factor. Following the performance, &quot;Wow&quot; debuted on the UK Singles Chart at number thirty-two on December 24, 2007, based solely on digital download sales. Ten weeks later, the song reached number three. In February 2008, the song topped the UK Upfront Club Chart. This eventually became Kylie's best selling single in the UK since 2002's &quot;Love at First Sight&quot; selling over 180,000 copies.\n\nIn Australia, &quot;Wow&quot; was officially solicited to radio on January 14, 2008. The song debuted at number eleven, and remained on the singles chart for six weeks.\n\nThe song was set to be the leading single for the United States, but this was finally withdrawn and changed for the song &quot;All I See&quot; which has a more R&amp;B feel to appeal the American audience, however, the song was released to American dance radio-stations and has been a moderate success after debuted within the Top 40 of the Billboard Dance Radio Airplay, the song so far has peaked number nineteen.\n\nIn the Romanian Singles Chart, the song debutet at number 63 in February, finally peaking at number 42 in June, becoming her first song ever to miss the top 20.\n\nX is the tenth studio album by Australian recording artist Kylie Minogue. It is her first release since 2004's greatest hits compilation Ultimate Kylie, and her first studio album since 2003's Body Language. X was preceded by lead single &quot;2 Hearts&quot; and released worldwide in November 2007. The American release of X came in April 2008, preceded by the single &quot;All I See&quot;.\n\nWork on the album began following Minogue's gradual recovery from breast cancer and subsequent radiotherapy treatment. Her cancer, which was diagnosed in May 2005, resulted in the postponement of Showgirl: The Greatest Hits Tour tour midway through its run. Minogue resumed the tour in late 2006, in the midst of recording X, and was completed later in the following year.\n\nIn addition to positive critical reception, X was nominated for aAward for &quot;Best International Album&quot; and debuted at #1 in Australia, and in the top five in the United Kingdom. No official statement has been given on the sales of X but according to the UK newspaper The Times, as of December 2008, X had sold one million copies worldwide.\n\nOn 3 December 2008 it was announced that X had been nominated at the 51st Grammy Awards in the category of Best Electronic/Dance Album, making it Minogue's 5th Grammy Award nomination.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4a45cd26ff6427717eab1f0ba2cfc70e9ac2e732","amp;dn":"Kylie+Minogue+-+Wow+%28Version+2%29+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a45cd26ff6427717eab1f0ba2cfc70e9ac2e732","infoHashBuffer":{"type":"Buffer","data":[74,69,205,38,255,100,39,113,126,171,31,11,162,207,199,14,154,194,231,50]},"announce":[],"urlList":[]}}