{"title":"The Superions - Destination...Christmas!","uid":6053201,"size":246600458,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4a4d1a1bd073bd7dc7f44205028fb6c4c4bd8993&amp;dn=The+Superions+-+Destination...Christmas%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ddawg","files":-1,"time":1292806603,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/51jPeDIQCVL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/51jPeDIQCVL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Destination...Christmas!\nArtist: The Superions\nAudio CD (October 25, 2010) \nOriginal Release Date: 2010 \nNumber of Discs: 1 \nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Santa's Disco\n02. Fruitcake\n03. Chillin' At Christmas\n04. Teddy And Betty Yeti\n05. Christmas Conga (Jungle Bells)\n06. Jingle Those Bells\n07. Under The Tree\n08. Crummy Christmas Tree\n09. Laughter At Christmas\n10. Christmas Tears\n11. Santa Je T'aime \n\n\nAmazon Description:\nLeave it to The Superions to save the holidays from the usual stale chestnuts and dull oldie retreads. Following on the heels of their multiplat... er, real popular hit song &quot;Who Threw That Ham At Me,&quot; the 11 future holiday standards on &quot;Destination... Christmas!&quot; perfectly capture the many moods of the season: despair, avalanches, deranged abominable snowmen, leaden fruitcakes, and of course, laughter. High-energy dance songs mixed with numbers to chill to, The Superions do it all on &quot;Destination... Christmas!&quot; &quot;Destination... Christmas!&quot; defines the modern Christmas classic with a traditional twist. &quot;It's hard to say who our musical influences for this project were, because we don't want to get sued,&quot; adds Fred. Frankly, the response The Superions have received from playing this record for friends has been hysterical laughter. It's a very radio-friendly, party-friendly album; even Noah's grandmother likes it! &quot;Destination... Christmas!&quot; will be released on Fanatic Records and is destined to be a perennial Christmas favorite... hopefully \n\nAllmusic Review:\nFred Schneider's (The B-52's) phlegmatic sing-talk vocals are a big part of the charm that made the B-52's one of the most original bands to emerge from the new wave movement. Part arty, part disco party, the B's slowly became a mainstream success, much to their own surprise. Like all artists, Schneider has so much going on inside his head that there's not enough room in one band to contain it. He's had side projects before, but despite the folks he collaborated with, Fred Schneider &amp; the Shake Society and Just Fred were solo efforts. On Destination...Christmas!, Schneider is part of a band, albeit a stripped-down electronica trio. He's been collaborating with Noah Brodie (keyboards and electric drums) and programmer Dan Marshall for almost a decade, and when a couple of tunes they wrote -- the lounge anthem &quot;Totally Nude Island&quot; and the disco takeoff &quot;Who Threw That Ham at Me?&quot; -- became surprise iTunes hits, they began planning a trio of albums: one aimed at discos, one aimed at the Halloween market, and a Christmas album. Continued touring with the B-52's forced Schneider and his bandmates to cut back on their plans, so fans will have to be content with this off-the-wall collection of Christmas tunes. Needless to say, Destination...Christmas! is dark, sexy, and surrealistic, about as far from a typical Christmas album as you can get. &quot;Santa's Disco&quot; sounds a bit like the B-52's, and details a drunken Christmas Eve orgy at the North Pole, with celebrants doing interesting things with candy canes. &quot;Christmas Tears&quot; is a dark moody piece that lists off the horrors of the season from mouse droppings under the Christmas tree to relatives bearing cold zucchini casseroles. &quot;Jingle Those Bells&quot; sounds like Fred's spending the holidays at a strip club while &quot;Santa Je T'Aime&quot; is a knockoff of Serge Gainsbourg's heavy breathing classic &quot;Je T'Aime Moi Non Plus.&quot;","torrent":{"xt":"urn:btih:4a4d1a1bd073bd7dc7f44205028fb6c4c4bd8993","amp;dn":"The+Superions+-+Destination...Christmas%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a4d1a1bd073bd7dc7f44205028fb6c4c4bd8993","infoHashBuffer":{"type":"Buffer","data":[74,77,26,27,208,115,189,125,199,244,66,5,2,143,182,196,196,189,137,147]},"announce":[],"urlList":[]}}