{"title":"TweakNow PowerPack 2.2 RETAIL by F.O.S.I","uid":5982308,"size":7927821,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4b9e3c520d63e2595c4be12a818460e4f3995d54&amp;dn=TweakNow+PowerPack+2.2+RETAIL+by+F.O.S.I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pr1me","files":1,"time":1290625925,"description":"\t\t\nTweakNow PowerPack is a fully-integrated suite of utilities that let you fine-tune every aspect of your computer's operating system and Web browser. The Registry Cleaner module provides you with a safe and simple way to clean Windows Registry. To keep your computer always at top performance, we recommend to clean your registry at least once a month. For Windows tweaking lovers, the suite provides more than 100 hidden Windows settings in the Windows Secret section. Using modules included in this section, you can easily customize your Windows like geeks do. The Virtual Desktop module lets you run as many as four custom-designed desktop configurations simultaneously, allowing you to tailor your computer screen to your mood and your work requirements.  Last but not least, the suite also gives you a complete picture of all aspects of your computer's hardware, including detailed information about your motherboard, processor, video card, memory, hard disk and network.\n\nAs this is no longer available from FOSI's site, I've taken the liberty of uploading it here as a torrent and hope FOSI (the legend) can forgive me for doing so. \n\nAll credits to FOSI","torrent":{"xt":"urn:btih:4b9e3c520d63e2595c4be12a818460e4f3995d54","amp;dn":"TweakNow+PowerPack+2.2+RETAIL+by+F.O.S.I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b9e3c520d63e2595c4be12a818460e4f3995d54","infoHashBuffer":{"type":"Buffer","data":[75,158,60,82,13,99,226,89,92,75,225,42,129,132,96,228,243,153,93,84]},"announce":[],"urlList":[]}}