{"title":"Death Race(2008)DVDRip.AC3(ENG)-DROCK","uid":6217610,"size":733546658,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4c3e583f3380045b093c94a4fd6d14f472a88aa0&amp;dn=Death+Race%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1299220302,"description":"The Transporter star Jason Statham takes the wheel in director Paul W.S. Anderson's remake of the Roger Corman classic about a hyper-violent cross-country race that breaks all of the traditional rules of the road. The time is the not-so-distant future, and as America's prisons begin overflowing with violent criminals, the powers that be devise a grisly game that will free up space in the cells and entertain the masses at the same time. Jensen Ames (Statham) is a three-time speedway champion with a dark past. A survival expert and ex-con whose sordid history comes back to haunt him when he is framed for a murder he didn't commit, Ames is forced to choose between donning the metallic mask of a mythical racer known as Frankenstein or languishing away on Terminal Island -- America's most notorious penitentiary. Over the course of the next three days, this unlikely champion will get behind the wheel of a nightmare machine outfitted with machine guns, grenade launchers, and flamethrowers in a desperate attempt to outrun some of the most violent criminals ever imprisoned. Should Ames be the first to cross the checkered flag, he will win his freedom; should he come in second, however, death would be preferable to a grim future in a cramped concrete cell. Co-stars include Joan Allen, Ian McShane, Natalie Martinez, and Tyrese Gibson, who takes over the role of Machine Gun Joe, made famous by Sylvester Stallone in the original. \n\nRipped with Handbrake.\n\nLength: 1 Hour\n\nFile Type: AVI","torrent":{"xt":"urn:btih:4c3e583f3380045b093c94a4fd6d14f472a88aa0","amp;dn":"Death+Race%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c3e583f3380045b093c94a4fd6d14f472a88aa0","infoHashBuffer":{"type":"Buffer","data":[76,62,88,63,51,128,4,91,9,60,148,164,253,109,20,244,114,168,138,160]},"announce":[],"urlList":[]}}