{"title":"Roy Orbison (1984) Wild Hearts Run Out Of Time.mpg","uid":6081730,"size":189503492,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4d3e84b585760b2b07e59926a0860b2aa1d58f1b&amp;dn=Roy+Orbison+%281984%29+Wild+Hearts+Run+Out+Of+Time.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boonie1974","files":-1,"time":1294101155,"description":"720x576\n25fps, PAL\n192kbps ac3\n\nOrbison wrote this with songwriter Will Jennings, who had written the hugely successful theme song to An Officer And A Gentleman (&quot;Up Where We Belong&quot;) in 1982 and went on to write &quot;My Heart Will Go On&quot; for Titanic. Says Jennings:\n&quot;This song was written for a Nic Roeg film, Insignificance, in the summer of 1984. I had been engaged to write songs for the film with Stanley Myers, the composer for the project, and I asked the film company to get in touch with Roy, who I did not know at the time, to see whether he would like to do the main song for the film. I started work in California, went to Nashville and met with Roy, and we took a few days to develop the song I had started. Originally the title was &quot;When Your Heart Runs Out Of Time.&quot; We intensified the lyric to &quot;Wild Hearts Run Out Of Time.&quot; The film was about an imagined gathering of Marilyn Monroe, Joe DiMaggio, Albert Einstein and, I think, Senator Joseph McCarthy in Einstein's apartment in New York. Roy and I focused on Marilyn: the song is about reaching to save her before she destroys herself. Roy and I became great friends starting with this project and spent a lot of time together after he moved to California.&quot;","torrent":{"xt":"urn:btih:4d3e84b585760b2b07e59926a0860b2aa1d58f1b","amp;dn":"Roy+Orbison+%281984%29+Wild+Hearts+Run+Out+Of+Time.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d3e84b585760b2b07e59926a0860b2aa1d58f1b","infoHashBuffer":{"type":"Buffer","data":[77,62,132,181,133,118,11,43,7,229,153,38,160,134,11,42,161,213,143,27]},"announce":[],"urlList":[]}}