{"title":"Alien Anthology - Blu-ray 720p -Crisp","uid":5945960,"size":10734803549,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:4e810ad0d91381b7584115c672ba281a6c6a1dde&amp;dn=Alien+Anthology+-+Blu-ray+720p+-Crisp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"crispy1989","files":5,"time":1289367494,"description":"Release Title: Alien Anthology\nBlu-ray Release Date: 26, October 2010\nTag Line: We are not alone.\nGenre: Action | Horror | Sci-Fi | Thriller\nDirector: Ridley Scott, James Cameron, David Fincher and Jean-Pierre Jeunet\nRating: 18 / R for strong sci-fi violence and gore, some grotesque images, and for language.\nLanguage: English\nVideo Format: H.264/MPEG-4 AVC\nEncoder: x264\nAudio Format: MPEG-4 AAC-LC\nFormat Version: Version 4\nAudio Channels: 6 Channel\n\n------------------------------------------------------------------------------------\n\nAlien (1979)\nThe spaceship Nostromo visits the desolate planetoid LV-426 after receiving an unknown signal, discovering that it comes from a derelict alien spacecraft. Whilst exploring the ship, one of the Nostromo's crewmen discovers an egg-like object, which releases a creature that attaches itself to his face and renders him unconscious. Some time later, the parasite dies and the crewman wakes up, seemingly fine. However, an alien creature later bursts out of his chest and, after rapidly growing into an eight-foot creature, starts killing other members of the crew.\n\nAliens (1986)\nLieutenant Ellen Ripley, the only survivor of the Nostromo, awakens from hypersleep 57 years later, aboard a new space station. She discovers that LV-426 is now home to a terraforming colony. When contact with the colony is lost, Ripley accompanies a squad of space marines there aboard the Sulaco.\n\nAlien 3 (1992)\nDue to a fire aboard the Sulaco, an escape pod is released. It crash-lands on the refinery/prison planet Fiorina &quot;Fury&quot; 161. Ripley is the only survivor. Unknown to her, a facehugger was aboard the ship. The creature is born in the prison and begins a killing spree. Ripley later discovers there is also an alien growing inside her.\n\nAlien Resurrection (1997)\nTwo hundred years after the events of the previous film, Ellen Ripley is cloned and an Alien queen is surgically removed from her body. The United Systems Military hopes to breed Aliens to study on the spaceship USM Auriga, using human hosts kidnapped and delivered to them by a group of mercenaries. The Aliens escape their enclosures, while Ripley and the mercenaries attempt to escape and destroy the Auriga before it reaches its destination, Earth.\n\n------------------------------------------------------------------------------------\n\nPlease seed, comment and enjoy!\n\nBrought to you by Crisp","torrent":{"xt":"urn:btih:4e810ad0d91381b7584115c672ba281a6c6a1dde","amp;dn":"Alien+Anthology+-+Blu-ray+720p+-Crisp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e810ad0d91381b7584115c672ba281a6c6a1dde","infoHashBuffer":{"type":"Buffer","data":[78,129,10,208,217,19,129,183,88,65,21,198,114,186,40,26,108,106,29,222]},"announce":[],"urlList":[]}}