{"title":"Die Frau die an Dr. Fabian zweifelte","uid":6118582,"size":733977956,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4eeacd3f978950d42b997b307be1da0305467d17&amp;dn=Die+Frau+die+an+Dr.+Fabian+zweifelte&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1295659323,"description":"Paul ist Medizinstudent, verbringt aber sein Studium bisher damit sein Leben zu genieÃƒÅ¸en, unter anderem mittels Drogenkonsums. Nachdem der Kurier seines Dealers unter mysteriÃƒÂ¶sen UmstÃƒÂ¤nden ausgefallen ist, erhÃƒÂ¤lt er die Gelegenheit die nÃƒÂ¤chste Fuhre zu ÃƒÂ¼bernehmen. Er soll diese ÃƒÂ¼ber die Grenze schmuggeln. Leider nascht er von dem Stoff und findet sich am darauffolgendem Tag und nach einem ÃƒÂ¼blen Trip im Krankenhaus wieder. Von dort flieht er, schleppt sich in seine Wohnung und bricht dort erneut zusammen. WÃƒÂ¤hrenddessen hat sein Vater Willi von der Sache Wind bekommen und fÃƒÂ¤hrt kurzentschlossen los, seinen Sohn aus dem Drogensumpf zu holen. Nach erfolgreicher Mission sperrt er diesen in seinen alten HundekÃƒÂ¤fig und will ihn dazu zwingen die Bastei-Schmonzette Die Frau, die an Dr. Fabian zweifelte auswendig zu lernen, damit er mal was fÃƒÂ¼r sein Studium tut. Unterdes macht sich der Dealer Ingo zusammen mit seinem behinderten Halbbruder Super auf, seine Ware zurÃƒÂ¼ckzuholen. Auch Pauls Freundin Lena fÃƒÂ¤hrt los, um Paul zu finden. Zwischen Paul und seinem Vater wird mittlerweile die zerrÃƒÂ¼tette Vater-Sohn-Beziehung aufgearbeitet, was darin gipfelt, dass Willi seinen Sohn dazu bringen wird ihm bei der RÃƒÂ¼ckeroberung seiner ehemaligen Frau (auch Pauls Mutter) zu helfen. Als die Drogendealer den vermeintlichen Drogendieb schlussendlich aufspÃƒÂ¼ren, gelingt es Paul nur mit MÃƒÂ¼he zu ÃƒÂ¼berleben.","torrent":{"xt":"urn:btih:4eeacd3f978950d42b997b307be1da0305467d17","amp;dn":"Die+Frau+die+an+Dr.+Fabian+zweifelte","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eeacd3f978950d42b997b307be1da0305467d17","infoHashBuffer":{"type":"Buffer","data":[78,234,205,63,151,137,80,212,43,153,123,48,123,225,218,3,5,70,125,23]},"announce":[],"urlList":[]}}