{"title":"Joe Harriott Killer Joe(jazz)(flac)[rogercc].","uid":5986985,"size":958597780,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4f0b50b9975ab8457d283caa2a898210c88e9156&amp;dn=Joe+Harriott+Killer+Joe%28jazz%29%28flac%29%5Brogercc%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rogercc1","files":35,"time":1290768648,"description":"JOE HARRIOT KILLER JOE\nAudio CD 26 Feb 2007 \nLabel: Giant Steps\nFormat:Flac\n\nThis upload is a admitted self indulgence in memory of an earlier time spent listening to Joe, Jimmy  Skidmore &amp; Alan Skidmore, Don Rendell, Buzz Green and many others on a Friday at the Station Inn Knebworth Hertfordshire, \n\nJoe Harriott is best remembered for his avant-garde/free jazz explorations of the '60s which found him playing music similar to but not overly derivative of Ornette Coleman, and for his mixture of jazz with Indian music. This double-CD, however, is much different. Consisting of Harriott's earliest recordings as a leader plus his significant sideman appearances with Buddy Pipp's Highlifers, Kenny Baker's Jazz Today Unit, singer Lita Roza and the Ronnie Scott Orchestra, Harriott is featured between 1954-1956 as a boppish altoist who was definitely under the influence of Charlie Parker and (tonewise) Sonny Criss. He is featured with several quartets, in Scott's big band, a few medium-size groups, and even with a string section (sounding like Bird with Strings) on &quot;I'll Remember April&quot; and &quot;Easy to Love.&quot; The ten-minute &quot;Blues in Threes&quot; by trumpeter Kenny Baker's all-star group matches Harriott with fellow altoists Bruce Turner and Bertie King in a similar fashion as Charlie Parker's studio jam session encounter with Johnny Hodges and Benny Carter. The only thing wrong with this well-conceived reissue of rare material is its title, since Benny Golson's &quot;Killer Joe&quot; had not been written yet. The subtitle, &quot;Birth of a Legend,&quot; sums up this retrospective better. Well worth searching for. ~ Scott Yanow\n\nWithout question, Jamaican-born alto sax man Joe Harriott stands tall as a genuineModern Jazz icon. Indeed, Joe Harriott ranks along side of such local Giant Killers as Victor Feldman, Tubby Hayes, Ronnie Scott and Stan Tracey. A product of Kingston's famed Alpha Boys' School, Joe Harriott was just 22 years old when, in May 1951, he arrived in England from Jamaica. A complete unknown, it took less than a couple of years for Joe to establish himself as a major player. `Killer Joe' vividly documents Harriott's emergence on the London scene. From that time when such popular West End haunts as Carnaby Street's The Sunset Club and The Feldman Club located at 100 Oxford Street erroneously billed &quot;the new alto sax discovery&quot; as &quot;Joe Harriet&quot;. Despite an early admiration for Charlie Parker, Joe wasn't a slavish copyist. The truth was you couldn't mistake Joe for any other alto player. At this juncture in his career, his exuberant approach to the standard bop vocabulary was set high\n\nRecording information: London, England (02/??/1954-07/06/1956).\n\nDisc: 1\n[color=red]1. Summertime\n2. April in Paris\n3. Cherokee\n4. Out of Nowhere\n5. Last Resort\n6. Best Behaviour\n7. How Deep Is the Ocean\n8. Get Happy\n9. Akee Blues\n10. Jump for Me\n11. Can't We Be Friends\n12. Raymond - Overture Theme\n13. Nice Work If You Can Get It\n14. Chirracahaua\n15. Teddi\n16. Song Is You\n17. It Don't Mean a Thing\n18. Blues in Threes\n\n\nDisc: 2\n1. Introduction\n2. Harlem\n3. She's Funny That Way\n4. Fascinating Rhythm\n5. I'll Remember April\n6. Easy to Love\n7. You'll Never Know\n8. Just Goofin'\n9. Everything Happens to Me\n10. Just Friends\n11. Joe's Blues\n12. Bang\n13. With Every Breath I Take\n14. Night in Tunisia\n15. Big Fist\n16. Blues Original\n17. My Heart Belongs to Daddy\n\n\nJoe Harriott's music goes virtually unheard today, yet the alto saxophonist exerted a powerful influence on early free jazz in England. The Jamaican-born and raised Harriott played with his countrymen, trumpeter Dizzy Reece and tenor saxophonist Wilton &quot;Bogey&quot; Gaynair, before immigrating to England in 1951. In London, Harriott worked freelance and in the band of trumpeter Pete Pitterson. In 1954, he landed an important gig with drummer Tony Kinsey; the next year he played in saxophonist Ronnie Scott's big band. His first album as a leader was 1959's Southern Horizon. Originally a bop-oriented player, Harriott gradually grew away from the conventions of that style. During a 1960 hospital stay, Harriott envisaged a new method of improvisation that, to an extent, paralleled the innovations of Ornette Coleman. Harriott was initially branded a mere imitator of Coleman, but close listening to both men reveals distinct differences in their respective styles. Harriott manifested a more explicit philosophical connection with bebop, for one thing, and his music was more concerned with ensemble interaction than was Coleman's early work. The 1960 album Free Form, which included trumpeter Shake Keane, pianist Pat Smythe, bassist Coleridge Goode, and drummer Phil Seaman, illustrated Harriott's new techniques. Beginning in 1965, he began fusing jazz with various types of world folk musics. He collaborated with Indian musician John Mayer on a record - 1967's Indo-Jazz Suite - that utilized modal and free jazz procedures. The album's traditional jazz quintet instrumentation was augmented by a violin, sitar, tambura, and tabla. Harriott's recorded output was scarce and virtually none of it remains in print[/color]\n\n\nPersonnel: Disc 1 1-4:\nJoe Harriot Quartet\nJoe Harriot (as)\nDill Jones (p)\nJack Fallon (b)\nPhil Seaman (ds)\nRecordeed: London, Feb. 1954\n\nDisc 1 5-8:\nTony Kinsey Trio with Joe Harriot\nJoe Harriot (as)\nBill Le Sage (vib, p)\nSammy Stokes (b)\nTony Kinsey (ds)\nRecordeed: London, May 13, 1954\n\nDisc 1 9:\nBuddy Pipp's Highlifers\nPete Pitterson (tp)\nBruce Turner, Joe Harriot (as)\nOscar McKay (p)\nDenny Wright (g)\nJoe Sampson (b)\nTony Kinsey (ds)\nAlf Hayward (maracas)\nBuddy Pipps (conga)\nRecordeed: London, Autumn 1954\n\n]Disc 1 10-17:\nTony Kinsey Trio with Joe Harriot\nJoe Harriot (as)\nBill Le Sage (vib, p)\nSammy Stokes (b)\nTony Kinsey (ds)\nRecordeed: London, Sep. 22, 1954\n\nDisc 1 18:\nKenny Baker with the Jazz Today Unit\nKenny Baker (tp)\nKeith Christie (tb)\nBertie King, Bruce Turner, Joe Harriot (as)\nJimmy Skidmore (ts)\nHarry Klein (bs)\nDill Jones (p)\nCedric West (g)\nFrank Clarke (b)\nEric Delaney (ds)\nRecordeed: London, Feb. 21, 1955\n\nDisc 2 1-4:\nTony Kinsey Trio with Joe Harriot\nJoe Harriot (as)\nBill Le Sage (vib, p)\nEric Dawson (b)\nTony Kinsey (ds)\nRecordeed: London, May 17, 1955\n\nDisc 2 5, 6:\nJoe Harriot with Strings\nJoe Harriot (as)\nMax Harris (p)\nSammy Stokes (b)\nPhil Seaman (ds)\nplus strings\nRecordeed: London, May 27, 1955\n\nDisc 2 7:\nLita Roza with Tony Kinsey Trio with Joe Harriot\nLita Roza (vcl)\nJoe Harriot (as)\nBill Le Sage (vib, p)\nEric Dawson (b)\nTony Kinsey (ds)\nRecordeed: London, Jul. 29, 1955\n\nDisc 2 8-11:\nJoe Harriot Quartet\nJoe Harriot (as)\nMax Harris (p)\nSammy Stokes (b)\nPhil Seaman (ds)\nRecordeed: London, Aug. 24, 1955\n\nDisc 2 12-15:\nRonnie Scott Orchestra\nStan Palmer, Hank Shaw, Dave Usden, Jimmy Watson (tp)\nJack Botterill, Robin Kaye, Mac Minshull, Ken Wray (tb)\nJoe Harriot, Dougie Robinson (as)\nRonnie Scott, Pete King (ts)\nBenny Green (bs)\nNorman Stenfalt (p)\nEric Peter (g)\nFrank Clarke (b)\nPhil Seaman (ds)\nRecordeed: London, Oct. 11, 1955\n\nDisc 2 16, 17:\nJoe Harriot Quartet\nJoe Harriot (as)\nJohnny Weed (p)\nMajor Holley (b)\nPhil Seaman (ds)\nRecordeed: London, Jul. 6, 1956\n\n","torrent":{"xt":"urn:btih:4f0b50b9975ab8457d283caa2a898210c88e9156","amp;dn":"Joe+Harriott+Killer+Joe%28jazz%29%28flac%29%5Brogercc%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f0b50b9975ab8457d283caa2a898210c88e9156","infoHashBuffer":{"type":"Buffer","data":[79,11,80,185,151,90,184,69,125,40,60,170,42,137,130,16,200,142,145,86]},"announce":[],"urlList":[]}}