{"title":"Democracy Now - 20 jan 2011","uid":6116271,"size":453368562,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4f5f9de45da91772316a5710a42f0d3b67de7bfd&amp;dn=+Democracy+Now+-+20+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1295566570,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 20, 2011\n\n- Loughner Indicted on New Charges; Details of Shooting Video Released\n- Giffords to be Transferred to Houston Hospital\n- Report: Admin to Renew Gitmo Military Tribunals\n- House Votes to Repeal Healthcare Law\n- Protest for Tibetans, Uyghurs Held Outside White House\n- Suicides Rise Among National Guard, Reserve\n- Ex-Military Officers Resign Pentagon Advisory Posts Rather than Admit Private Ties\n- 15 Killed in Iraq Suicide Bombings\n- Duvalier Sued for Human Rights Abuses in Haiti\n- Aristide Asks Haiti to Allow Return\n- Ivory Coast Talks Falter; U.N. Approves More Troops\n- Ohio Death Row Prisoners End Hunger Strike After Winning Demands\n- NYPD Used Anti-Muslim Video in Training Courses\n\n\nSpecial reports\n\n- China, Human Rights and the Role of Washington: A Debate\n\nChinese President Hu Jintao is in Washington, D.C., for his first official state visit to the White House. Many critics noted that Obama, a Nobel Peace Prize laureate, was hosting a banquet for a leader who is imprisoning another Nobel Peace Prize laureate: the jailed Chinese human rights activist and writer Liu Xiaobo. We host a debate on China, human rights and the role of the United States between Sharon Hom of Human Rights in China and Marc Blecher, a professor of politics and East Asian studies at Oberlin College.\n\n\n- Has Obama Assumed the Position of Salesman-in-Chief to China?\n\nWhat do the heads of Goldman Sachs, JPMorgan Chase, Microsoft, Motorola, General Electric, Boeing and the Carlyle Group have in common? They all attended last night\\'s State Dinner with President Hu Jintao. Earlier the White House announced $45 billion in new trade deals with China, including a $19 billion deal with Boeing and a package with GE expected to generate more $2 billion in U.S. exports. Some economists say the deals will hurt U.S. efforts to end the jobless Great Recession. \\&quot;President Obama has assumed the position of salesman-in-chief for companies like Boeing and General Electric who are actually engaged, along with many other multinational businesses, in primarily outsourcing American jobs to China,\\&quot; says guest Robert Scott, senior international economist with the Economic Policy Institute.\n\n\n- Fifty Years After Eisenhower\\'s Farewell Address, A Look at \\&quot;Prophets of War: Lockheed Martin and the Making of the Military-Industrial Complex\\&quot;\n\nThis week marks the 50th anniversary of President Dwight D. Eisenhower\\'s famous farewell speech to the nation in which he warned against the rise of a \\&quot;military-industrial complex.\\&quot; We speak with William Hartung, director of the Arms and Security Initiative at the New America Foundation, who traces the rise of the military-industrial complex through the story of the nation\\'s largest weapons contractor, Lockheed Martin. Hartung\\'s new book is Prophets of War: Lockheed Martin and the Making of the Military-Industrial Complex.\n\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4f5f9de45da91772316a5710a42f0d3b67de7bfd","amp;dn":"+Democracy+Now+-+20+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f5f9de45da91772316a5710a42f0d3b67de7bfd","infoHashBuffer":{"type":"Buffer","data":[79,95,157,228,93,169,23,114,49,106,87,16,164,47,13,59,103,222,123,253]},"announce":[],"urlList":[]}}