{"title":"Fedora-14-i686-Live-CD-Cm0nster-.iso","uid":5961261,"size":719323136,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:508f4756f93e084d10649a5c85c8dd3484cf3fa5&amp;dn=Fedora-14-i686-Live-CD-Cm0nster-.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cm0nster6","files":1,"time":1289960397,"description":"About Fedora:\nFedora is an open source Linux based operating system. It is community developed and sponsored by Red Hat.\n\n\nDesktop:\nThere are many desktop environments that can be used with Fedora. The default is GNOME.The KDE desktop environment can be used. There are many other desktop environments that can be used, and the looks of your system are infinitely customizable.\n\nSoftware: \nFedora users can instantly install software from an official repository. There are thousands of packages avaliable.\n\n\nSecurity:\nFedora is a Linux OS, and therefore is less vulnerable to the usual threats. However, Fedora has special features for enhanced security, such as SElinux, an advanced authentication system, and restricted kernel memory access.\n\n\nFile: This is the livecd image of Fedora 14 with GNOME. It can be run live, to test it out, without any changes to one's hard drive. Then you can install it to the hard drive.\nInstructions: Burn this .iso image to a disk with a iso recorder(e.g. isorecorder). Then boot from the disk, and installation is self explanatory. As am alternative to booting from a disk, you can use a liveusb creator to boot Fedora from a flash drive. (If your hardware supports it)","torrent":{"xt":"urn:btih:508f4756f93e084d10649a5c85c8dd3484cf3fa5","amp;dn":"Fedora-14-i686-Live-CD-Cm0nster-.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"508f4756f93e084d10649a5c85c8dd3484cf3fa5","infoHashBuffer":{"type":"Buffer","data":[80,143,71,86,249,62,8,77,16,100,154,92,133,200,221,52,132,207,63,165]},"announce":[],"urlList":[]}}