{"title":"El diario Ellen Rimbauer[DVDRip][Spanish].avi","uid":6098795,"size":735077812,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:50cb1dd54f7ea67f7d4827979ed0c83ea250c3e2&amp;dn=El+diario+Ellen+Rimbauer%5BDVDRip%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"erato99","files":1,"time":1294880842,"description":"Calidad de video: DVD RIP\nPeso: 701 mb\nIdioma del audio: EspaÃƒÂ±ol \n\nRose Red no existe y nunca existiÃƒÂ³. Pese a que hay mucha gente que cree lo contrario, lo cierto es que Stephen King se basÃƒÂ³ en la historia de la mansiÃƒÂ³n Winchester en California para escribir el guiÃƒÂ³n de lo que posteriormente se convertirÃƒÂ­a en una lujosa adaptaciÃƒÂ³n televisiva de cuatro horas de duraciÃƒÂ³n, que fue lanzada directamente en DVD.\n\nQueriendo seguir con %u201Cla falsa leyenda%u201D, un aÃƒÂ±o despuÃƒÂ©s se publicÃƒÂ³ El diario de Ellen Rimbauer, que pese a ser presentado como un documento real encontrado por la doctora Joyce Reardo -una de las protagonistas de Rose Red- realmente fue escrito por Ridley Pearson, bajista del grupo en el que toca Stephen King, Rock Bottom Remainder.\n\nCraig R. Baxley, que ya habÃƒÂ­a dirigido Rose Red, tambiÃƒÂ©n se hizo cargo de adaptar esta novela para la televisiÃƒÂ³n. En ella, la historia se centra en la tormentosa relaciÃƒÂ³n de Ellen Rimbauer y su inseparable Sukeena con el marido de la primera: Un hombre corrompido por la lujuria, alcohÃƒÂ³lico y uno de los hombres mÃƒÂ¡s influyentes del Seattle de finales del siglo pasado. A este triangulo se suma la gran mansiÃƒÂ³n, que pasa a convertirse en un personaje tan importante %u2013o incluso mÃƒÂ¡s- que cualquiera de los anteriores. Su posesiva y celosa relaciÃƒÂ³n con Ellen Rimbauer es lo que desencadena la turbia y dramÃƒÂ¡tica historia de este edificio.\n\nSin llegar a ser tan espectacular en efectos especiales como su antecesora, El diario de Ellen Rimbauer consigue superarla sobretodo gracias a un argumento mÃƒÂ¡s sÃƒÂ³lido, una historia mÃƒÂ¡s interesante y un reparto menos excÃƒÂ©ntrico y mÃƒÂ¡s comedido.\n\nEl personaje de Sukeena, que vuelve a ser protagonizado por la escalofriante Tsidii Leloka, es quien sufre mÃƒÂ¡s variaciones respecto a la novela. En ÃƒÂ©sta, Sukeena era mostrada como una aborigen que poco a poco iba occidentalizÃƒÂ¡ndose. Sin embargo, en la pantalla es presentada de comienzo como una mujer educada, culta y que habla el idioma de los Rimbauer a la perfecciÃƒÂ³n. Asimismo, el epÃƒÂ­logo en que ella desaparece en Rose Red por culpa de los celos de ÃƒÂ©sta, tambiÃƒÂ©n ha sido olvidado.\n\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:50cb1dd54f7ea67f7d4827979ed0c83ea250c3e2","amp;dn":"El+diario+Ellen+Rimbauer%5BDVDRip%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50cb1dd54f7ea67f7d4827979ed0c83ea250c3e2","infoHashBuffer":{"type":"Buffer","data":[80,203,29,213,79,126,166,127,125,72,39,151,158,208,200,62,162,80,195,226]},"announce":[],"urlList":[]}}