{"title":"TwistedBrush Pro Studio v17.23 [Portable]   ","uid":6057145,"size":49141119,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5117055c883faaf3e5102f1dac2b317e450ec2d3&amp;dn=TwistedBrush+Pro+Studio+v17.23+%5BPortable%5D+++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chusca","files":4,"time":1292954513,"description":"El editor Pixarra nos presenta TwistedBrush, su programa de dibujo orientado al artista que estÃƒÂ¡ en cada uno de nosotros, una aplicaciÃƒÂ³n potente con la que podrÃƒÂ¡s iniciarte al arte digital plasmando tÃƒÂ©cnicas de pintura existentes o explorando nuevos derroteros artÃƒÂ­sticos de forma natural. TwistedBrush es un sofisticado y completo programa de dibujo. Brinda una amplia variedad de filtros y herramientas de pintura al ÃƒÂ³leo, un aerÃƒÂ³grafo digital y unas cuantiosas brochas y pinceles suaves o de cerdas duras, pintura al pastel, asÃƒÂ­ como toda una colecciÃƒÂ³n de lÃƒÂ¡pices de colores, plumas, rotuladores de fieltro y una serie de herramientas especificas y uso poco comÃƒÂºn.\nÃ‚Â¿FÃƒÂ¡cil de usar? Todo depende del grado de paciencia y empeÃƒÂ±o que le pones, aunque en un principio puede parecer algo complicado, el truco se coge rÃƒÂ¡pido. Lo bueno de la interfaz de TwistedBrush Open Studio es que ha sido diseÃƒÂ±ada para que el usuario pueda aprender a su ritmo, viendo solamente lo que necesita, descubriendo despuÃƒÂ©s nuevas herramientas y sutilezas que antes, quedaban como ocultas.\nPor ÃƒÂºltimo, cabe resaltar una interesante posibilidad de TwistedBrush, la de guardar la configuraciÃƒÂ³n actual, con sus brochas y filtros, a una especie de plantilla llamada &quot;artset&quot;, para usos posteriores.\nTwistedBrush soporta los siguientes formatos: BMP, EMF, GIF, JPG, PCD, PCX, PNG, PSD, TBR, TGA, TIF, WMF, WBMP\n|-Windows 2000/XP/Vista/7 \n-Idioma: Ingles\n\n\n","torrent":{"xt":"urn:btih:5117055c883faaf3e5102f1dac2b317e450ec2d3","amp;dn":"TwistedBrush+Pro+Studio+v17.23+%5BPortable%5D+++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5117055c883faaf3e5102f1dac2b317e450ec2d3","infoHashBuffer":{"type":"Buffer","data":[81,23,5,92,136,63,170,243,229,16,47,29,172,43,49,126,69,14,194,211]},"announce":[],"urlList":[]}}