{"title":"The Jethro Tull Christmas Album","uid":5991284,"size":445735334,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:52db6df760d14eff512c415de65e6ba5db36e034&amp;dn=The+Jethro+Tull+Christmas+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ddawg","files":-1,"time":1290898403,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/71DFKp6WKyL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/71DFKp6WKyL.jpg&lt;/a&gt;\n\n\nTitle: The Jethro Tull Christmas Album\nArtist: Jethro Tull\nAudio CD (September 30, 2003)\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Birthday Card at Christmas\n02. Holly Herald (Instrumental)\n03. A Christmas Song\n04. Another Christmas Song\n05. God Rest Ye Merry Gentlemen (Instrumental)\n06. Jack Frost and the Hooded Crow\n07. Last Man at the Party\n08. Weathercock\n09. Pavane (Instrumental)\n10. First Snow on Brooklyn\n11. Greensleeved (Instrumental)\n12. Fire at Midnight\n13. We Five Kings (Instrumental)\n14. Ring Out Solstice Bells\n15. Bourie (Instrumental)   \n16. A Winter Snowscape (Instrumental)\n\n\nAmazon Review:\nThe holidays have gotten even brighter with Jethro Tull's marvelous offering for this time of year, &quot;The Jethro Tull Christmas Album.&quot; Ian Anderson &amp; company serve up a hearty yuletide blend of new Tull Christmas originals, including the terrific &quot;Birthday Card At Christmas,&quot; &quot;Last Man At The Party,&quot; and &quot;First Snow On Brooklyn,&quot; as well as new re-recordings of old holiday-themed Tull favorites like &quot;A Christmas Song,&quot; &quot;Another Christmas Song,&quot; &quot;Ring Out Solstice Bells,&quot; and the signature Tull tune, &quot;Bouree.&quot; Along with that classic instrumental, the band give us some more wonderful instrumental tracks, like the brilliant jazz take on &quot;God Rest Ye Merry Gentlemen,&quot; &quot;Pavane,&quot; &quot;Greensleeved,&quot; and the beautiful closer, &quot;A Winter Snowscape.&quot; The band play brilliantly, and Anderson's voice and flute are still in pristine form. &quot;The Jethro Tull Christmas Album&quot; is a magnificent gift from one of rock's most enduring acts. Happy holidays from Jethro Tull! \n\nAllmusic Review:\nFor a band that remained relatively consistent (with a few minor exceptions) in their approach to rock &amp; roll since 1968, Jethro Tull also possessed a sound that was uniquely '70s-oriented during their most successful period between 1971-1978. Avid fans have been yearning for the group's return to the style which made them one of the most successful of the guitar-based, mainstream prog outfits -- albums like Broadsword and the Beast and J-Tull.Com touched on their former glory, but they didn't fully satisfy. Christmas Album could be the recording that those fans have been waiting for, and they shouldn't let its title or overt seasonal orientation dissuade them -- with their liberal use of classic English folk music and overall orientation toward England's past (even in their name), Jethro Tull is also the one prog rock/hard rock band of their generation that could issue a Christmas album that folds so easily into the rest of their output; it transcends its purpose and focus, mostly through the quiet boldness of its music and playing and the surprising excitement that laces most of the 16 songs. With a mixture of re-recorded old songs, Christmas standards and new originals, songwriter/singer Ian Anderson, in a roundabout manner, captures the tradition, warmth, and bittersweet feelings that are inextricably linked to the holiday season; at the same time, Anderson, longtime collaborator/lead guitarist Martin Barre, and the rest of the group's 2003 lineup recapture the musical intensity of three decades' past, and build on the classic Tull mood of sardonic humor, wry irony, and fierce passions that permeated all of their work from Stand Up to Songs From the Wood. All of this material, in its content and execution, recalls the group's prime early-'70s years and levels of musical complexity not presented so successfully by this band in at least 25 years. With a generous use of unamplified instruments like mandolin, acoustic guitar, flute, and accordion, this album resembles the production found on Songs From the Wood and Heavy Horses. In fact, three tracks from those two albums were reworked for this release; &quot;Fire at Midnight,&quot; &quot;Ring Out Solstice Bells&quot; and &quot;Weathercock.&quot; Only &quot;Ring Out Solstice Bells&quot; appeared to be the obvious choice for a Christmas album, but given Anderson's offbeat perspective of things, the other two tracks assimilate nicely. In addition, &quot;Jack Frost and the Hooded Crow&quot; sounds like it could have emanated from those 1977 and 1978 recordings, as could &quot;Last Man at the Party&quot; from 1974's War Child sessions. Among the re-recordings, pieces such as &quot;A Christmas Song,&quot; that originally had orchestral accompaniment, are redone without it, in new arrangements, while others that were done without orchestra get dressed up with strings. From the traditional side of Christmas, Tull gives &quot;God Rest Ye Merry Gentlemen&quot; a jazzy adaptation reminiscent of &quot;Bouree&quot; from Stand Up (which is also revisited on this recording) and &quot;We Five Kings&quot; sounds rhythmically similar to &quot;Living in the Past,&quot; particularly the bass guitar line. In addition to Bach's Bouree, the majestic Gabriel FaurÃƒÂ© piece Pavane is included, which features guitarist Martin Barre's exceptional acoustic playing. And Barre himself gets a rare solo composition as the album closer (a Christmas gift from Anderson?), the deeply evocative tone-painting &quot;A Winter Snowscape,&quot; which takes some gratifying turns away from the most obvious melodic direction. The album's overall mix of folk, jazz, pop, rock, and classical elements carries it beyond the holiday listening for which it was intended, and is all woven together so skillfully as to make this an essential Tull album, their first in almost three decades and their most musically rewarding. And although this Christmas album doesn't necessarily conjure up images of Santa and the Savior, it does create a mood and feeling reflective of the holiday season. More importantly, it is perhaps the most satisfying Tull releases in 25 years. [Reissued in late 2004 in a limited-edition version with a bonus DVD containing three performance videos of material going back to &quot;That Sunday Feeling&quot;]. \n\n","torrent":{"xt":"urn:btih:52db6df760d14eff512c415de65e6ba5db36e034","amp;dn":"The+Jethro+Tull+Christmas+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52db6df760d14eff512c415de65e6ba5db36e034","infoHashBuffer":{"type":"Buffer","data":[82,219,109,247,96,209,78,255,81,44,65,93,230,94,107,165,219,54,224,52]},"announce":[],"urlList":[]}}