{"title":"Joboshare DVD to MP4 Converter 3.0.4.0228 [ak]","uid":6211686,"size":6271798,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:532705b38f9950d1fa9bfaef1057f23f8b0e76e0&amp;dn=Joboshare+DVD+to+MP4+Converter+3.0.4.0228+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1299008082,"description":"Joboshare DVD to MP4 Converter is a very powerful DVD to MP4 converter program with very intuitive and user-friendly interface. It can convert DVD to MP4, AVI, MPEG4, DivX, and XviD video formats with excellent output quality.\n\nJoboshare DVD to MP4 Converter supports most MP4 players and it allows you easily convert DVD to MP4 for playback on iPod, iPhone, Apple TV, PSP, PS3, Archos AV500, Archos AV700, Archos GMini402, iRiver PMP-100, Creative Zen Vision and other popular MP4 players.\n\nBesides converting DVD to MP4 video, Joboshare DVD to MP4 Converter can also rip and convert DVD to audio files like MP3, AAC, and M4A.\n\nThe best DVD to MP4 Converter allows you to customize video and audio bitrate, adjust resolution, set frame rate, select DVD audio track and subtitle, select any DVD chapters/titles to convert, trim your DVD chapters/titles to only convert your favorite clips and so on.\n\nKey Features:\n* High compatibility with MP4 players\n* Joboshare DVD to MP4 Converter can convert DVD to MP4 video and music fomats for playback on most players such as iPad, BlackBerry, Apple TV, PSP, PS3, iPod, iPhone, iRiver, Creative Zen, Archos, etc;\n* Change and set audio settings\n* Users have the option to set the subtitle, audio and camera angle before conversion;\n* Split large files\n* Split output file into several files, users even have the option to set split file size or time; convert a large file into several small ones to fit them into players;\n* Multiple output formats for different sources\n* Convert several different formats from different source files at the same time, so you can play these files in different multimedia players;\n* Batch process and multithreading\n* Multithreading and batch conversion provide super fast conversion speed due to multi-core CPU support. Faster than any other DVD to MP4 conversion software;\nVery easy to use\n* User-friendly interface without any complicated settings. Convert DVD to MP4 with just a few clicks;\n* Windows 7 compatible\n\nHome Page - http://www.joboshare.com/index.html\n","torrent":{"xt":"urn:btih:532705b38f9950d1fa9bfaef1057f23f8b0e76e0","amp;dn":"Joboshare+DVD+to+MP4+Converter+3.0.4.0228+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"532705b38f9950d1fa9bfaef1057f23f8b0e76e0","infoHashBuffer":{"type":"Buffer","data":[83,39,5,179,143,153,80,209,250,155,250,239,16,87,242,63,139,14,118,224]},"announce":[],"urlList":[]}}