{"title":"Pong: The Next Level (PSX) (PS1) (Use ePSXe) (Pong)","uid":6214110,"size":213542607,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:53f9a069141e9460b7cc5edcd45d9c685158a014&amp;dn=Pong%3A+The+Next+Level+%28PSX%29+%28PS1%29+%28Use+ePSXe%29+%28Pong%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FuCtUpPuNk","files":7,"time":1299095417,"description":"INSTALLATION:\nUse an Emulator to run the games.\nRecommended: ePSXe 1.6 or 1.7\n\nI have also uploaded the emulator to run this game on the following link:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&lt;/a&gt;\n------------------\n------------------\n------------------\n\nGAMEPLAY:\nSupersonic Software is the development team to thank for this remake Ã‚Â¿ and what a heck of a remake it is. It's a little more than just an electronic tennis game in this iteration, but the central idea remains the same: Players control a flat, elongated rectangular rod (a paddle), and maneuver it up and down the screen to protect their goal. The opponent is trying to get a series of balls past you and into your goal Ã‚Â¿ the player who reaches the level's set game point wins the match.\n\nPong on the PlayStation takes that original idea, adds a super clean and smooth 3D and physics engine, and hammers out dozens of new ideas only a 3D game could possibly do. There are six zones filled with at least three different types of Pong challenges, each with three different, increasingly difficult variations on that level. Most one-on-one games also feature power-ups that you can collect that will benefit you in some fashion against the other opponent. Here's just a taste of what you can expect.\n\n    * Penguin Pong. This very first level introduces you to not only the simple gameplay of the original Pong, but also provides a taste of the extra things to expect in the remake. Simply hit the snowballs back and forth on this icecap Ã‚Â¿ when you hit a waddling penguin, it'll lay another snowball Ã‚Â¿ you'll have up to four balls moving on this playfield. The first level powerup awards you a seal that acts as an AI backup paddle, rescuing balls that might go beyond your own paddle. The second level powerup awards you a visit from a polar bear that pushes down on your side of the playfield, creating a 45 degree slope on your side, a complete wall for the opponent. The third level has no powerups Ã‚Â¿ you have to deal with a blizzard that causes random gusts of wind to blow in any direction on the playfield.\n\n    * Soccer Stars. In this game, you take control of two paddles, one acting as goalie, the other acting as an offensive player. The ball can travel through the back of the offensive paddle. The goal isn't as wide as the playfield, so you have to make sure it goes into it to score a point. Unique to this level is the penalty shootout when both players tie at nine goals Ã‚Â¿ most other one-on-one games go through the very tennis-like Tie-Advantage-Win point structure. But Soccer Stars provides the five penalty kick option where you determine the power of the paddle hit and direction, and the goalie has to &quot;dive&quot; in the appropriate direction to block the shot. In the second and third variations of this level, moles will dig holes in the field during the match, wreaking havoc with the direction of the ball if it hits these mounds.\n\n    * Puck Pong. This brilliant level takes place on an ice-rink. The idea isn't to save the ball from going past your paddle -- it's to nail the balls at a huge hockey puck across the other player's goal line. The object is heavy and only slides when it gets it -- when it approaches a goal line, it glows yellow then red, and when it crosses more than halfway over, the point is awarded to the other player. Fans on either side of the rink come into play in the later two levels, making the puck harder to cross the line.\n\n    * Rock n Roll. This match goes back to classic Pong with one twist Ã‚Â¿ the playfield can slant if you pick up a power-up, making it difficult for the other person to get the ball to you. Later levels give you power-ups that can make the center of the playfield buckle with hills.\n\nThere also are one-player levels providing challenges with how well you can control the ball all by yourself. In Flock Fiasco, you're on a round cliff trying to herd sheep into the center by hitting them with the ball. If one wanders off the cliff, game over. Pongball Wizard is a pinball machine where you have to hit the center targets down in order to collect the gold that's just out of reach. In Henhouse Surprise, a group of chickens lay colored eggs down a slope, and it's up to you to hit them into the appropriate colored bins.\n\nAll of this Pong playing leads up to one final match that takes place on the slope of the Atari logo. Get to the top, and you've completed the level -- but the game has three levels, and you'll have to beat each of the game's variations to actually complete the game. And when you defeat the computer in each match's variation, you've unlocked it so you can play against another player. And that's where the real fun is Ã‚Â¿ the computer is sometimes too good and smart, knowing exactly where the ball's going to go. You really want to play this game with someone equal in control.\n\nAnd, to answer that burning question in your mind, yes. The classic Pong is in here as well. If you beat each of the board's first levels, you'll unlock Classic Pong. It's not exactly an emulation, but it's pretty funny to see the simple, black and white stick and ball edition in here.\n\nThe only real complaint about Pong on the PlayStation is about the controls Ã‚Â¿ playing with the PlayStation controller, regular or Dual Shock, just can't compare to the precise control of the analog knobs on the original. The analog stick is particularly annoying, since it's still too touchy. What the developers should have done was match the position of the paddle with the position you're pushing the stick. Instead, the analog controls make it so the lighter you push up or down, the slower or faster you move on the screen.\n\nWhat they really should have done is add support for the only US-released controller that closely mirrors the paddle controls: the Namco JogCon driving controller that came packaged with R4: Ridge Racer. The game could have easily benefited from the analog wheel, and the designers could have even added a special secret power-up that would cause the other player's wheel to tighten up during play. I'm very disappointed that support for this controller wasn't included Ã‚Â¿ classic gamers want the classic feel, and without the analog paddle control, you feel slightly disconnected and helpless when the ball moves too quickly to follow with the slower digital and analog stick.\n\nGraphics\nAs mentioned above, Pong features an extremely fast and smooth 3D graphics engine. Most of the time the game runs at a speedy 60 frames a second, but in more complex levels the developers had to bring the framerate down to 30. But the game never slows down or gets choppy, and the developers use the 3D engine as much as possible. Cameras flow subtly during a match, playfields buckle and bend, reflective surfaces show every contour Ã‚Â¿ the paddles even have a bit of life to them, bending and squishing when they hit the ball or bump into the sides of the playfield. The graphics are top notch, and really show how much power you can milk for a game as &quot;simple&quot; as Pong.\n\nSound\nThe sound engineers breathed a bit of life into the paddles by giving them a bit of character. They giggle and laugh like little elves Ã‚Â¿ it's a bit silly, but I can't imagine this game without that tiny bit of style. Most of the music is mellow, electronic keyboard pieces. Nothing to run out and buy a soundtrack for (if they had one), but it suits the game well. The &quot;thocking&quot; of the ball hitting the paddle is in stereo, so if you've got an appropriate sound setup, you'll hear the ball going back and forth through your room. It's a nifty effect\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:53f9a069141e9460b7cc5edcd45d9c685158a014","amp;dn":"Pong%3A+The+Next+Level+%28PSX%29+%28PS1%29+%28Use+ePSXe%29+%28Pong%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53f9a069141e9460b7cc5edcd45d9c685158a014","infoHashBuffer":{"type":"Buffer","data":[83,249,160,105,20,30,148,96,183,204,94,220,212,93,156,104,81,88,160,20]},"announce":[],"urlList":[]}}