{"title":"Yung Berg feat. Junior - Sexy Lady (2nafish)","uid":6017822,"size":131221508,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5420d711502c306bde5912eebd960d7be056abe0&amp;dn=Yung+Berg+feat.+Junior+-+Sexy+Lady+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1291706245,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles and some lyrics are censored.\n\n\n&quot;Sexy Lady&quot; is the debut single by rapper Yung Berg and appears on his Almost Famous EP and the full-length Look What You Made Me. It features Junior. It samples The Musical Stage Company's version of Diamonds Are Forever, and the chorus is an interpolation of Millie Jackson's &quot;Slow Tongue&quot;. The single debuted on the Billboard Hot 100 at number 99 and peaked at number 18. The music video includes cameos from actress Drew Sidora and singer Kat DeLuna. At the end of the video, Yung Berg's song &quot;Where Do We Go&quot; can also be heard.\n\nLook What You Made Me is the full-length debut album of American rapper Yung Berg, which was released on August 12, 2008. Despite its release, Yung Berg criticized rapper Flo Rida by quoting &quot;My Album got pushed back like Flo Rida's hairline&quot;, However, Berg later then apologized. The album features guest appearances from Eve, Trey Songz, Lloyd, Amerie, Twista and Collie Buddz, among others. Also, it has the single &quot;Sexy Can I&quot; by Ray J crediting himself as a guest artist.\n\nThe first single from the album was &quot;Sexy Lady&quot; featuring Junior; peaking at #18 on the Billboard Hot 100 it was included on the prequel EP, Almost Famous (subtitled The Sexy Lady EP). Despite the single being released over sixteen months before the album, Berg confirmed in an interview with fellow Chicago native and radio personality DJ Z that it would still be included on the album.\n\nThe single &quot;Sexy Can I&quot; was included in the album even though it also is the first single from Ray J's fourth studio album All I Feel (released April 8, 2008), it peaked at #3 on the Hot 100, was certified 3x Platinum by the RIAA, and is the most successful single for both Ray J and Yung Berg to date.\n\nSoon afterwards, Berg released a promotional street single, entitled &quot;Do That There.&quot; Produced by fellow Chicagoan Xcel (known for producing Shawnna's &quot;Gettin' Some&quot;), it featured a sample from Dude 'n Nem's single &quot;Watch My Feet&quot; and had them credited as featured artists. It is Yung Berg's least successful single to date, only peaking at #125 on the Hot R&amp;B/Hip-Hop Songs chart.\n\nThe third official single came on May 13, 2008, with the release of &quot;The Business.&quot; Assisted by his first Yung Boss Music Group signee and former Candy Hill lead singer Casha, it has recently entered the Hot 100, charting at #33 so far.\n\nChristian Ward (born September 9, 1985), better known by his stage name Yung Berg, is an American rapper from Chicago. His first single was &quot;Sexy Lady&quot; which features R&amp;B singer Junior. Yung Berg had been previously signed to DMX's Bloodline Records as Ice Berg. He is featured on the Exit Wounds soundtrack. His debut album Look What You Made Me was released in 2008.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5420d711502c306bde5912eebd960d7be056abe0","amp;dn":"Yung+Berg+feat.+Junior+-+Sexy+Lady+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5420d711502c306bde5912eebd960d7be056abe0","infoHashBuffer":{"type":"Buffer","data":[84,32,215,17,80,44,48,107,222,89,18,238,189,150,13,123,224,86,171,224]},"announce":[],"urlList":[]}}