{"title":"The Last Song DVDRIP ~PINKHONEY0269~","uid":5992047,"size":1094447560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:54e3cf1aae3e0b38eb17b60d4f550a90bf87bf20&amp;dn=The+Last+Song+DVDRIP+%7EPINKHONEY0269%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Pinkhoney0269","files":1,"time":1290919253,"description":"Run Time: 107 Minutes\n\nStarring:\n\nMiley Cyrus\nLiam Hemsworth\nGreg Kinnear\n\nPLOT:\n\nAt seventeen, Veronica &quot;Ronnie&quot; Miller (Miley Cyrus) remains as rebellious as she was the day after her parents' ugly divorce and father's subsequent relocation to Georgia three years ago. Once a classical piano child prodigy under the tutelage of her father, Steve Miller (Greg Kinnear), Ronnie now rejects the instrument and has not spoken to her father since he left. While Juilliard School has been interested in her since she was young, Ronnie refuses to attend.\n\nNow, Steve is given the chance to reconnect with his estranged daughter when her mother, Kim (Kelly Preston) sends the rebellious teen and her younger brother, Jonah (Bobby Coleman), to spend the summer with him. Steve, a former Juilliard School professor and concert pianist, now lives a quiet life in Tybee Island, the small Georgia beach town where he grew up, working on a stained glass window for the local church to replace the one the church lost in a fire.\n\nUpon arrival, Ronnie is miserable, hostile and defensive toward all those around her, including handsome, popular Will Blakelee (Liam Hemsworth) whose introduction is crashing into her during a volleyball match, spilling Ronnie's strawberry shake on her. She shrugs him off and meets Galadriel &quot;Blaze&quot;, an outcast who lives with her boyfriend Marcus. While at a beach campfire, Marcus hits on Ronnie and Blaze mistakes this for Ronnie flirting with him. Angered by this, Blaze sets Ronnie up by placing a bracelet in Ronnie's bag. When Ronnie walks out she is promptly arrested, reminding her of an incident back at home. Later on, Ronnie discovers a Loggerhead Sea Turtle nest at the beach by her house and while protecting it, she meets Will again on his volunteer work for the aquarium. After a night of staying up to defend the turtles with Will, she discovers he is deeper than she believed.\n\nAs Ronnie falls in love with Will, she also manages to form a better, stronger bond with her father. As their relationship deepens, her father collapses with a coughing fit one day. Ronnie immediately takes Steve to the hospital to realize that he had been diagnosed with cancer long before her summer visit. She decides to start spending more time with her father since he is not likely to live much longer. Around the same time, Ronnie and Will get into a fight. With Will leaving for college, there is no time to patch things up.\n\nSteve has been working on a piece of music for quite a while. Fall comes and Jonah has to return to New York for the school year but Ronnie stays behind to take care of her father. Leading a slow life she tries to fill the three years of ignoring her father into a couple months. She continues working on his piece of music (titled &quot;For Ronnie&quot;), finishing what her father could not (because of his hands). When she finally plays the last chord, she realizes that her father died listening to her play, and is heartbroken.\n\nAt his funeral she stands up to make a speech but declares that none of the speeches she wrote would ever be able to show how wonderful her father was. Instead, she played the piece of music that her father had been writing but never finished.\n\nAfter the funeral, while Ronnie is talking to the attendants, she runs into Will. The two make up, and at the end of the movie Ronnie tells Will that she will be attending Juilliard for the second semester. Will surprises Ronnie by revealing that he will be transferring to Columbia in order to be with the girl he loves.\n\n","torrent":{"xt":"urn:btih:54e3cf1aae3e0b38eb17b60d4f550a90bf87bf20","amp;dn":"The+Last+Song+DVDRIP+%7EPINKHONEY0269%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54e3cf1aae3e0b38eb17b60d4f550a90bf87bf20","infoHashBuffer":{"type":"Buffer","data":[84,227,207,26,174,62,11,56,235,23,182,13,79,85,10,144,191,135,191,32]},"announce":[],"urlList":[]}}