{"title":"FTV Girls - Bella &amp; Sarah - Going Hardcore","uid":6022991,"size":285024985,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:55efe7a55c8495ee93fe5dc63503f6d2bae2929e&amp;dn=FTV+Girls+-+Bella+%26+Sarah+-+Going+Hardcore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"phatwarez","files":-1,"time":1291859410,"description":"FTV Girls - Bella &amp; Sarah - Going Hardcore\n\t\t\t\nSarah:  I almost think I'm falling in love with this girl.  Obviously, she's gorgeous, but its a lot more than that, its how soft and passionate she is, and how sweet she is after hanging out with her for the day.  You know, when I first met her at a convention, I thought she was stuck-up, but I guess that's the impression I got when I see a tall, model-like girl all dressed up classy.  In reality, she's a very down-to-earth girl, like me hehe!  We dressed each other up in lingerie and started kissing again, but we've been kissing a lot off camera.  This strap-on thing will be interesting to try out.  For the video, the photographer asked me to give it a blowjob, and it really does look hot on camera!  Then again, my blowjobs are always hot hehe.  Now off to bed!\nBella:  A few hours later, after dinner, we were ready to go again, all romantically inclined to do anything, and make sure we give each other one more orgasm for the night.  Okay, so I am the big girl, so I put her on the table and dress her up like a little girl, but she gets to dress me up too, in my pink nightie.  If you've seen my other videos, you know how much I love nighties, they're soft, loose, and very comfortable.  They also make my body look good.  Since I met Sarah this morning, I've got to say I really want to fuck her with a strap-on.  That's the penis envy in me I guess.  I wanted her to suck my 'cock', and I want to penetrate her with it.  Just the idea can turn me on enough to orgasm.\n\nScreens (also in torrent):\n &lt;a href=&quot;\nhttp://kopimg.com/images/kopi_742_Bella_Sarah_Going_Hardco.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kopimg.com/images/kopi_742_Bella_Sarah_Going_Hardco.jpg&lt;/a&gt;\n\nFile Size ------- 271mb\nLength ---------- 35:23\nResolution ------ 640x480\nContainer ------- mkv\nVideo Codec ----- x264\nAudio Codec ----- mp3\nFrame Rate ------ 30\n\np h a t w a r e z . t k\nThanks to (anonymous) for the generous seedbox donation.","torrent":{"xt":"urn:btih:55efe7a55c8495ee93fe5dc63503f6d2bae2929e","amp;dn":"FTV+Girls+-+Bella+%26+Sarah+-+Going+Hardcore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55efe7a55c8495ee93fe5dc63503f6d2bae2929e","infoHashBuffer":{"type":"Buffer","data":[85,239,231,165,92,132,149,238,147,254,93,198,53,3,246,210,186,226,146,158]},"announce":[],"urlList":[]}}