{"title":"Reign of Assassins 2010 BRRip DVD~sailo1","uid":5990560,"size":4949293056,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:572534eded29510010f6cbd6691ba14f23b1116d&amp;dn=Reign+of+Assassins+2010+BRRip+DVD%7Esailo1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sailo","files":-1,"time":1290875059,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt1460743/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt1460743/&lt;/a&gt;\n\n7.0/10 (654 votes) \n\n\nMARTIAL ARTs, WIRE fu\n &lt;a href=&quot;\nhttp://www.yesasia.com/global/reign-of-assassins-dvd-hong-kong-version/1023747244-0-0-0-en/info.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.yesasia.com/global/reign-of-assassins-dvd-hong-kong-version/1023747244-0-0-0-en/info.html&lt;/a&gt;\n\ntrailer : google -- &gt;&gt; Reign Of Assassins \n\n\n\nJohn Woo changes the face of wuxia cinema with his signature theme of heroism and stylish violence in the costume martial arts masterpiece Reign Of Assassins! Trading bullets for blades, Woo shares co-director credit with talented Taiwan writer-director Su Chao Pin (Silk, Better Than Sex), who brings a refreshing perspective to the genre and fills the captivating storyline with a touching emotional core and clever plot twists. Unlike Woo's past films where brotherhood and redemption are common themes, Reign of Assassins follows a swordswoman who attempts to leave the jiang hu behind to find freedom and love. Veteran action director Stephen Tung (Bodyguards and Assassins) helps realize Su and Woo's vision by choreographing the wire-assisted swordplay action to exhilarating effect.\n\nOne of the biggest draws of this ambitious production lies in its glamorous all-star cast. Action queen Michelle Yeoh (Crouching Tiger, Hidden Dragon) toplines the film alongside popular Korean actor Jung Woo Sung, who is no stranger to Chinese films having starred in Musa the Warrior, Daisy, and Season of Good Rain. More starpower comes courtesy of Mainland thespian Wang Xueqi, Hong Kong actor Shawn Yue, Taiwan actors Kelly Lin, Leon Dai, and Barbie Hsu. Pace Wu, Jiang Yiyan, Guo Xiaodong, and Paw Hee Ching are also among the eye-catching ensemble, with John Woo's daughter Angeles Woo making her acting debut in a supporting role.\n\nEvery clan in the martial world wants the sacred remains of the holy monk Dharma, which is believed to hold extraordinary powers. Upon learning its whereabouts, the Wheel King  - leader of the assassins organization &quot;Black Stone&quot; - sends his elite killers to bring it back. Drizzle  gets away with the coveted relics and is forced to run from her relentless pursuers, including fellow assassins Lei Bin , the Magician (Leon Dai), and Turquoise (Barbie Hsu). Tired of her life of killing, Drizzle is determined to quit the martial world, and after altering her appearance, she hides in a small town under the name Zeng Jing . There, she falls in love with innocent young messenger Jiang Ah Sheng and begins a peaceful married life with him, but her secret dark past eventually catches up with her... \n\n\n\nAudio : DD5.1\n\ncantonese, mandarin\n\n\n\nsub : english, chinese, vietnamesse\n\n\nntsc\t\t\n\n\nRegular DVDR converted from a BluRayRip , playable on a standalone dvd player\n\n\n\n\n","torrent":{"xt":"urn:btih:572534eded29510010f6cbd6691ba14f23b1116d","amp;dn":"Reign+of+Assassins+2010+BRRip+DVD%7Esailo1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"572534eded29510010f6cbd6691ba14f23b1116d","infoHashBuffer":{"type":"Buffer","data":[87,37,52,237,237,41,81,0,16,246,203,214,105,27,161,79,35,177,17,109]},"announce":[],"urlList":[]}}