{"title":"Pale Moon 3.6.13 windows optimized mozilla firefox browser","uid":6060457,"size":8355950,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:57a68d92ae1908a8a20792828aef0247a0d07212&amp;dn=Pale+Moon+3.6.13+windows+optimized+mozilla+firefox+browser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jeffapotimus","files":1,"time":1293098915,"description":"Windows-only firefox build. 100% mozilla code, but runs significantly faster on windows PCs. A tool is also available to migrate your firefox profile seamlessly. I'm also posting a portable version, check my torrents for these other downloads.\n\nFrom the website:\n\n=================================================================================\n\n\nWhy settle for a basic build of your Firefox browser on Windows Operating Systems when you can have one that performs 25% faster? Mozilla does not provide optimized browser packages for Windows, while many Linux (&quot;from scratch&quot;) users get the advantage of a browser built specifically for their system. That needs to change! So, here is the Pale Moon project: Custom-built and optimized Firefox browsers for Windows Operating Systems. Make sure to get the most speed out of your browser!\n\nOf course, getting a faster browser is not just about optimizing the compilation process (building a program from its source code), but also about carefully choosing features and how to choose the best setup. This means that this browser, however extremely close to Firefox, does not have all the functions that Firefox has. A few, carefully selected, features have been disabled that are not in high demand, and that do not interfere with the way web pages are displayed or function; all to maximize speed and efficiency of the browser.\n\nMain features:\n\n    * Highly optimized for current processors\n    * 100% Firefox sourced: As safe as the browser that has seen years of\n      development.\n    * Uses slightly less memory because of disabled redundant and optional code\n    * Significant speed increases for page drawing and script processing\n    * Support for SVG and Canvas, downloadable fonts, WOFF and some HTML5\n    * Support for Firefox extensions, themes and personas\n    * Support for OOPP (Out-of-process plugin execution)\n    * Able to use existing Firefox profiles, bookmarks and settings with this \n      migration tool\n\n\t\nSystem Requirements:\n\n    * Windows 2000/XP/2003/Vista/Seven, 32-bit or 64-bit (64-bit O.S.es are not \n      natively supported, but the browser will run fine on them)\n    * A modern processor with SSE2 support like a Pentium IV or Athlon 64 or later \n      (see list of supported processors) Standard Pale Moon will NOT run on Athlon \n      XP processors! Please GO HERE if you are running on an Athlon XP or Athlon \n      MP processor machine.\n    * 64 MB of RAM (128 MB or more recommended)\n    * At least 50 MB of free (uncompressed) disk space\n\n &lt;a href=&quot;\nhttp://www.palemoon.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.palemoon.org&lt;/a&gt;","torrent":{"xt":"urn:btih:57a68d92ae1908a8a20792828aef0247a0d07212","amp;dn":"Pale+Moon+3.6.13+windows+optimized+mozilla+firefox+browser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57a68d92ae1908a8a20792828aef0247a0d07212","infoHashBuffer":{"type":"Buffer","data":[87,166,141,146,174,25,8,168,162,7,146,130,138,239,2,71,160,208,114,18]},"announce":[],"urlList":[]}}