{"title":"Ashampoo Photo Commander 9.0.0 [Portable] ","uid":6211327,"size":160485567,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5881255d2c798c1d68d537056bafdca837e506ea&amp;dn=Ashampoo+Photo+Commander+9.0.0+%5BPortable%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chusca","files":5,"time":1298996229,"description":"Ashampoo Photo Commander 9 ofrece una mezcla perfecta de funciones para administrar, editar, presentar y optimizar sus fotos digitales. El programa le proporciona una administraciÃƒÂ³n rÃƒÂ¡pida y sencilla de su colecciÃƒÂ³n de fotos incluyendo opciones para crear grupos, etiquetas de imagen y ponerlas juntas en ÃƒÂ¡lbumes virtuales. Asigne, por ejemplo, el nombre del destino de su ÃƒÂºltimo viaje (etiquetar) a las fotos de las vacaciones. De esta forma podrÃƒÂ¡ encontrar mÃƒÂ¡s tarde todas las fotos que tomÃƒÂ³ en el destino muy rÃƒÂ¡pidamente. Sea creativo y edite sus fotos digitales de acuerdo con sus gustos. Optimize las fotos con un solo clic, elimine los ojos rojos o use diferentes efectos, como cambios de color, al editar \nsu imagen. Convierta sus imagenes mas bonitas en pinturas al ÃƒÂ³leo, cree un calendario con sus propias fotos o una invitaciÃƒÂ³n personal con una divertida foto de su ÃƒÂºltima fiesta. Naturalmente, la versiÃƒÂ³n 9 de Ashampoo Photo Commander ofrece muchas funciones nuevas y mejoras. Entre otras funciones estÃƒÂ¡ el nuevo modo de visiÃƒÂ³n dual para comparar una foto original con la foto que se estÃƒÂ¡ editando. \nAdicionalmente, las herramientas de optimizaciÃƒÂ³n y las funciones de video se han mejorado, se han incorporado nuevos efectos y mucho mÃƒÂ¡s. Cuando trabaje con sus fotos digitales no querra hacerlo sin Ashampoo Photo Commander 9. \n-Idioma: InglÃƒÂ©s\n\n\n","torrent":{"xt":"urn:btih:5881255d2c798c1d68d537056bafdca837e506ea","amp;dn":"Ashampoo+Photo+Commander+9.0.0+%5BPortable%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5881255d2c798c1d68d537056bafdca837e506ea","infoHashBuffer":{"type":"Buffer","data":[88,129,37,93,44,121,140,29,104,213,55,5,107,175,220,168,55,229,6,234]},"announce":[],"urlList":[]}}