{"title":"Sharp World Clock 4.84 [Portable] ","uid":6014564,"size":5888308,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:58bf21b0160c7cf7258bd75a0a4ac05c7d5abeb4&amp;dn=Sharp+World+Clock+4.84+%5BPortable%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chusca","files":3,"time":1291585568,"description":"Sharp World Clock es, probablemente, la aplicacion mas hermosa que puede haber para mostrar el tiempo en Windows.\nNo es cualquier aplicacion que muestra el tiempo, sino que puede ayudar a mejorar los conocimientos geograficos y es muy divertida e intuitiva.\nAdmite la colocacion de cualquier numero de relojes en la pantalla y de posicionarlos de cualquier manera, ya sea horizontal o vertical.\nAdemas, tiene estilos indefinidos, puede mostrar el reloj analogico y digital y tiene colores o imagenes de fondo.\nAsimismo, muestra un mapa mundial con las zonas horarias, con la sombra de la tierra mostrando en que parte del mundo se pone el sol y ademas tambien ofrece la posibilidad de establecer un sonido acustico cada vez que llega a hora en punta.\nTambien cabe destacar que puede calcular las fases de la luna, el momento del ocaso y del amanecer sin necesidad de tener conexion a internet e incluso puede mostrar la bandera de los paises como piel del reloj.\nOtra caracteristica es que puede leer noticias RSS y Atom con funciones de busqueda, puede representar de manera artificial el cielo nocturno y diurno para cualquier reloj y ofrece modo de minimizacion en la bandeja del sistema o siempre activo.\nEn resumen, es una potente aplicacion que ofrece mucho mas de lo necesario para personalizar lo maximo el reloj de nuestro sistema.\n-Idioma: InglÃƒÂ©s\n\n\n","torrent":{"xt":"urn:btih:58bf21b0160c7cf7258bd75a0a4ac05c7d5abeb4","amp;dn":"Sharp+World+Clock+4.84+%5BPortable%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58bf21b0160c7cf7258bd75a0a4ac05c7d5abeb4","infoHashBuffer":{"type":"Buffer","data":[88,191,33,176,22,12,124,247,37,139,215,90,10,74,192,92,125,90,190,180]},"announce":[],"urlList":[]}}