{"title":"Walking With the Radio On-Automatics 1978","uid":5949028,"size":87253563,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:59042714a0040d349078f2b5d1508e83c8e9b3fb&amp;dn=Walking+With+the+Radio+On-Automatics+1978&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"livebeated","files":32,"time":1289467351,"description":"The Automatics, fronted by English born Dave Philp, are best known for their Punk/Powerpop standard 'When the tanks roll over Poland again', (released on Island Records in 1978) which became one of the first Number Ones in the newly introduced UK Punk/New Wave charts .\nAn album entitled 'Walking with the radio on' was recorded in London at the same time under the guidance of upcoming producer Steve Lillywhite, but shelved by Island Records as they focused their attention and producer on an upcoming outfit calling themselves 'U2'. The band disbanded shortly after.\n\nDrummer Ricky 'Rocket' Goldstein left to join Sham 69 and played on Sham`s later hits. Guitarist Wally Hacon went off to work with Wreckless Eric, for whom he wrote the single 'Broken Doll' (later covered by Sir Cliff Richard), whilst Bobby Collins had a spell as bass player in Holly and The Italians.\n\nThe 'Walking with the radio on' album was eventually given a release in Japan in 2000 by Base Records (and a later UK release in 2003 by Angel Air Records).\n\nWith renewed vigour, lead vocalist and songwriter Dave Philp re-assembled The Automatics in 2000 and recorded the Automatics &quot;2&quot; album with top L.A. producer Jim Wirt. &quot;2&quot; was released in Japan by Base Records in 2001 and promoted by a series of Japanese dates. Another album of &quot;Rarities&quot; from their early days was issued by Base Records the same year.\nIn 2002, Swedish label Diapazam Records coupled together 2 early tracks and released the 7&quot; vinyl single &quot;Wild One&quot;/ &quot;Like a moth into a flame&quot;.\n\n2003 saw the band release the 'Forty Virgins In The Afterlife' album. The album was released on Base Records in Japan and also had a release in Germany on Trash 2001 Records. It had the added bonus of a guest appearance from the Sex Pistols` Steve Jones, who played guitar on the tracks 'Trash' and 'Peace on Earth', and was supported by a Japanese tour in 2004.\nDave Philp has been vigorously writing and recording over the last few years and has just launched the brand new Automatics album 'Britannia'.... a more musically varied album than the regular Automatics sound with a distinct British theme running through the songs. Guests on the 'Britannia' album include Steve Jones (Sex Pistols), Ian McCallum (Stiff Little Fingers), Mick Rossi (Slaughter &amp; the dogs), Michael Des Barres (Silverhead, Detective, Power station), Jim Wirt and others.\n Former BBC Radio One deejay Mike Read nominated The Automatics` &quot;Britannia&quot; album his 'album of the week' during the first week of September 2006 on his Big L Radio (formerly Radio London) show and  &quot;England Expects&quot; entered the 'Big L Fab 40' charts at # 23 on 3rd Sept. 2006, eventually peaking at # 19. ","torrent":{"xt":"urn:btih:59042714a0040d349078f2b5d1508e83c8e9b3fb","amp;dn":"Walking+With+the+Radio+On-Automatics+1978","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59042714a0040d349078f2b5d1508e83c8e9b3fb","infoHashBuffer":{"type":"Buffer","data":[89,4,39,20,160,4,13,52,144,120,242,181,209,80,142,131,200,233,179,251]},"announce":[],"urlList":[]}}