{"title":"Chopper 2 v.1.2","uid":6098099,"size":159538582,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:59acf4b16b3573a8ba74218a0c96e1ee045887d6&amp;dn=Chopper+2+v.1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"qwersd","files":2,"time":1294856314,"description":"Chopper 2 is the highly anticipated sequel to the best selling Mac and App Store classic Chopper.\n\nChopper 2 features 36 action packed missions over 12 unique and beautiful locations. It features a completely re-written 3D game engine, all new enemies, weapons, graphics, and missions, while still retaining the classic side scrolling game-play.\n\nEscort a convoy of vehicles across the desert, or defend a train from enemies emerging from underground mines. Use your laser sight to line up enemies emerging from stairwells in the city. Chase down lines of enemy tanks and choppers while avoiding heat seeking missiles, gunfire and bird strike. Help your allies defend against advancing armies, and rescue stranded civilians, all while trying to complete your mission as fast as possible for the highest score.\n\nChopper 2 for Mac uses high resolution graphics and effects built for display right up to 2560x1600 pixels. It uses keyboard and mouse for control, and features a 17 minute long original soundtrack.\n\nIf you also have an iPhone or iPod Touch, you can use the fantastic remote control feature to wirelessly control the Mac version with Chopper 2 on an iPhone or iPod Touch over WiFi.","torrent":{"xt":"urn:btih:59acf4b16b3573a8ba74218a0c96e1ee045887d6","amp;dn":"Chopper+2+v.1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59acf4b16b3573a8ba74218a0c96e1ee045887d6","infoHashBuffer":{"type":"Buffer","data":[89,172,244,177,107,53,115,168,186,116,33,138,12,150,225,238,4,88,135,214]},"announce":[],"urlList":[]}}