{"title":"Disturbed - The Animal (mp4-2nafish)1080p","uid":6049364,"size":158725976,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5a735b6e558c99e7dacbc0efa430adfa239bf4be&amp;dn=Disturbed+-+The+Animal+%28mp4-2nafish%291080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292669762,"description":"File Info:\n\nFormat            : MPEG-4\nLength            : 151 MiB\n\nVideo #0          : AVC at 4 831 Kbps\nAspect            : 1920 x 1080 (1.778) at 23.977 fps\n\nAudio #0          : AAC at 127 Kbps\nInfos             : 2 channels, 44.1 KHz\n\n\n\nThis video has no logos or titles.\n\n\n&quot;The Animal&quot; is a song by American rock band Disturbed, and the third single from their fifth studio album, Asylum. It was released as a single on October 4, 2010.\n\nA music video for &quot;The Animal&quot; premiered on November 16, 2010 on MTV2. The music video was directed by Charlie Terrell. It was the first music video off the &quot;Asylum&quot; album to feature all the band members, as &quot;Another Way to Die&quot; didn't feature any of them and &quot;Asylum&quot; only features lead singer David Draiman.\n\nAccording to vocalist David Draiman, &quot;The Animal&quot; is inspired by movies like Underworld and The Wolfman. It is about somebody who transforms into a werewolf under the light of the full moon.\n\nAsylum is the fifth studio album by American heavy metal band Disturbed. Taking inspiration from other aspects of lead singer David Draiman's life, Asylum is meant to take a fresh direction in the band's music career, while remaining consistent with the band's previous albums. The album was released on August 31, 2010 in the United States through Reprise Records. A tour in support of the album, titled the Asylum Tour, started in late August 2010.\n\nAsylum debuted at number-one on the Billboard 200 chart with sales of approximately 179,000 according to Nielsen Soundscan. This is the fourth consecutive number-one album in the U.S. for Disturbed. The other two bands to ever accomplish this feat are metal band Metallica and rock/jam band Dave Matthews Band.\n\nDisturbed is an American rock band from Chicago, Illinois, formed on October 24, 1995 when musicians Dan Donegan, Steve &quot;Fuzz&quot; Kmak, and Mike Wengren hired David Draiman as their singer. Since the band's formation, they have sold over 11 million albums worldwide, making them one of the largest grossing rock bands in recent years. The band has released five studio albums, four of which have consecutively debuted at number-one on the Billboard 200.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5a735b6e558c99e7dacbc0efa430adfa239bf4be","amp;dn":"Disturbed+-+The+Animal+%28mp4-2nafish%291080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a735b6e558c99e7dacbc0efa430adfa239bf4be","infoHashBuffer":{"type":"Buffer","data":[90,115,91,110,85,140,153,231,218,203,192,239,164,48,173,250,35,155,244,190]},"announce":[],"urlList":[]}}