{"title":"Ursula 1000 - Electrik Boogie (2nafish)","uid":6074696,"size":140969988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5ba878ecb91e0c0e08b9dc00da7a3a521c45c34f&amp;dn=Ursula+1000+-+Electrik+Boogie+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1293777150,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nHere Comes Tomorrow is a 2006 album by Ursula 1000.\n\nAlex Gimeno is a DJ best known for Ursula 1000, a wide-ranging musical project including lounge, breakbeat, glam and cha cha.\n\nGimeno was born in Brooklyn, New York. During his childhood, he and his family moved to Miami Beach where his father, a member of the Spanish orchestra, Los Chavales De Espana, had an extended residency. He moved back to Brooklyn in the late 1990s.\n\nGimeno entered the music business around 1990. He was a DJ on Miami Beach for nearly a decade, and early in his career, he played drums for a band called 23. Other members of 23 later formed the band The Postmarks. He also had his own show on the pirate radio station WOMB.\n\nAfter extensive work as a DJ, he sent a tape of original work to Washington, D.C.-based record label ESL Music, which was immediately interested in signing him. On that label, Gimeno has released a number of albums containing mixes of an eclectic selection of bands, ranging from The Bees to Kraak &amp; Smaak; Gimeno knows many of the artists whose work he uses in his mixes personally. Aside from mixing the music of others, he also creates his own original works such as the studio albums Kinda' Kinky and Here Comes Tomorrow.\n\nThe name Ursula 1000 is a reference to Ursula Andress, famous Swiss actress who played Bond girl in first Bond movie Dr. No. Currently, he travels the world as a dj and has monthly residencies in New York. His works have been used in episodes of Sex And The City, Grey's Anatomy, Desperate Housewives and ad campaigns for Samsung, AT&amp;T, Adidas, and La Vie Grand Marnier.\n\nIn his youth, Gimeno was exposed to 50s and 60s exotica, world music, bossa nova and mambo his parents listened to which deeply influenced him. His own personal tastes were deep in new wave, post punk, glam rock, hip hop and acid house. He began collecting records as a teenager and in his own words &quot;never stopped&quot;.By 2005, he owned over 20,000 records, filling up an entire room in his apartment. His father worked as a musician and was a member of a flamenco band called Los Chavales de EspaÃƒÂ±a.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5ba878ecb91e0c0e08b9dc00da7a3a521c45c34f","amp;dn":"Ursula+1000+-+Electrik+Boogie+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ba878ecb91e0c0e08b9dc00da7a3a521c45c34f","infoHashBuffer":{"type":"Buffer","data":[91,168,120,236,185,30,12,14,8,185,220,0,218,122,58,82,28,69,195,79]},"announce":[],"urlList":[]}}