{"title":"The complete storys of Sherlock Homes Volume 2","uid":5951146,"size":399723927,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5e8adc22f5168510df011e48e1f864fa455a61d2&amp;dn=The+complete+storys+of+Sherlock+Homes+Volume+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"audiobookman","files":5,"time":1289533846,"description":"Narrated by Charlton Griffin \nUnabridged\n\n\nPublisher's Summary\n\nVolume two in this series consists of one novel, The Hound of the Baskervilles, and two collections of short stories, which include &quot;Memoirs of Sherlock Holmes&quot; and &quot;The Return of Sherlock Holmes&quot; (a total of 23 stories). These creations by Doyle represent the finest work of his Holmes series, and certainly the most famous. They are reproduced here (and in all volumes) in the order in which they were first published.\n\nFirst appearing in print in 1890, the character of Sherlock Holmes has now become synonymous worldwide with the concept of a super sleuth. His creator, Conan Doyle, imbued his detective hero with intellectual power, acute observational abilities, a penchant for deductive reasoning and a highly educated use of forensic skills. Indeed, Doyle created the first fictional private detective who used what we now recognize as modern scientific investigative techniques. Doyle ended up writing four novels and 56 short stories featuring Holmes and his companion, Dr. Watson. All but four are told in the first person by Watson, two by Holmes, and two are written in the third person. Together, this series of beautifully written Victorian literature has sold more copies than any other books in the English language, with the exceptions of the Bible and Shakespeare.","torrent":{"xt":"urn:btih:5e8adc22f5168510df011e48e1f864fa455a61d2","amp;dn":"The+complete+storys+of+Sherlock+Homes+Volume+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e8adc22f5168510df011e48e1f864fa455a61d2","infoHashBuffer":{"type":"Buffer","data":[94,138,220,34,245,22,133,16,223,1,30,72,225,248,100,250,69,90,97,210]},"announce":[],"urlList":[]}}