{"title":"Vision [dvdrip][spanish][AC35.1]","uid":6058890,"size":1469276160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5ec70d8a5ca4de40debac11fecd0857fb9732f79&amp;dn=Vision+%5Bdvdrip%5D%5Bspanish%5D%5BAC35.1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"furtaperas","files":-1,"time":1293028484,"description":"TÃƒÂ­tulo: VisiÃƒÂ³n\nTÃƒÂ­tulo original: Vision - Aus Dem Leben Der Hildegard Von Bingen\nPaÃƒÂ­s: Alemania, Francia\nEstreno en USA:\nEstreno en EspaÃƒÂ±a: 27/08/2010\nProductora: Clasart Filmproduktion, Celluloid Dreams, ARD / Degeto Film GmbH\nDirector: Margarethe von Trotta\nGuiÃƒÂ³n: Margarethe von Trotta\nReparto: Barbara Sukowa, Heino Ferch, Hannah Herzsprung, Alexander Held, Lena Stolze, Sunnyi Melles, Paula Kalenberg, Mareile Blendl, Stella Holzapfel, Annemarie Duringer, Devid Striesow\nCalificaciÃƒÂ³n: No recomendada para menores de 7 aÃƒÂ±o\n\n\nHildegard, es una niÃƒÂ±a, nacida en el seno de una familia noble alemana. A los ocho aÃƒÂ±os de edad, sus parientes le dejan en un Monasterio benedictino. AllÃƒÂ­, su mentora, Jutta, le instruye en las artes de la medicina herbaria, la lectura y la caligrafÃƒÂ­a, materias en las que pronto destacarÃƒÂ¡. Con la muerte de Jutta, Hildegard se horroriza al ver los signos de la auto-flagelaciÃƒÂ³n en el cuerpo de su maestra y se promete a sÃƒÂ­ misma cambiar las formas y regla de la orden. Hildegard es elegida abadesa del convento que le vio crecer y gracias a su sutileza, inteligencia y diplomacia empieza a cambiar los reglamentos internos. La religiosa, desde niÃƒÂ±a siempre ha tenido visiones que ha ido guardando en su memoria. Algunas de estas percepciones mÃƒÂ­sticas son revelaciones de Dios, y ella decide contÃƒÂ¡rselos a su superior en el monasterio, sin miedo a las reacciones de escepticismo y las acusaciones de herejÃƒÂ­a que eran propias en la ÃƒÂ©poca. El Papa desde un principio le cree y le concede su apoyo permitiÃƒÂ©ndole publicar por escrito sus visiones. A partir de este momento, la vida de Hildegard darÃƒÂ¡ nuevo giro. Se le permite construir su propio convento y separarse de los monjes benedictinos e inventa un revolucionario y humanista enfoque de la devociÃƒÂ³n cristiana. Compositora, cientÃƒÂ­fica, mÃƒÂ©dico, escritora, poetisa, mÃƒÂ­stica, filÃƒÂ³sofa, polÃƒÂ­tica, activista ecolÃƒÂ³gica... Una mujer adelantada a su tiempo. Las obras musicales, literarias y filosÃƒÂ³ficas de Hildegard continÃƒÂºan siendo en la actuakidad aÃƒÂºn muy valoradas y su influencia en la medicina general es cada vez mayor. Fue la primera compositor cuya vida conocemos, y tambiÃƒÂ©n la primera mujer en escribir sobre la sexualidad femenina. Siglos mÃƒÂ¡s tarde, genios como Dante y Leonardo da Vinci se inspiraron en sus obras. Hildegarda de Bingen fue uno de los mÃƒÂ¡s importantes lÃƒÂ­deres femeninos con una gran visiÃƒÂ³n de futuro, y la responsable de traer a la oscura Europa medieval, la luz de la era moderna de la ciencia.\n","torrent":{"xt":"urn:btih:5ec70d8a5ca4de40debac11fecd0857fb9732f79","amp;dn":"Vision+%5Bdvdrip%5D%5Bspanish%5D%5BAC35.1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ec70d8a5ca4de40debac11fecd0857fb9732f79","infoHashBuffer":{"type":"Buffer","data":[94,199,13,138,92,164,222,64,222,186,193,31,236,208,133,127,185,115,47,121]},"announce":[],"urlList":[]}}