{"title":"Delphic - Doubt (2nafish)","uid":5943636,"size":150994948,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5fa852f89a213f6d33e002842f45f37758c73cb3&amp;dn=Delphic+-+Doubt+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1289271793,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nDoubt is a 2010 single by Alternative Dance band Delphic, and is the second track on their debut album Acolyte. It reached #79 in the UK Singles Chart.\n\nThe music video for Doubt is very heavily computer generated. It features people sitting down in a plain room, whilst several Computer-generated images move across their bodies.\n\nDoubt was released va CD, 7&quot;, 12&quot; and Digital Download. The 7&quot; version was a picture disc displaying an alternative cover image, whilst the 12&quot; was a blue remix vinyl limited to 300 copies only.\n\nDoubt was featured on the Australian iTunes Store as the Free Single of the Week from 26 January 2010.\n\nAcolyte is the debut studio album by the English alternative dance band Delphic, released by Polydor Records on 11 January 2010. It was recorded mostly in Ewan Pearson's Berlin studio. The album was released in Australia and New Zealand on January 22nd via Modularand in the United States on 29 June 2010 by Dangerbird Records.\n\n    * The band released the tracks Counterpoint and This Momentary on 13 April 2009 and 31 August 2009 respectively prior to the completion of the album. This Momentary later became available as a free Digital Download on iTunes to help promote the album.\n\n    * The first single to be released from the album was Doubt and was released on 4 January 2010, a week prior to the release of the album. The single entered the UK Singles Chart at number 79, the most successful song from the band yet.\n\n    * The second single to be released from the album was Halcyon and was released on 15 March 2010. The single reached a peak of number 143 on the UK Singles Chart marking the band's second most successful single to date.\n\n    * The third single to be released from the album was Counterpoint and acted as a re-release of the single. It was released on 31 May 2010, although it was the Tim Goldsworthy Remix that received the radio airplay. The single failed to make an impact on the UK Singles Chart.\n\nDelphic are an alternative dance band from Marple Bridge, Stockport, Greater Manchester, England. They are signed to Polydor and released the single &quot;Counterpoint&quot; in April 2009 through R&amp;S Records, produced by Ewan Pearson. They are officially a four piece band, augmented by drummer Dan Hadley.\n\nIn 2009 the band toured the UK music festival circuit, playing at T in the Park, Reading and Leeds Festivals, Creamfields and Bestival.\n\nThe single &quot;This Momentary&quot; was released on 31 August 2009 through KitsunÃƒÂ©. The music video for &quot;This Momentary&quot; has been nominated for three UK Music Video Awards, including Best Cinematography, Best Editing and Best Telecine. In November 2009 they made their first TV appearance appearing on Later... with Jools Holland playing &quot;Doubt&quot; and &quot;Halcyon&quot;.\n\nDelphic are one of the 15 shortlisted music acts for the BBC Sound of 2010. announced on Monday 7 December. As of the 6 January 2010, Delphic were placed Third on BBC Sound of 2010.\n\nAcolyte was released in Australia and New Zealand on January 22 via Modular and in the United States on June 29 via Dangerbird Records.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5fa852f89a213f6d33e002842f45f37758c73cb3","amp;dn":"Delphic+-+Doubt+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fa852f89a213f6d33e002842f45f37758c73cb3","infoHashBuffer":{"type":"Buffer","data":[95,168,82,248,154,33,63,109,51,224,2,132,47,69,243,119,88,199,60,179]},"announce":[],"urlList":[]}}