{"title":"Executive Intelligence Review - The Ugly Truth about the ADL (19","uid":6214216,"size":127002910,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:605e213b043a33af5832785bafb282c5905dd75d&amp;dn=Executive+Intelligence+Review+-+The+Ugly+Truth+about+the+ADL+%2819&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"DragonKP","files":-1,"time":1299099075,"description":"Hidden History - Jews.\n\n-------\nFriendly WARNING for Audio Quality Purists:\nIt's COMPUTER GENERATED VOICE and NOT book read by human reader!\n\nIf you don't like this fact then simply DO NOT download it and complain later.\n-------\n\nOne of the Reviews:\n\n\nDespite its reputation as a well oiled and effective public relations organization, many consider the Anti-Defamation League of B'nai B'rith (ADL) to be one of the most dangerous organizations in the world.\n\nWith a reported average annual budget of a little bit over 48-million dollars, the ADL has often used its considerable clout and connections to silence any voices who dare to stand against their lobbying tactics or tacit yet active approval of thought repression.\n\nThe ADL has repeatedly capitalized on the fact that most Americans believe what they see and hear at face value by conducting some of the most vile and reprehensible smear campaigns ever.\n\nIncreasingly, with the use of the Internet many more scandalous and shocking revelations are being made known by individuals and organizations that care more about the principles of truth than they do about being labeled.\n\nThere aren't many with in depth knowledge of the shady formation and unsavory characters involved in what is the modern representation of the ADL. The editors of the Executive Intelligence Review (EIR) have delivered a significant amount of information in a small yet compelling book titled &quot;The Ugly Truth About the ADL.&quot;\n\nThe San Francisco Spy Scandal in 1994 showed the public what many of us have already known and that is that the Anti-Defamation League of B'nai B'rith acts as a spy organization supplying intelligence data to foreign governments and delivering damaging information -- often fabricated or intentionally altered -- to enemies of those deemed to be their opponents.\n\nMore often that not, the opponents of the ADL are those who stand in defense of freedom of speech and are not afraid to criticize the ADL's tactics, information gathering stratagem, or object to what we at the TEI refer to as specious claims of anti-Semitism hurled so effectively and indiscriminately by the ADL in defense of their selfish economic or political interests.\n\nThe book begins with a swift yet tidy analysis of the above-mentioned San Francisco spy scandal in which the ADL was found to be guilty of spying on hundreds of political, human rights and religious organizations, maintaining files and dossiers on their organizational memberships and leaders.\n\nThey were also said to be infiltrating countless law enforcement agencies, bribing law enforcement officials, and obtaining classified data on private citizens.\n\nFar from being an isolated incident of impropriety, further research found the ADL to be guilty of providing information on anti-Apartheid groups to agents of the apartheid government of South Africa possibly resulting in the mysterious disappearance of many anti-Apartheid activists. The same modus operandi was used to harness Arab activism in America and abroad. Israeli authorities have repeatedly shown their propensity for violence through assassination of their enemies, and in some cases, their friends, outright either by their military, or surreptitiously through their Mossad agents and operatives.\n\nAll of the above information is presented in the foreword to the book, which should give you an indication of the EIR's thorough treatment of the subject.\n","torrent":{"xt":"urn:btih:605e213b043a33af5832785bafb282c5905dd75d","amp;dn":"Executive+Intelligence+Review+-+The+Ugly+Truth+about+the+ADL+%2819","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"605e213b043a33af5832785bafb282c5905dd75d","infoHashBuffer":{"type":"Buffer","data":[96,94,33,59,4,58,51,175,88,50,120,91,175,178,130,197,144,93,215,93]},"announce":[],"urlList":[]}}