{"title":"Democracy Now - 23 dec 2010","uid":6060972,"size":448094659,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6083b3405df6979581f5e1b3bbb955d9b20d0619&amp;dn=Democracy+Now+-+23+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1293121966,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 23, 2010\n\n- Senate Passes Nuke Treaty &amp; 9/11 Health Bill\n- Obama Signs Don't Ask, Don't Tell Repeal\n- Sen. Reid Returns Ring to Dan Choi After Repeal of DADT\n- Congress Bans Transfer of Gitmo Prisoners to US For Trial\n- UN Probes Detention of Bradley Manning\n- Julian Assange: Bradley Manning Is A &quot;Political Prisoner&quot;\n- WikiLeaks Cables Released About West Papua\n- UN: 173 Have Died in Ivory Coast\n- UN Increases Size of Force in Somalia by 50%\n- Alaska Supreme Court Rules Against Joe Miller\n\n\nSpecial reports\n\n- Juan Gonzalez: NYC CityTime Fraud Scheme &quot;Biggest Scandal of Entire Bloomberg Era&quot;\n\nFour consultants hired to eliminate waste and fraud in New York City's municipal payroll were arrested last week on charges of stealing $80 million from city coffers. Democracy Now! co-host and New York Daily News columnist Juan Gonzalez, who covered the story for the past year, call is &quot;the biggest scandal of the Bloomberg era.&quot;\n\n\n- As Senate Passes 9/11 Health Bill, Juan Gonzalez Notes Relative Absence of Key Figures Like Bush and Giuliani\n\nOn the final day of the 111th Congress, the Senate passed a $4.3 billion package to help the 9/11 rescue workers who were sickened by the toxins at Ground Zero. Democracy Now! co-host and New York Daily News columnist Juan Gonzalez, who first exposed what was happening to the Ground Zero workers, notes the &quot;relative absence of some of the key figures who were involved at the time when the attacks happened,&quot; like former New York mayor Rudy Giuliani, former New York governor George Pataki and former President George W Bush.\n\n\n- WikiLeaks Cables Reveal U.S. Sought to Retaliate Against Europe Over Monsanto GM Crops\n\nUS diplomatic cables released by WikiLeaks reveal the Bush administration drew up ways to retaliate against Europe for refusing to use genetically modified seeds. In 2007, then-US ambassador to France Craig Stapleton was concerned about France's decision to ban cultivation of genetically modified corn produced by biotech giant Monsanto. He also warned that a new French environmental review standard could spread anti-biotech policy across Europe. We speak with Jeffrey Smith of the Institute for Responsible Technology.\n\n\n- FBI Expands Probe Into Antiwar Activists\n\nThe FBI's probe into antiwar activists is growing. In September, FBI agents raided the homes and offices of activists in Chicago and Minneapolis. Subpoenas that were withdrawn have been re-activated and a new subpoena was served to a Palestinian solidarity activist in Chicago. We speak with two of the people targeted and two former FBI agents.\n\n\n- After GOP Blocks DREAM Act, Where is Immigration Activism Headed?\n\nAfter Senate Republicans blocked passage of the DREAM Act, a provision that would grant undocumented young people a chance at citizenship, many immigrant rights advocates are openly questioning the Obama administration's immigration strategy. Over the past two years, the Obama administration has deported a record number of undocumented immigrants but failed to gain support from Republicans on any immigration reform legislation. We speak with writer, Roberto Lovato.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6083b3405df6979581f5e1b3bbb955d9b20d0619","amp;dn":"Democracy+Now+-+23+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6083b3405df6979581f5e1b3bbb955d9b20d0619","infoHashBuffer":{"type":"Buffer","data":[96,131,179,64,93,246,151,149,129,245,225,179,187,185,85,217,178,13,6,25]},"announce":[],"urlList":[]}}