{"title":"Monja Pistolera dvd-rip vose ","uid":6123219,"size":861042060,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:61dda17612e016fb5ad94cd44c766ce666a7c3ac&amp;dn=Monja+Pistolera+dvd-rip+vose+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1295835290,"description":"Calidad de video: DVD Rip\nPeso: 830 mb\nIdioma del audio: Sub\n\nNUDE NUNS WITH BIG GUNS es una peli dirigida en 2010 por Joseph Guzman. Tras la gran Run! Bitch Run!, el director vuelve a la carga otra explotacion de primera que de cierta manera sigue aquella, pues se nombra a algunos personajes de aquella como eran Lobo y Chinaco, cuyos compinches y el jefe, llamado Chavo, son los malos estra vez de la peli. La estructura de la peli es similar a Ruh Bitch, es decir, se trata de nuevo de una peli de venganza, y esta vez no es una colegiala catolica, sino que es una monja, la hermana Sarah, y que tiene una actriz espanola para interpretarla, la guapa murciana Asun Ortega. Guzman vuelve a situar todo de nuevo en un ambiente texmex con una psicotronia catolica extremedamente exagerada con obispos narcos y monjas procesadoras de drogas. El gran jefe del negocio es un tipo que le llaman Chavo quien tiene un acuerdo con el Obispo y loa padres Bernardo y Carlitos para utilizar a las monjas para el procesamiento y el trafico de drogas. En una de las entregas, un paquete de coca desaparece y Chavo provoca una matanza de monjas donde solo sobrevive la hermana Sarah, que de catigo es llevada de puta a un burdel y enganchada a la heroina. En uno de los viajes tiene una vision celestial y Dios le encarga que empieze una venganza en su nombre sin piedad contra todos lo que han tomado su nombre en vano, asi que para la banda del Chavo llamada Los Muertos comienza su juiciuo final...Muchisimo mejor a todos los niveles que Run Bitch, esta claro que Joseph Guzman es el Robert Rodriguez indie y que nos esta dejando algunos de los mejores ejemplos de esta explotacion grindhouse texmex memorable e hiperviolenta. Para no perdersela. Ademas, por el final se viene la tercera parte y dandole el protagonismo al Padre John, que hace el unico Bill Oberst Jr. cuya presencia impacta ya con esa cara. \n\nNosvemos por TorrentSpain","torrent":{"xt":"urn:btih:61dda17612e016fb5ad94cd44c766ce666a7c3ac","amp;dn":"Monja+Pistolera+dvd-rip+vose+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61dda17612e016fb5ad94cd44c766ce666a7c3ac","infoHashBuffer":{"type":"Buffer","data":[97,221,161,118,18,224,22,251,90,217,76,212,76,118,108,230,102,167,195,172]},"announce":[],"urlList":[]}}