{"title":"V.A Best Of House 2010 Compiled By Dj Alex Sol (2011)","uid":6083933,"size":2030798094,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:61edb21ab5844fb1262fa4b4f38a9609bfbfecfc&amp;dn=V.A+Best+Of+House+2010+Compiled+By+Dj+Alex+Sol+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webchella","files":121,"time":1294234272,"description":"V.A Best Of House 2010 Compiled By Dj Alex Sol (2011)\n\nArtist: VA\nAlbum: Best Of House 2010 - Compiled By Dj Alex Sol (2011)\nFormat: UNMIXED\nGenre: Progressive House / Vocal House / Club House\nRelease Date: 2011\nQuality: 320kbps/44.1kHz/Joint Stereo\nTracks: 120\n\nTracklist:\n-------------\n\n1.Adam K feat. King Sunshine - My Love (EDX Ibiza Sunrise Mix)\n2.Addict DJs - Art Is Money (Dub Mix)\n3.Adrian Lux-Teenage Crime (Axwell &amp; Henrik B Remode)\n4.Alan Pride - Shine (Tony Romera Remix)\n5.Alex Menco - Instead (Luffy Luf Partycrash Mix)\n6.Alexander Popov - Vapour Trails (Shingo Nakamura Remix)\n7.Alexey Romeo feat. J'well - I promise you! (Julia Luna extended edit)\n8.Ali Payami - Roots (Original Mix)\n9.Alina - Deep In Love (Hy2rogen &amp; Fr3cky Remix)\n10.Allen S - Ocean Flowers (Original Mix)\n11.Andi Vax &amp; Diana Miro - Look Inside My Dreams (Anton Sever Remix)\n12.Andres Fumero - Tell Me A Story (Jozhy K Remix)\n13.Approaching Black and Jacob Henry - Yesterday's Tears (Shingo Nakamura Remix)\n14.ATFC Feat. Rae - It's Over (ATFC's Lektrotek Vocal Mix)\n15.Axwell - Nothing But Love For You (TV Rock Remix)\n16.Ben Coda &amp; Maxi Valvona - Noir (Original Mix)\n17.Benny Benassi - Satisfaction (Dimitri Vegas &amp; Like Mike Remix)\n18.C-Cret - Closer (Andy Harding Dub Mix)\n19.Cedric Gervais Ft. Caroline - Leave Me Alone (Sultan &amp; Ned Shepard Remix)\n20.Chris Reece - Salvation (Jerome Isma-Ae &amp; Daniel Portman Remix)\n21.Chris Reece feat. Nadia Ali - The Notice (Khomha Remix)\n22.Chris Sorbello - So Lonely (Hook N Sling Mix)\n23.Cicada - The Things You Say (Adrien Mezsi, Digital Lab &amp; Pedro Henriques Reboot)\n24.Cristian Lavino, Cristina Camacho - Straight Through My Soul (Stefano Iezzi Extended Remix)\n25.Da Fresh - Tomorrow (Original Mix)\n26.Dabruck &amp; Klein and Jean Elan - I've Got My Pride (Hold My Head High)\n27.Daniela - You I (Fattyphunk Mix)\n28.Dave Seaman, Funkagenda - The Mighty Ming (Original Club Mix)\n29.David Vendetta feat. Rachael Starr - Holding on (Moonbeam remix)\n30.Deniz Koyu - What We Are (Club Mix)\n31.Deniz Koyu feat. Shena - Time Of Our Lives (Alesso Remix)\n32.Dennis De Laat - Revenge (Fearless Dub)\n33.Dezza - Adelina (Original Mix)\n34.Dezza, Soundprank - Signals (KhoMha Sunrise Mix)\n35.Dim Chris feat. Amanda Wilson - Sometimes (Johan Wedel Remix)\n36.Dimitri Vegas &amp; Like Mike feat. Vangosh - Deeper Love (Tommy Trash Remix)\n37.Dj Boyko &amp; Katy Queen - I Heard It Through The Grapevine\n38.DJ Jesus Luz feat. Alexandra Prince - Dangerous (Nicky Romero Festival Mix)\n39.DJ Salamandra - Driving Me Slowly (Original Mix)\n40.DJ She Ft. Rita Mojito - Open Space\n41.DJ Tatana - Rise (Original Mix)\n42.East Sunrise, Smooth Stab - Desire Of The Sky (Original Mix)\n43.Eddie Thoneick, Erick Morillo - Nothing Better feat. Shena (An21 &amp; Max Vangeli Remix)\n44.EDX &amp; Tamra Keenan - Out Of The Rain (Extended Mix)\n45.Embliss - Lemonakia (Original Mix)\n46.E-Play &amp; Hype Jones - Just A Dream (Peter Brown &amp; Etienne Ozborne Remix)\n47.Eric Amarillo - Air (Original Mix)\n48.Everything But The Girl - Missing (Fedde Le Grande Remix)\n49.Faarsheed &amp; Cari Golden - Daniel (Original Mix)\n50.Fedor Smirnoff - Covered Snow (Original Mix)\n51.Fierce Collective feat. Polina - Don't Tell Me Goodbye (Eks Fierce Disco Mix)\n52.Florence &amp; The Machine - Cosmic Love (Morgan Page Bootleg Remix)\n53.French Government - Desperate Traders (Original Mix)\n54.Funkagenda, Sultan &amp; Ned Shepard - Past Dreaming (Original Club Mix)\n55.Goldfrapp - Alive (Arno Cost Remix)\n56.Gregor Salto feat. Chappell - Your Friend (Hardwell Remix)\n57.Happy Paul Feat Dana - Lovin Me (Original Vocal Mix)\n58.Hard Rock Sofa - Live Today (Swanky Tunes Remix)\n59.James Talk, Ridney - Forever (Chris Lake Remix)\n60.Jay Ronko, Josh Newson - Back Up (Original Mix)\n61.Jay Ronko, Josh Newson - Push (Peter Brown Remix)\n62.Jean Claude Ades - My Journey (Original Mix)\n63.Jesse Voorn, Jorgensen - Troubled So Harder (Original Mix)\n64.Jochem Peterson &amp; Tom Hill - Whats Left For Us (Andrea Bertolini Remix)\n65.Johan Wedel - Playdoo (Original Mix)\n66.John Dahlback - Olympia (Original mix)\n67.Josha &amp; Paul Misano - 180 Degrees ft. Polina Griffith (Dr. Kucho! Remix)\n68.Julia Lasker ft. DJ Michelangelo - City Life (Extended edit)\n69.Junior Caldera feat. Sophie Ellis Bextor - Can't Fight This Feeling (Mischa Daniels Original Mix)\n70.Junior Sanchez - Elevator feat. Good Charlotte (Nari &amp; Milani Remix)\n71.Karmatronic - Hi Helen (Instrumental Version)\n72.Kaskade - Steppin 'Out (Ivan Spell Unofficial Reboot 2010)\n73.Kaskade feat. Haley - Dynasty (Funkk Frikz Remix)\n74.KhoMha - Midnight (Incognet Remix)\n75.Kristof Tigran feat Mandy - Come To Me (Original Mix)\n76.Kylie Minogue - Get Outta My Way (Kris Menace Club Mix)\n77.Late Night Alumni - Empty Streets (Ivan Spell Unofficial Reboot 2010)\n78.Les Schmitz &amp; Alex Del Amo - We Are Family (Original Mix)\n79.M.O.O.N. Pro - Aqua (Original mix)\n80.Malibu Breeze - Now That You're Gone feat. Gerald G! (DJ Groover Remix)\n81.Mango &amp; Kazusa - Asphalt Lines (Dezza 'Grande Bold' Mix)\n82.Mario Held - Only You (Leventina Remix)\n83.Marsbeing - Enter To The Sky (Original Mix)\n84.Massivedrum &amp; Dj Bruno F feat. Katia - My World (Club Mix)\n85.Matan Caspi - Turn The Beat Back (Leventina Re-Animation)\n86.Matt Lange - East Coast (Ad Brown Remix)\n87.Max Freegrant - Highest (Original Mix)\n88.Max Vangeli ft Max C - Look Into Your Heart (Tristan Garner Remix)\n89.Max Zotti - Shiver (Boom Boom) (Original Mix)\n90.Maxi Valvona - Revolve (Komytea Remix)\n91.Meck Feat. Dino - Feels Like A Prayer (Jean Elan Remix)\n92.Medway &amp; Luke Porter - Clarity (Michael Cassette Remix)\n93.Mell Tierra - This Beat Is (Original Mix)\n94.Micky Slim, Emma Hewitt - Tonight (Original Mix)\n95.Moguai - We Want Your Soul (Sebjak Remix)\n96.Moonbeam &amp; Tyler Michaud Feat. Tiff Lacey - Openhearted (Original Mix)\n97.Moonbeam feat. Blackfeel Wite - Song For A Girl (Original Mix)\n98.Morgan Page - Strange Condition (Inpetto Vocal Mix)\n99.Nicola Zucchi - Waiting (Original Mix)\n100.Nyx - Fly Away (Arias Remix)\n101.Offer Nissim &amp; Itay Kalderon Ft. Epiphony - Million Stars (Beat Mix)\n102.Pryda - Illusions (Original Mix)\n103.Qika - I'm So Excited (Qoto Extended mix)\n104.Rihanna - Only Girl (In The World) (Mixin Marc &amp; Tony Svejda Remix)\n105.Rony Seikaly feat. Polina - Let You Go (Original Mix)\n106.Serge Devant vs Michael Jackson - Beat The Sweet (Jerome Isma Ae Remix)\n107.Sergio Mauri Feat. April Raquel - I Feel in the Air (Club Mix)\n108.Sgt Slick - Everyday (Digital Lab Remix)\n109.Sparta Project - Memory Friend (Original Mix)\n110.Sultan - GStringz (Egostereo Remix)\n111.Sultan, Ned Shepard - Deeper Underground (Original Mix)\n112.Syke 'N'Sugarstarr, Alexandra Prince - So Alive (Coolbreezers Club Remix)\n113.Ted Nilsson - Why Surrender (Original Mix)\n114.Tomcraft - A Place Called Soul (Original Mix)\n115.Tomcraft And Jerome Isma-Ae - Trouble In The Redlight District (Weekend Heroes Remix)\n116.Toni Braxton - Make My Heart (Kim Fai Remix)\n117.Way Out West - The Gift (Michael Woods Remix)\n118.Weekend Heroes - Endless Candy (Original Mix)\n119.Whiteside &amp; Jorge Martin S - What You Feel (Tony Romera &amp; Alan Tremain Club Mix)\n120.Wolfgang Gartner &amp; Mark Knight - Conscindo (Original Club Mix)","torrent":{"xt":"urn:btih:61edb21ab5844fb1262fa4b4f38a9609bfbfecfc","amp;dn":"V.A+Best+Of+House+2010+Compiled+By+Dj+Alex+Sol+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61edb21ab5844fb1262fa4b4f38a9609bfbfecfc","infoHashBuffer":{"type":"Buffer","data":[97,237,178,26,181,132,79,177,38,47,164,180,243,138,150,9,191,191,236,252]},"announce":[],"urlList":[]}}