{"title":"Aufstand der Alten","uid":6098496,"size":1258307584,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:622b6654e7baa31402c35ae9d2e4bdaaf88765ec&amp;dn=Aufstand+der+Alten&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"leicestersquare","files":3,"time":1294869347,"description":"This is the DVD version in German. If you make subtitles, know of some, or at least a German transcription with timing, please post it in comments.\n\n--------------------------------------------------------------------------------\n\nAlle 3 Teile der ZDF-Dokumentation\n\n\n12.September 2030. Die Bundesregierung tritt geschlossen zurueck. Warum?\nHat es etwa mit der Rentenproblematik dieser Zeit zu tun?\nLena Bach (Bettina Zimmermann), Journalistin des ZDF, nimmt die Recherchearbeit auf und faehrt uns durch ein erschreckendes Szenario.\n\n\nTeil 1: Die Geiselnahme - Im Jahr 2030 wird die junge Journalistin Lena Bach Zeugin eines Verbrechens. Ein verzweifelter Rentner nimmt den Vorstandsvorsitzenden des Wellness-Konzerns 'Prolife' als Geisel und will ihn zu einem Gestaendnis zwingen.\nGerade als der Manager anfaengt zu reden, kommt es zu einer Explosion.\n\nTeil 2: Das Leben im Untergrund - Lena trifft einen Informanten, der ihr ueber Videotelefon wichtige Details aus Darows Leben versprochen hat,in einem illegalen Berliner Hinterhof-Hospital. Sie weiss jetzt: die Handgranate, die Darow mit sich trug, war eine Plastikattrappe. Was geschah wirklich im Buero des 'Prolife'-Vorstandsvorsitzenden?\n\nTeil 3: Das Geheimnis in der Wueste - Lena Bach recherchiert auf den Spuren Sven Darows in Afrika. Nach dem vereitelten Treffen mit einer wichtigen Zeugin hatte Darow sich allein auf den Weg in eine Residenz des 'Prolife'-Konzerns in der Naehe Nakenas gemacht. Das Unternehmen verspricht deutschen Senioren in Westafrika ein sorgenfreies Leben, das sie sich in Europa mit ihrer geringen Rente nicht leisten koennten.","torrent":{"xt":"urn:btih:622b6654e7baa31402c35ae9d2e4bdaaf88765ec","amp;dn":"Aufstand+der+Alten","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"622b6654e7baa31402c35ae9d2e4bdaaf88765ec","infoHashBuffer":{"type":"Buffer","data":[98,43,102,84,231,186,163,20,2,195,90,233,210,228,189,170,248,135,101,236]},"announce":[],"urlList":[]}}