{"title":"Tift Merritt...Another Country(2008)[FLAC]","uid":6054790,"size":364737886,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:631ed39aea273b7f09c82e80d2cf1203ef61a89f&amp;dn=Tift+Merritt...Another+Country%282008%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":23,"time":1292863563,"description":"2009 Another Country [Bonus Tracks]    CD  Fantasy 0888072312647 \n\n1 Something to Me   4:09 \n2 Broken   3:44 \n3 Another Country   4:42 \n4 Hopes Too High   3:32 \n5 Morning is My Destination   3:18 \n6 Keep You Happy   5:05 \n7 I Know What I'm Looking For Now   3:58 \n8 Tell Me Something True   3:00 \n9 My Heart is Free   3:29 \n10 Tender Branch   3:31 \n11 Mille Tendresses   3:07 \n Bonus EP Tracks:    \n12 Morning is My destination (Just Past Midnight Mix)    \n13 Tell Me Something True (Solo Acoustic)    \n14 I Live for You    \n15 Wayward and Weary    \n16 Last to Know \n\nTift Merritt's third album, Another Country, follows the Grammy-nominated Tambourine with another collection of Nashville-style soft rock. It's hard to dislike Merritt's crystal tones and way with a hook, and the album will keep radio stations happy the world over. But there's not much that's terribly memorable about this album.\nThe playing is accomplished, but also rather passionless, which seems a particular problem for a collection inspired by that city of lovers, Paris. The opening song, Something To Me, is the best, with a nagging, insistent melody and a lyric that plays on the half-remembered nature of the tune, while Broken channels Aimee Mann effectively. But Merritt's closing line here: ''I think I will break but I mend'', shows up her lack of lyrical flair.\n\nMerritt is probably at her best when she is uncomplicatedly happy, which is not an easy a task as it seems; Morning Is My Destination and Keep You Happy are genuinely romantic and uplifting, but I Know What I'm Looking For Now is fairly ruined by some flatulent guitar soloing halfway through. The harder rock approach of My Heart is Free doesn't really work either, although Tell Me Something True is a half-decent soul belter, and there are a good half-dozen quieter moments on the album; it's just that Another Country is best taken in small doses.\n\nStill, even if this paen to Paris is a peculiarly American, airless take on tourism (until the closing track, distinctly lacking in gallic atmosphere, musical or otherwise), the album is not without its charms. Continuing on the wintry theme that other female country singer-songwriters have been summoning up of late, these songs are, at their best, as pretty as snowflakes, and capable of bearing about as much close examination.\n   \n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/12/10/tift-merritt/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/12/10/tift-merritt/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:631ed39aea273b7f09c82e80d2cf1203ef61a89f","amp;dn":"Tift+Merritt...Another+Country%282008%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"631ed39aea273b7f09c82e80d2cf1203ef61a89f","infoHashBuffer":{"type":"Buffer","data":[99,30,211,154,234,39,59,127,9,200,46,128,210,207,18,3,239,97,168,159]},"announce":[],"urlList":[]}}