{"title":"Tina Turner - What You Get Is What You See (Xvid-2nafish)","uid":6041669,"size":41105174,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6336c44d80bf66eee12c622cc305af4773a0771a&amp;dn=Tina+Turner+-+What+You+Get+Is+What+You+See+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292406875,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:07\n\n[Video]\nResolution : 320x240\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1202 Kbps\nQuality Factor : 0.53 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\nWhat You Get Is What You See is a hit song by Grammy Award winning rock and soul singer Tina Turner, it was released as a single from Tina's Break Every Rule album. The song was written by the Terry Britten and Graham Lyle team and was notably different to the three previous singles that they had written for Turner, &quot;What's Love Got to Do with It&quot;, &quot;We Don't Need Another Hero&quot; and &quot;Two People&quot;, as it was an up-tempo Country-tinged rock track featuring Eric Clapton on guitars. The 12&quot; single included three versions of the song, the Extended Dance Mix, the Extended Rock Mix and a live version recorded in London in November 1986. A different live recording of the song was later used as the opening track on Turner's 1988 album Tina Live in Europe.\n\n&quot;What You Get Is What You See&quot; was popular in Australia, where it was used in a campaign for the New South Wales Rugby League. They later used &quot;The Best&quot; in an even more successful campaign.\n\nBreak Every Rule is the sixth solo album by Tina Turner, released on Capitol Records in 1986. The album's predecessor, Private Dancer, set high commercial standards, yet Break Every Rule sold very well worldwide. It reached #4 on the Billboard 200, #2 on the UK albums chart and #1 in many European countries including Germany for 12 weeks. The RIAA certified Break Every Rule three times platinum, denoting 3 million shipments in the United States. It was certified multiplatinum in many European countries including Germany (3) and the UK (2). The original A-side of the vinyl album was entirely produced by Graham Lyle and Terry Britten, the team behind &quot;What's Love Got To Do With It&quot;, while side B included tracks produced by among others Bryan Adams, Bob Clearmountain, Mark Knopfler and Rupert Hine. Out of the album's eleven tracks no less than eight were released as singles, either in Europe or the U.S. or both; &quot;Typical Male&quot; (U.S. #2) featuring Phil Collins on drums, &quot;What You Get Is What You See&quot; (U.S. #13) with Eric Clapton on guitars, &quot;Two People&quot; (Spain #1 &amp; U.S. R&amp;B #9) , David Bowie's &quot;Girls&quot; (Poland #11), &quot;Back Where You Started&quot; (US Rock #9) co-written and produced by Bryan Adams, &quot;Afterglow&quot; (Dance #2) featuring Steve Winwood on keyboards, &quot;Break Every Rule&quot; (Poland #15) co-written and produced by Rupert Hine and &quot;Paradise Is Here&quot; (Ireland #24). Most of the 12&quot; singles included extended or alternate mixes, live versions and/or non-album tracks, the majority of which still remain unreleased on compact disc. In the U.S., the most successful of the singles was &quot;Typical Male&quot;, which reached #2 on the Billboard Hot 100. The world tour originally had 65 shows in South America, along 50 dates in UK and 15 Russian gigs. They were cancelled because of the recording. Turner recorded tracks with Steve Lillywhite and Bryan Adams which never have been released.\n\nFollowing the release of the Break Every Rule album Turner recorded the duet &quot;Tearing Us Apart&quot; with Eric Clapton, included on his Phil Collins produced 1986 album August and also issued as a single in early 1987.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:6336c44d80bf66eee12c622cc305af4773a0771a","amp;dn":"Tina+Turner+-+What+You+Get+Is+What+You+See+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6336c44d80bf66eee12c622cc305af4773a0771a","infoHashBuffer":{"type":"Buffer","data":[99,54,196,77,128,191,102,238,225,44,98,44,195,5,175,71,115,160,119,26]},"announce":[],"urlList":[]}}