{"title":"1Password 3.5.2 + KG","uid":6118140,"size":20434918,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:645cde7bbfd55f942950aeac5bc3157bc22b0a4e&amp;dn=1Password+3.5.2+%2B+KG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nobody2007","files":1,"time":1295644594,"description":"1Password is a password manager that uniquely brings you both security and convenience. It is the only program that provides anti-phishing protection and goes beyond password management by adding web form filling and automatic strong password generation. All your confidential information, including passwords, identities, and credit cards, is kept secure in one secure place using a highly encrypted keychain.\n\n1Password fully supports most web browsers, including Safari, Camino, OmniWeb, DEVONagent, Firefox, Flock, Fluid, and NetNewsWire. All browser extensions share the data stored in the keychain which means you never need to manually copy your passwords between browsers or from the password manager to a browser ever again!\n\n1Password has received numerous awards, including 4.5 mice from Macworld magazine, MacLife Editors pick, and was the Pick of Week on MacBreak Weekly by both Leo Laporte and Merlin Mann. \n\n\nWhat's New\n\n    * New: Password History is now available in the Chrome extension under the Password Generator tab.\n    * New: Added Growl notifications for background events. These are disabled by default and can be activated in the advanced preferences tab.\n    * Changed: Chrome: Fixed Fill Login on nectar.com.\n    * Changed: Chrome: Spellchecking is now disabled in the Password more... \n\nVersion 3.5.3:\n\n    * New: Password History is now available in the Chrome extension under the Password Generator tab.\n    * New: Added Growl notifications for background events. These are disabled by default and can be activated in the advanced preferences tab.\n    * Changed: Chrome: Fixed Fill Login on nectar.com.\n    * Changed: Chrome: Spellchecking is now disabled in the Password Generator window.\n    * Changed: Chrome: Changed popup window height to fit properly on Chrome 8 and 9.\n    * Changed: Attempt to fix problem removing old firefox extension. Now using authentication if needed to remove files.\n    * Changed: The Remove All Extensions button in Preferences now removes the Scripting Addition file as well as all extensions.\n    * Changed: When attempting to use a 1PIF file (instead of .agilekeychain_backup zip) in the Restore Backup window, displaying a window with helpful import instructions instead of reporting a corrupted file.\n    * Changed: Verification of the master password is now required to change the state of the &quot;Never prompt for master password&quot; preference.\n    * Changed: Now creating generated password database object when copying password value from Strong Password Generator window.\n    * Fixed: Chrome: Fixed issue where the popup window could open with the wrong width when using the keyboard shortcut.\n    * Fixed: Import from SplashID now honours multiline notes and properly handles values that contain commas.\n    * Fixed: Now scrolling to selection on launch and unlock. \n\n\n\nRequirements\n\n    * PPC / Intel\n    * Mac OS X 10.5 or later.\n    * Most major browsers supported.\n\n\ndonÃ‚Â´t forget: seed please when finished dl\n\n","torrent":{"xt":"urn:btih:645cde7bbfd55f942950aeac5bc3157bc22b0a4e","amp;dn":"1Password+3.5.2+%2B+KG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"645cde7bbfd55f942950aeac5bc3157bc22b0a4e","infoHashBuffer":{"type":"Buffer","data":[100,92,222,123,191,213,95,148,41,80,174,172,91,195,21,123,194,43,10,78]},"announce":[],"urlList":[]}}