{"title":"The Nature and Functions of Dreaming","uid":5982335,"size":987501,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65893dc585f7e053ef75ed598656703ec327cc24&amp;dn=The+Nature+and+Functions+of+Dreaming&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookzilla","files":1,"time":1290626172,"description":"The Nature and Function of Dreaming presents a comprehensive theory of dreaming based on many years of psychological and biological research by Ernest Hartmann and others. Critical to this theory is the concept of a Central Image; in this volume, Hartmann describes his repeated finding that dreams of being swept away by a tidal wave are common among people who have recently experienced a trauma of some kind - a fire, an attack, or a rape. Dreams with these Central Images are not dreams of the traumatic experience itself, but rather the Central Image reveals the emotional response to the experience. Dreams with a potent Central Image, like the tidal wave, vary in intensity along with the severity of the trauma; this pattern was shown quite powerfully in a systematic study of dreams occuring before and after the September 11 attacks in New York.\n\nHartmann's theory comprises three fundamental elements: dreaming is simply one form of mental functioning, occurring along a continuum from focused waking thought to reverie, daydreaming, and fantasy. Second, dreaming is hyperconnective, linking material more fluidly and making connections that aren't made as readily in waking thought. Finally, the connections that are made are not random, but rather are guided by the dreamer's emotions or emotional concerns - and the more powerful the emotion, the more intense the Central Image. \n\nHardcover: 176 pages \nPublisher: Oxford University Press, USA; 1 edition (November 24, 2010) \nLanguage: English \n\n","torrent":{"xt":"urn:btih:65893dc585f7e053ef75ed598656703ec327cc24","amp;dn":"The+Nature+and+Functions+of+Dreaming","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65893dc585f7e053ef75ed598656703ec327cc24","infoHashBuffer":{"type":"Buffer","data":[101,137,61,197,133,247,224,83,239,117,237,89,134,86,112,62,195,39,204,36]},"announce":[],"urlList":[]}}