{"title":"Amy Grant - Stay For A While (Xvid-2nafish)","uid":6027560,"size":47011986,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:65d777699dd8509162cd6bbfe994534abc95837e&amp;dn=Amy+Grant+-+Stay+For+A+While+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1291973249,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:05:33\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 999 Kbps\nQuality Factor : 0.15 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Stay For Awhile&quot; is a 1986 single by Christian singer Amy Grant, and was the first single from her album The Collection. The background vocals were provided by Richard Page (lead singer for Mr. Mister), with him clearly heard singing &quot;The way it used to be...&quot; outro to the song.\n\nThroughout 1985 and 1986, Amy Grant was busy touring and promoting her successful pop-crossover album Unguarded. Previously she had been solely a CCM artist, but with the release of her single &quot;Find a Way,&quot; she established herself as a credible name in secular music.\n\nDespite her success, she was also suffering personal problems. Her husband Gary Chapman had become addicted to cocaine, and she spent most of early 1986 trying to deal with the problem. Even though she hardly had time for new recordings, she did manage to release the #1 pop single &quot;The Next Time I Fall,&quot; which was a duet with Peter Cetera, and her record company issued a best-of compilation that covered her first ten years in the music industry.\n\nIn June 1986, The Collection was released in two separate LP and cassette versions, and &quot;Stay For Awhile&quot; was issued as its first single. Although there was a lack of promotion for both the album and the single, The Collection managed to top the Inspirational chart and &quot;Stay For Awhile&quot; topped the Christian radio chart and made the Top Twenty of the Adult Contemporary chart. &quot;Stay for Awhile&quot; paved the road to further pop radio success for Grant. Her next single, &quot;The Next Time I Fall&quot; became her first #1 pop song (following a long line of #1 songs on the Christian Music charts).\n\nThe Collection was the first compilation of Amy Grant's music to be released, and it was issued after her crossover success in 1985 with the album Unguarded. The Collection spanned Grant's first decade in music, and featured the new songs &quot;Stay For Awhile&quot; and &quot;Love Can Do,&quot; the former of which was a Top Twenty Adult Contemporary hit in the United States. The Collection was originally released in two different versions: a cassette version and an LP version. The LP version was directed to her newer fans, who knew her primarily for her Top 40 pop hit &quot;Find A Way.&quot; The cassette version was directed to her older fans, who knew her for her Christian work as well as her secular work. The LP version contained ten tracks, and the cassette version contained fifteen tracks. In 1990, The Collection was re-released on CD with the 15 tracks featured on the cassette version, and two additional tracks, &quot;Too Late&quot; and &quot;I'm Gonna Fly&quot;. Word Canada accidentally released the ten-track LP version to CD. The cover and tray art were that of the seventeen-track version causing confusion and recalls. They later issued the seventeen-track version as well. According to CCM Magazine, The Collection is the best-selling Christian music compilation album ever released, having sold in excess of 1 million copies. An unauthorized reproduction of the album artwork (featuring Amy Grant) was used for issue #15 of the Marvel Comics series Dr. Strange. Apparently, the issue's artist was a fan of the singer and decided to use her likeness for a character in the story.\n\nIn 2007, The Collection was reissued and digitally remastered by Grant's new record label, EMI/Sparrow Records. The remastered edition is labeled with a &quot;Digitally Remastered&quot; logo in the 'gutter' on the CD front.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:65d777699dd8509162cd6bbfe994534abc95837e","amp;dn":"Amy+Grant+-+Stay+For+A+While+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65d777699dd8509162cd6bbfe994534abc95837e","infoHashBuffer":{"type":"Buffer","data":[101,215,119,105,157,216,80,145,98,205,107,191,233,148,83,74,188,149,131,126]},"announce":[],"urlList":[]}}