{"title":"Wikirebels - SVT Documentary","uid":6089842,"size":815198706,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:65e34ffd3a4d5e2ddb08b04cb2202b7efe4307bc&amp;dn=Wikirebels+-+SVT+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bughunter68","files":1,"time":1294502098,"description":"WikiRebels - The Documentary\nIn less than a year Wikileaks has grown from a rather obscure website to a global political player, shaping world history and events, by revealing secret documents about warcrimes, corporate corruption and shady political backdoor dealings. Over several months a crew from Swedish Television has been following the secretive media network and its work behind the scenes. The result is a one hour feature documentary that tells the story behind the story.Watch the film\n\nThe reporters Jesper Huor and Bosse Lindquist from Swedish Television have traveled to several countries to meet Wikileaks staff. They have made several in-depth interviews with Wikileaks enigmatic editor-in-chief Julian Assange, who some view as a champion of freedom, others as a spy and rapist. But they have also met several other key people behind Wikileaks - computer geeks and journalists. As well as Wikileaks opponents.\n\nWikileaks ambitions are however deeper and more far reaching than exposing the dirty linen of various corporations and states. It is a conspiracy to end all conspiracies. A small group of people, or rather a subculture, is fighting an information war from serverrooms, internet cafes, and apartments, against the powers that be. Ultimately it is a war about the future of internet. A war where two small countries in the northern outskirts of Europe - Iceland and Sweden - play a crucial role. \n\nToday, after the several high profile revelations about the United States, Wikileaks is an organization under threat. Pressure is mounting from the US, that might retaliate with legal action, cyberattacks or even bids for assasination of Wikileaks leaders. At the same time an internal revolt inside the organization has erupted. The rebellion has led to the birth of another leaking operation, based in Germany. As one of the first media in the world, Swedish Television, reports about this new leaksite, Openleaks.\n\nProducers: Bosse Lindquist och Jesper Huor\nResearch: PÃƒÂ¤ivi Suhonen, Johannes WahlstrÃƒÂ¶m och Armin Turkanovic\nPhoto: Lars Granstrand och Sven Lindahl\nEdit: Michael Hallberg\nLog in: Max Orward\nProject leader: Johan BrÃƒÂ¥nstad\n\nSwedish documentary from 2010.\n\nBroadcasting time in Swedish Television: WikiRebels - The Documentary\nSVT2 Sunday 12 dec 2010 kl 20.00\nSVT1 Tuesday 14 dec 2010 kl 03.30\n","torrent":{"xt":"urn:btih:65e34ffd3a4d5e2ddb08b04cb2202b7efe4307bc","amp;dn":"Wikirebels+-+SVT+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65e34ffd3a4d5e2ddb08b04cb2202b7efe4307bc","infoHashBuffer":{"type":"Buffer","data":[101,227,79,253,58,77,94,45,219,8,176,76,178,32,43,126,254,67,7,188]},"announce":[],"urlList":[]}}