{"title":"Crvena prasina (eng subs) 1999] Zrinko Ogresta","uid":6007763,"size":734532805,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:670fb341ee74f5e5ff2e84763d358e4d4b90c482&amp;dn=Crvena+prasina+%28eng+subs%29+1999%5D+Zrinko+Ogresta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ThorntonWilde","files":-1,"time":1291376177,"description":" &lt;a href=&quot;http://bayimg.com/mABgOaADB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/mABgOaADB&lt;/a&gt;\n\nCrvena prasina (1999) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0210629/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0210629/&lt;/a&gt;\n\nCroatian language with English subtitles.\n\nRed Dust (Croatian: Crvena praÃ…Â¡ina) is a 1999 Croatian film directed by Zrinko Ogresta. It was Croatia\\'s official Best Foreign Language Film submission at the 72nd Academy Awards, but did not manage to receive a nomination\n\n  Josip Kuchan  ...  Crni  \n  Marko Matanovic  ...  Zrik  \n  Ivo Gregurevic  ...  Kirby  \n  Slaven Knezovic  ...  Boss  \n  Kristijan Ugrina  ...  Skrga  \n  Mirta Takac  ...  Sonja  \n  Sandra Loncaric  ...  Lidija  \n  Zarko Savic  ...  Otac  \n  Ante Vican  ...  Velecasni Grga  \n  Bozidarka Frajt  ...  Susjeda  \n  Marica Vidusic  ...  Lela  \n  Jelica Vlajki  ...  RuÃ…Â¾a  \n  Vanda Vujanic  ...  Julija  \n  Miro Barnjak  ...  Drveni, Bossov telohranitelj 1  \n  Krunoslav Belko  ...  Tyson, Bossov telohranitelj 2  \n\nZrinko Ogresta directs this gritty action film about the days of the 1990s war between Serbia and Croatia. Rugged ex-boxer Crni (Josip Kusan) leaves the front just in time to see his ex-girlfriend get hitched to the local crime kingpin, Boss (Slaven Knezovic). Later, Crni smuggles cigarettes, gets framed for murder, escapes, and becomes a renowned war hero. By the end of the film, Crni leads a revolt against Boss, who has made a killing during the war and has bought a factory.\n\nThe Red Dust takes its title from a line in Dostoevsky which says that \\&quot;the blood is least visible on the red\\&quot; - a phrase whose significance is not revealed until the end of the film. The story is told through the eyes of 16-year-old Skrga, who witnesses the whole, violent chain of events. Everything begins when Crni, a successful amateur boxer, deserts from the army after the authorities fail to deliver the telegram about his mother\\'s death, and returns to Zagreb, where his girlfriend, Lidija, is about to marry the local mafia boss. Crni himself drifts into petty crime, and ends up unintentionally working for the same boss. Lidija eventually leaves her violent husband, but dies in suspicious circumstances in Crni\\'s house. He is jailed. Then the war breaks out and everything changes, and such small crimes begin to pale into insignificance alongside what is happening in Croatia.\n\nThe fall of Communism and the beginning of Franjo Tudman\\'s semi-dictatorship in 1990 caused an enormous crisis in Croatian cinema. The nineties are commonly considered the worst period in Croatian film production since World War II. The first reason for such a crisis was typical of all countries in post-Communist transition. All Eastern European cinemas - including the most famous, Hungarian and Czech - suffered from the shock of transition in the early 1990s, as state subsidies suddenly evaporated and directors lost the regime and totalitarianism as topics and targets.\n\nThe film deals with tajkunizacija (tycooning), repossession and the destruction of national industry by mobster-businessmen supported by national political structures. \n\nIn the late 1990s, using industry factories as a source and mortgage for unrealistic bank credits, politically protected tycoons sucked national coffers dry, causing the collapse of the nation\\'s banking system and an absurd increase in unemployment to 25 percent. Victims of this process were industry workers and the suburban population, the people who had contributed most to the war effort and who were pillars of Tudman\\'s strength and popularity. \n\nBy the late 1990s, the social crisis had reached its peak and, at the end of Crvena praÃ…Â¡ina, when police shoot the brick factory worker-rebel and war hero, Croatian film finally opened its eyes to the increasing social, economic and moral crisis of the decaying Tudman regime. Brutal reality - tycooning, unemployment, corruption, connections between politics and crime, suicides of disappointed war vets - was systematically expelled from Croatian film in the 1990s, but it could not be expelled entirely.\n","torrent":{"xt":"urn:btih:670fb341ee74f5e5ff2e84763d358e4d4b90c482","amp;dn":"Crvena+prasina+%28eng+subs%29+1999%5D+Zrinko+Ogresta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"670fb341ee74f5e5ff2e84763d358e4d4b90c482","infoHashBuffer":{"type":"Buffer","data":[103,15,179,65,238,116,245,229,255,46,132,118,61,53,142,77,75,144,196,130]},"announce":[],"urlList":[]}}