{"title":"Biography Channel: Denis Leary","uid":5970359,"size":366283297,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:67a75bc9d4bbb1ef1fc4fbd6a383dbda2d3e51fd&amp;dn=Biography+Channel%3A+Denis+Leary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"phatwarez","files":-1,"time":1290259814,"description":"Denis Leary\n\nDenis Leary was born and raised in Worcester, Massachusetts, the son of Nora and John Leary, Irish immigrants who had grown up together. After a childhood in the 1960s, Leary went to Emerson College in Boston, where he tried his hand at acting and writing. He was a charter member of Emerson's Comedy Workshop, and taught at the college for five years after graduating. By that point he had written several pieces for magazines and had worked at stand-up comedy for a time. In 1990 he and his wife Ann flew to London to perform in the BBC's Paramount City. That weekend Ann's water broke. Their planned weekend trip became a stay of months, and Denis, with not a whole lot to do in London, wrote a one-man comedy act. He brought friends in from the States, and they wrote songs to perform on stage. Leary, with Chris Phillips and Adam Roth on guitar, performed &quot;No Cure For Cancer&quot; at the Edinburgh International Arts Festival in Scotland. Despite some protests about the title, the show won the Critic's Award and the BBC Festival Recommendation. The next year the show was moved to America, and it was eventually taped and broadcast on Showtime (No Cure for Cancer (1992) (TV)). The show spawned a book, CD, cassette, and a videotape. It also started Leary's movie career. Since then, he has starred in several films and has had two of his own TV series.\n\nFile Size ------- 349mb\nLength ---------- 44:36\nResolution ------ 720x480\nContainer ------- mkv\nVideo Codec ----- x264\nAudio Codec ----- mp3\nFrame Rate ------ 30\n\np h a t w a r e z . t k\nThanks to (anonymous) for the generous seedbox donation.","torrent":{"xt":"urn:btih:67a75bc9d4bbb1ef1fc4fbd6a383dbda2d3e51fd","amp;dn":"Biography+Channel%3A+Denis+Leary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a75bc9d4bbb1ef1fc4fbd6a383dbda2d3e51fd","infoHashBuffer":{"type":"Buffer","data":[103,167,91,201,212,187,177,239,31,196,251,214,163,131,219,218,45,62,81,253]},"announce":[],"urlList":[]}}