{"title":"La leyenda del falso traidor-(ebook).","uid":5951631,"size":2450622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67f0bc7acce0c02d6df20b41fa72190b9d2183e6&amp;dn=La+leyenda+del+falso+traidor-%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1289550416,"description":"La democracia se tambalea en Roma. La corrupciÃƒÂ³n polÃƒÂ­tica y la codicia la van minando; el interÃƒÂ©s personal de los dirigentes se impone a las necesidades comunes. Dos hombres concitan todas las miradas: Julio CÃƒÂ©sar, emperador con vocaciÃƒÂ³n de rey, lÃƒÂ­der admirado y temido, que ha convertido Roma en su jardÃƒÂ­n privado; y Bruto, su hijo ilegÃƒÂ­timo, que observa con dolor cÃƒÂ³mo el hombre a quiÃƒÂ©n mÃƒÂ¡s admira juguetea a su voluntad con la democracia. Llegado el momento, tendrÃƒÂ¡ que tomar una de las decisiones mÃƒÂ¡s dolorosas de la historia: escoger entre la vida de su padre y la libertad de su pueblo. La conspiraciÃƒÂ³n se va tramando en los recovecos de la ciudad y sÃƒÂ³lo falta una palabra de Bruto, un gesto, para que los conjurados conozcan su apoyo. La trama de La leyenda del falso traidor nos lleva, entre un suspense creciente, hasta uno de los puntos culminantes de la historia: aquel en que Bruto empuÃƒÂ±a la daga contra su padre.\n\n\n\nBruto es uno de los personajes mÃƒÂ¡s apasionantes de la civilizaciÃƒÂ³n occidental. Es el hombre que actuÃƒÂ³ siempre guiado por la justicia para pasar a la historia como paradigma de la traiciÃƒÂ³n.\n\nGÃƒÂ³mez Rufo se sirve de esa paradoja para crear una novela cuyo autÃƒÂ©ntico protagonista es la Roma de la corrupciÃƒÂ³n, tan lejana en el tiempo y sin embargo tan prÃƒÂ³xima en sus defectos.","torrent":{"xt":"urn:btih:67f0bc7acce0c02d6df20b41fa72190b9d2183e6","amp;dn":"La+leyenda+del+falso+traidor-%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67f0bc7acce0c02d6df20b41fa72190b9d2183e6","infoHashBuffer":{"type":"Buffer","data":[103,240,188,122,204,224,192,45,109,242,11,65,250,114,25,11,157,33,131,230]},"announce":[],"urlList":[]}}