{"title":"Iron Mountain 2 - Disc 1 &amp; 2","uid":6128009,"size":6876174336,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:68423be7de297461ec090f6f5b2adba49c195017&amp;dn=Iron+Mountain+2+-+Disc+1+%26+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rusty99922","files":18,"time":1296015765,"description":"format:vts\nduration: 6 hrs (2 disc set)\naudio: english\n\nThis documentary, created in the early 1990's provides, with shocking accuracy, the blueprint for the New World Order's agenda.\n The Agenda was created in an underground bunker, Iron Mountain, way back in the sixties under request of John F. Kennedy,\n and serves to this day as the cookbook for global enslavement.\n\nThe Iron Mountain report was leaked by one brave soul and was published as a book. it was vehemently dismissed as a fraud,\n but time has proven that it is THE doceument that the U.N. has used to bring us toward a one-world government.\nPlease note while watching the movie, exactly how many of this document's suggestions are being implemented right now as we speak.\n One very important one is GOVERNMENT RUN HEALTH CARE - It was tried under Clinton, but failed...but we know what happened \nlast year under Obama, Don't we?\n\nThe Video that started it all - written about in the WALL STREET JOURNAL and the subject of an NBC DATELINE. \nThis is a 6 hour 2 disc documentary investigating the little known IRON MOUNTAIN REPORT, leaked to the press in 1967. \nPurports to be a top-secret government plan to bring in the New World Order and the ultimate plans for American citizens.\n Declared a hoax, it was later verified by a top Pentagon official as real. The agenda is being carried out right under \nthe noses of the American people. UFOGGÃƒÂ©Ã‚Â¼GÃƒÂ¤ÃƒÂ³s play a major role in the Iron Mountain NWO. It is all about people control \nvia deception and manipulation. Deep into Eugenics, birth control and hideous plans for a tyrannical slave state. It is all\n coming true after OKC and 9-11 with the Patriot Act, Homeland Security and the military police operating in America. \nAirports first, railroads, then highways, and finally a complete LOCKDOWN under the pretense of security.\n A MUST SEE VIDEO ","torrent":{"xt":"urn:btih:68423be7de297461ec090f6f5b2adba49c195017","amp;dn":"Iron+Mountain+2+-+Disc+1+%26+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68423be7de297461ec090f6f5b2adba49c195017","infoHashBuffer":{"type":"Buffer","data":[104,66,59,231,222,41,116,97,236,9,15,111,91,42,219,164,156,25,80,23]},"announce":[],"urlList":[]}}