{"title":"Garbage - Special [ETV Bonus Mix promo].VOB","uid":6020759,"size":181037056,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:698112d137f72535e2a74d057313f88e24520366&amp;dn=Garbage+-+Special+%5BETV+Bonus+Mix+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1291794656,"description":"Garbage - Special [ETV Bonus Mix promo].VOB\n\n\n\nHQ &quot;ETV Bonus Mix&quot; extended promo music video. &quot;Special&quot; is an alternative rock song written, performed and produced by Garbage, and was the third international single to be released from the band's platinum second album Version 2.0. &quot;Special&quot; gained much attention in the music press upon the 1998 release of Version 2.0, as it contained a vocal interpolation of a lyric taken from &quot;Talk of The Town&quot; by The Pretenders.\n\nA moderate hit in the United Kingdom and Australia in October of 1998, &quot;Special&quot; became a sleeper hit in the United States the following year. The song's success was marked by becoming nominated in the Best Rock Song and Best Rock Performance by a Duo or Group categories at the 2000 Grammy Awards, and winning a Wisconsin Area Music Industry award for Song of the Year and BMI Award for Best Pop Song. The acclaimed sci-fi inspired music video for &quot;Special&quot; also received multiple nominations from music industry award panels; winning a D&amp;AD Award, a MTV Video Music Award, and a VH1 Visionary Video award.\n\nThis promotional video for &quot;Special&quot; was shot in London on August 26, 1998 by director Dawn Shadforth for Black Dog/RSA Films. Shadforth came to Garbage's attention when they viewed her clip for All Seeing I's single &quot;Beat Goes On&quot;. Her innovative storyboard treatment for &quot;Special&quot; highly impressed the band - her concept was not an obvious idea for a song like &quot;Special&quot;.\n\nHer concept for &quot;Special&quot; featured the members of Garbage in a dogfight in the skies of an alien world. Before production of the video commenced, Shadforth fashioned four study models of the fighter planes to enable her to plan in advance the shots and edits she needed to tell the storyline. The planes were designed by graphic artists who had worked on visual effects for 1998's Lost In Space and 1999's Star Wars Episode I: The Phantom Menace.\n\nEach band member was given a personalized plane design, emblazoned with imagery inspired by manga and sci-fi art; while each filmed their parts in a cabin set built upon a gimbal to give realism to the shots. Freelance stylist William Baker, who worked on the video, said &quot;Dawn wanted to present Shirley Manson as a space-age fighter pilot, with shots showing her sexily manipulating the controls of her craft&quot;. Shadforth later used techniques she used on the &quot;Special&quot; video in her 2001 music video for Kylie Minogue's &quot;Can't Get You Out of My Head&quot;.\n\nThis video was nominated for 'Best Special Effects' and 'Best Art Direction' at the MTV Video Music Awards on September 9, 1999. The group won the former award but lost out on the latter.\n(video does not have any logos)\n\n\n   &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Special_(Garbage_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Special_(Garbage_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/pAbMiaadD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/pAbMiaadD&lt;/a&gt; \n\n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 384kbps\n   Duration: 00:05:29\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*      &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:698112d137f72535e2a74d057313f88e24520366","amp;dn":"Garbage+-+Special+%5BETV+Bonus+Mix+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"698112d137f72535e2a74d057313f88e24520366","infoHashBuffer":{"type":"Buffer","data":[105,129,18,209,55,247,37,53,226,167,77,5,115,19,248,142,36,82,3,102]},"announce":[],"urlList":[]}}