{"title":"Ilusyon (2005) DVDRip XViD Soft EngSub (Pinoy) sribats75","uid":6075421,"size":931954990,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6b6b6eaf6301fb5dc76204693f9ab0e4ed7eb9a9&amp;dn=Ilusyon+%282005%29+DVDRip+XViD+Soft+EngSub+%28Pinoy%29+sribats75&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cavitea","files":5,"time":1293807553,"description":"Set in 1958, ILUSYON tells the story of Miguel, a young man from the countryside, who decides to visit his father, Pablo, a modernist painter in Manila. Upon his arrival, he discovers that his father has decided to leave for the province to heal from depression after the recent death of his wife and Miguel's mother. Miguel opts to stay in Manila for a vacation-- where he finds a job as a house painter and realizes that city life might fit him well. One day, he meets Stella, a nude model originally scheduled to pose for Miguel's father. Struck by her beauty, Miguel does the unthinkable-- he pretends to be his father. He pretends to paint her and hides his doodles from the unwitting Stella. Developing a relationship based on a lie, things turn for the worse when Stella begets a strange skin disease that turns off Miguel. Surrounded by strange characters, Miguel is driven into a frenzied realization about beauty, lust, love, and being true to one's self.\n\nBased on a story co-written and line produced by maverick independent filmmaker Jon Red, ILUSYON is the debut narrative full-length film award-winning independent documentary and animation filmmakers Paolo Villaluna and Ellen Ramos. A digital film that received a Grade A rating from the Cinema Evaluation Board (CEB), ILUSYON is also an acclaimed entry in the Cinemanila Fil Festival. ILUSYON stars VIVA Hot Babe Jaycee Parker in the pivotal role of Stella and award-winning Yul Servo as Miguel. Jennifer Lee, another Hot Babe, is introduced in this movie in a supporting role.\n\nCast: Jaycee Parker, Yul Servo","torrent":{"xt":"urn:btih:6b6b6eaf6301fb5dc76204693f9ab0e4ed7eb9a9","amp;dn":"Ilusyon+%282005%29+DVDRip+XViD+Soft+EngSub+%28Pinoy%29+sribats75","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b6b6eaf6301fb5dc76204693f9ab0e4ed7eb9a9","infoHashBuffer":{"type":"Buffer","data":[107,107,110,175,99,1,251,93,199,98,4,105,63,154,176,228,237,126,185,169]},"announce":[],"urlList":[]}}