{"title":"Democracy Now - 03 dec 2010","uid":6008313,"size":452383463,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6b86e0a743f6d04e223fa132baf58025c85380f9&amp;dn=Democracy+Now+-+03+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1291393521,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 03, 2010\n\n- CIA Engineered Spying on U.N. Diplomats\n- Cables:Allowed U.S. Cluster Bombs\n- Amnesty Intl: Cables Confirm U.S. Attack Killed Yemeni Civilians\n- State Dept. Bars Staffers from WikiLeaks, Warns Students\n- Attorney: Assange Accused for Not Wearing Condom During Consensual Intercourse\n- House Approves Tax Measure Despite Filibuster Vow\n- Law Enforcement Agencies Conduct &quot;Real-Time&quot; Spying Without Court Orders\n- McCain Opposes Repeal of &quot;Don't Ask, Don't Tell&quot;\n- House Censures Rep. Rangel for Ethics Violations\n- 2010 Projected to Be Among Warmest Years on Record\n- Haitians Protest Controversial Elections\n- Nigeria to Charge Cheney in Bribery Case\n\n\nSpecial reports\n\n- Is WikiLeaks' Julian Assange A Hero? Glenn Greenwald Debates Steven Aftergood of Secrecy News\n\nWikiLeaks is coming under attack from all sides. The U.S. government and embassies around the world are criticizing the whistleblowing group for releasing a massive trove of secret state department cables.The WikiLeaks website is struggling to stay at home just days after Amazon pulled the site from its servers following political pressure. The State Department has blocked all its employees from accessing the site and is warning all government employees not to read the cables, even at home. &quot;These attacks will not stop our mission, but should be setting off alarm bells about the rule of law in the United States,&quot; said WikiLeaks founder Julian Assange. We host a debate between Steven Aftergood, a leading transparency advocate who has become a leading critic of WikiLeaks and Glenn Greenwald, a constitutional law attorney and political and legal blogger for Salon.com.\n\n\n- Abandoning &quot;Net Neutrality&quot;, FCC Chair Backs Two-Tiered Internet Fees\n\nThe Federal Communications Commission is being accused of abandoning &quot;net neutrality&quot; rules that would ensure a free and open internet. On Wednesday, FCC chair Julius Genachowski unveiled proposals that would allow internet service providers to charge higher fees for faster access to online content. We speak to Josh Silver, co-founder of the media reform group Free Press.\n\n\n- Greenpeace Sues Chemical Companies For Corporate Espionage\n\nGreenpeace has filed a lawsuit against two major chemical companies and their PR firms for corporate espionage. The complaint alleges that Dow Chemical and Sasol-formerly CONDEA Vista-hired private investigators to spy on Greenpeace in the late 1990s. The charges of espionage center on surveillance of the Greenpeace office in Washington, D.C., and the infiltration of a community group in St. Charles, Louisiana, that was working with Greenpeace on dioxin contamination. Greenpeace accuses the corporations of engaging in this level of surveillance &quot;with the intention of preempting, blunting, or thwarting&quot; the organization's environmental advocacy campaigns. For more on this story, we speak with Greenpeace USA Senior Researcher Charlie Cray. Dow Chemical declined to comment on the lawsuit.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6b86e0a743f6d04e223fa132baf58025c85380f9","amp;dn":"Democracy+Now+-+03+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b86e0a743f6d04e223fa132baf58025c85380f9","infoHashBuffer":{"type":"Buffer","data":[107,134,224,167,67,246,208,78,34,63,161,50,186,245,128,37,200,83,128,249]},"announce":[],"urlList":[]}}