{"title":"The Vampires Assistant (2009) [DVD9][PAL][[Eng-Spa][","uid":5950166,"size":7542910976,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6b9ac7f536bfb1491f59dc4bc8fc5b2e5d4cabed&amp;dn=The+Vampires+Assistant+%282009%29+%5BDVD9%5D%5BPAL%5D%5B%5BEng-Spa%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":51,"time":1289497903,"description":"El Circo De Los Extranos (2009) [DVD9][PAL][Eng-Spa][Subt.Eng-Spa]\n &lt;a href=&quot;\nhttp://www.elcircodelosextraÃƒÂ±os.es/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elcircodelosextraÃƒÂ±os.es/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0450405/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0450405/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.elseptimoarte.net/peliculas/cirque-du-freak-1399.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elseptimoarte.net/peliculas/cirque-du-freak-1399.html&lt;/a&gt;\n\nSpecifications:\nAudio: English, Castilian\nSubtitles: Castilian, English\nCompression: None. Full DVD\n\n\nTitle: The Vampire's Assistant\nOriginal title: Cirque Du Freak: The Vampire's Assistant\nCountry: USA\nUSA release: 23/10/2009\nReleased in Spain: 16/07/2010\nReleased on DVD (rental): 18/11/2010\nDVD release (sale): 02/12/2010\nStudio: Universal Pictures\nDirector: Paul Weitz\nScreenplay: Brian Helgeland &amp; Paul Weitz\nStarring: John C. Reilly, Ken Watanabe, Chris Massoglia, Josh Hutcherson, Patrick Fugit, Ray Stevenson, Michael Cerveris, Frankie Faison, Jane Krakowski, Orlando Jones, Kristen Schaal, Salma Hayek.\nRating: Not recommended for children under 13 years\n\n\nSynopsis:\nCirque du Freak tells the frightening story of a boy who unknowingly breaks the truce established over 200 years between two warring factions of vampires. Trapped in a fantasy world of misunderstood sideshow freaks and grotesque creatures of the night, the teenager leaves the safety of a boring existence and fulfill his destiny in a place drawn from nightmares.\n\nDarren (Chris Massoglia) is 14 years old and like most kids in his suburban neighborhood. He hung out with her best friend, got decent grades and usually stayed out of trouble. But when he wanted a traveling freak show with Darren and his friend, things begin to change inside. From that moment, a vampire named Larten Crepsley (John C. Reilly) turns him into something, well, bloody.\n\nNewly undead, he joins the Cirque du Freak, a touring sideshow filled with monstrous creatures from which there is a small snake, a werewolf and a bearded lady (Salma Hayek), led by a gigantic barker (Ken Watanabe). As Darren flexes his newfound powers in this dark world, becomes a pawn between the vampires and their deadlier counterparts. Apart from trying to survive, one boy will struggle to keep the war between the two sides do not devour what remains of the living world.\n\nProduction notes:\nBased on the series of twelve children's books written by Darren Shan.\nEscuchar\nLeer fonÃƒÂ©ticamente\nDiccionario - Ver diccionario detallado\n\n-------------------------------------------------------\n------------------------------------------------------\n-------------------------------------------------------\n\nCaracterÃƒÂ­sticas tÃƒÂ©cnicas:\nAudio: InglÃƒÂ©s, castellano\nSubtÃƒÂ­tulos: Castellano, inglÃƒÂ©s\nCompresiÃƒÂ³n: Ninguna. DVD Full\n\n\nTÃƒÂ­tulo: El circo de los extraÃƒÂ±os\nTÃƒÂ­tulo original: Cirque Du Freak: The Vampire's Assistant\nPaÃƒÂ­s: USA \nEstreno en USA: 23/10/2009 \nEstreno en EspaÃƒÂ±a: 16/07/2010 \nLanzamiento en DVD (alquiler): 18/11/2010 \nEstreno en DVD (venta): 02/12/2010 \nProductora: Universal Pictures \nDirector: Paul Weitz \nGuiÃƒÂ³n: Brian Helgeland &amp; Paul Weitz \nReparto: John C. Reilly, Ken Watanabe, Chris Massoglia, Josh Hutcherson, Patrick Fugit, Ray Stevenson, Michael Cerveris, Frankie Faison, Jane Krakowski, Orlando Jones, Kristen Schaal, Salma Hayek.\nCalificaciÃƒÂ³n: No recomendada para menores de 13 aÃƒÂ±os\n\n\nSinopsis:\nCirque du Freak cuenta la aterradora historia de un chico que rompe, por desconocimiento, la tregua establecida hace mÃƒÂ¡s de 200 aÃƒÂ±os entre dos facciones enemigas de vampiros. Atrapado en un mundo fantÃƒÂ¡stico poblado por monstruos incomprendidos y grotescas criaturas nocturnas, el adolescente abandona la seguridad de una vida aburrida para cumplir su destino en un lugar sacado de las pesadillas. \n\nDarren (Chris Massoglia) tiene 14 aÃƒÂ±os y se parece a la mayorÃƒÂ­a de los crÃƒÂ­os de su barrio residencial. Pasa mucho tiempo con su mejor amigo, saca buenas notas y no suele meterse en lÃƒÂ­os. Pero el destino ha querido que un circo ambulante se cruce con Darren y con su amigo, y algo empieza a cambiar dentro de ÃƒÂ©l. A partir de ese momento, un vampiro llamado Larten Crepsley (John C. Reilly) le convierte en algo, digamos, sanguinario. \n\nEste reciÃƒÂ©n no muerto se une al Cirque du Freak, un espectÃƒÂ¡culo ambulante poblado de criaturas monstruosas, entre las que hay un chico serpiente, un hombre lobo y una mujer barbuda (Salma Hayek), encabezadas por un gigantesco voceador (Ken Watanabe). Mientras Darren aprende a usar sus nuevos poderes en el oscuro mundo, se convierte en una importante pieza para los vampiros y sus temibles enemigos. AdemÃƒÂ¡s de intentar sobrevivir, el adolescente deberÃƒÂ¡ luchar para que la guerra entre los dos bandos no devore lo que queda del mundo de los vivos.\n\nNotas de producciÃƒÂ³n:\nBasado en la serie de doce libros infantiles escrita por Darren Shan. \n\n","torrent":{"xt":"urn:btih:6b9ac7f536bfb1491f59dc4bc8fc5b2e5d4cabed","amp;dn":"The+Vampires+Assistant+%282009%29+%5BDVD9%5D%5BPAL%5D%5B%5BEng-Spa%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b9ac7f536bfb1491f59dc4bc8fc5b2e5d4cabed","infoHashBuffer":{"type":"Buffer","data":[107,154,199,245,54,191,177,73,31,89,220,75,200,252,91,46,93,76,171,237]},"announce":[],"urlList":[]}}