{"title":"Castlevania Lords Of Shadow [R.Free][Xbox360][Spanish][www.conso","uid":6106529,"size":14679526684,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:6da7d5a6bdfe45e01750c53fb28a8cc78f77e4ab&amp;dn=Castlevania+Lords+Of+Shadow+%5BR.Free%5D%5BXbox360%5D%5BSpanish%5D%5Bwww.conso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":153,"time":1295185824,"description":"Plataforma: X360\nNÃ‚Âº de Jugadores: 1 Online: Si\nGÃƒÂ©nero: AcciÃƒÂ³n, Hack and Slash, Aventura\nVideo: R.Free\nIdiomas: EspaÃƒÂ±ol\n\nResumen:\nLos DueÃƒÂ±os de la Noche\nLa demostraciÃƒÂ³n que hemos tenido oportunidad de probar da comienzo con un combate a cara de perro entre nuestro protagonista y diferentes criaturas, por su apariencia presumiblemente hombres lobo. Las luchas se alternan con agilidad gracias a los controles tradicionales de los que hace gala Lords of Shadow.\n\nAsÃƒÂ­ con el botÃƒÂ³n izquierdo del pad efectuamos el ataque normal, con el superior el fuerte y con el botÃƒÂ³n inferior saltamos. Hasta aquÃƒÂ­ todo de lo mÃƒÂ¡s clÃƒÂ¡sico, lo que sorprende sin embargo es la forma en la que se ha solventado cÃƒÂ³mo agarramos a los enemigos. En el momento en que estamos lo suficientemente cerca de un oponente, podemos tirar del gatillo derecho del pad para agarrarlo y entonces dos cÃƒÂ­rculos concÃƒÂ©ntricos aparecerÃƒÂ¡n en pantalla y uno, el mÃƒÂ¡s grande, se irÃƒÂ¡ estrechando hasta entrar dentro del pequeÃƒÂ±o. AhÃƒÂ­ residirÃƒÂ¡ el momento de destreza que deberemos demostrar, y es que deberemos apretar el botÃƒÂ³n adecuado justo en el momento en el que las dos circunferencias se superpongan.\n\nEn la beta jugable sÃƒÂ³lo hemos visto combates, pero el tÃƒÂ­tulo tambiÃƒÂ©n tendrÃƒÂ¡ un componente de plataformas que harÃƒÂ¡ mÃƒÂ¡s fresca y variada su propuesta.\nEn la beta jugable sÃƒÂ³lo hemos visto combates, pero el tÃƒÂ­tulo tambiÃƒÂ©n tendrÃƒÂ¡ un componente de plataformas que harÃƒÂ¡ mÃƒÂ¡s fresca y variada su propuesta.\nÃ‚Â¿Si lo logramos? Toda la animaciÃƒÂ³n de atrapar al enemigo y tratar de golpearle se llevarÃƒÂ¡ a cabo con ÃƒÂ©xito, y si ÃƒÂ©ste tiene las dimensiones adecuadas acabaremos con ÃƒÂ©l directamente. Si, por el contrario, no acertamos la espectacular animaciÃƒÂ³n darÃƒÂ¡ con nuestros huesos en el suelo tras ser repelidos por nuestro contrincante.\n\nEl gatillo derecho quedarÃƒÂ¡, por su parte, para los bloqueos con un planteamiento muy convencional pero que saca partido del llevar a cabo varias acciones muy diferentes entre sÃƒÂ­ con un mismo botÃƒÂ³n. AsÃƒÂ­, por ejemplo, si tiramos del gatillo mientras nos desplazamos en una u otra direcciÃƒÂ³n llevaremos a cabo movimientos evasivos para esquivar ataques no bloqueables por parte del enemigo; por el contrario si tiramos del mismo gatillo en el momento adecuado bloquearemos a la perfecciÃƒÂ³n una ofensiva rival y podremos apretar intermitentemente, y lo mÃƒÂ¡s rÃƒÂ¡pido que podamos, el botÃƒÂ³n izquierdo del pad -X en Xbox 360, Cuadrado en PlayStation 3- para llevar a cabo un contragolpe letal.\n\nComo ya hemos adelantado la experiencia de Lords of Shadow nos ha llamado especialmente la atenciÃƒÂ³n por su fuerza visual y su poderÃƒÂ­o cinematogrÃƒÂ¡fico. Todas estas acciones que hemos mencionado se muestran simultaneando la acciÃƒÂ³n in-game con vertiginosos movimientos de cÃƒÂ¡mara que se acercan a la acciÃƒÂ³n para, por ejemplo, mostrarnos con todo lujo de detalles una sangrienta ejecuciÃƒÂ³n o un vertiginoso bloqueo. La fusiÃƒÂ³n entre ÃƒÂ©stas secuencias de video y las partes jugables son perfectas puesto que apenas duran unos segundos, y lejos de molestar aÃƒÂ±aden un matiz de espectacularidad a todo el combate que le sienta muy bien al tÃƒÂ­tulo.\n\nCon los enemigos mÃƒÂ¡s grandes habrÃƒÂ¡ que esforzarse el doble. Eso sÃƒÂ­, si somos de los amantes de la sangre, disfrutaremos tambiÃƒÂ©n mucho mÃƒÂ¡s con las animaciones de sus muertes.\nCon los enemigos mÃƒÂ¡s grandes habrÃƒÂ¡ que esforzarse el doble. Eso sÃƒÂ­, si somos de los amantes de la sangre, disfrutaremos tambiÃƒÂ©n mucho mÃƒÂ¡s con las animaciones de sus muertes.\nEsto que comentamos es especialmente notorio en la secciÃƒÂ³n a lomos de un caballo que ya tuvimos oportunidad de ver durante el E3, y que hemos probado de nuevo. AquÃƒÂ­ nuestro protagonista cabalga por un camino a toda velocidad, mientras enemigos a bordo de bestias le rodean por uno y otro lado y tratan de derribarle de su montura. Toda la secuencia es sencillamente espectacular, marcada por lo aparatoso de los combates y por las caÃƒÂ­das de nuestro personaje si es derribado por sus contrincantes y que nos llevarÃƒÂ¡n a combatir a ras de suelo y esperar a que nuestro caballo vuelva a pasar por nuestro lado y podamos seguir nuestro camino.\n\nCastlevania: Lords of Shadow se pondrÃƒÂ¡ a la venta presumiblemente en el mes de octubre, aunque esta fecha no estÃƒÂ¡ todavÃƒÂ­a confirmada. Veremos con ÃƒÂ©l cÃƒÂ³mo le sienta a un estudio nacional el hacerse cargo de una licencia tan poderosa como la de las series Castlevania. De momento las impresiones no podrÃƒÂ­an ser mÃƒÂ¡s positivas.","torrent":{"xt":"urn:btih:6da7d5a6bdfe45e01750c53fb28a8cc78f77e4ab","amp;dn":"Castlevania+Lords+Of+Shadow+%5BR.Free%5D%5BXbox360%5D%5BSpanish%5D%5Bwww.conso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6da7d5a6bdfe45e01750c53fb28a8cc78f77e4ab","infoHashBuffer":{"type":"Buffer","data":[109,167,213,166,189,254,69,224,23,80,197,63,178,138,140,199,143,119,228,171]},"announce":[],"urlList":[]}}