{"title":"Paula Abdul - Forever Your Girl (2nafish)","uid":5986283,"size":159305732,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6f1fa1297f7f2a0a3cd1ac72d50c69b5b6c58817&amp;dn=Paula+Abdul+-+Forever+Your+Girl+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1290753676,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n\n&quot;Forever Your Girl&quot; is a 1989 hit song by Paula Abdul, taken from the album of the same name. It was written and produced by Oliver Leiber.\n\nAfter the sudden massive success of &quot;Straight Up&quot;, Virgin Records quickly released another single to satisfy the public's newfound interest in Paula Abdul. It became the second #1 from her debut album, which would eventually yield a record of four #1 singles.\n\nThe song is about loyalty in a relationship. The female vocalist proclaims that, despite rumors that others may be interested in her, none of those matter because she will remain faithful to the man she loves; she will remain &quot;forever his girl.&quot; The single version differs slightly from the album version, as it uses more of the background male vocal and denser instrumentation.\n\nThe song was part of a medley Abdul sang at the 1989 MTV Music Video Awards.\n\n&quot;Forever Your Girl&quot; spent two weeks at the top of the Billboard Hot 100 in May 1989, and charted at #24 in the UK and #17 in Germany.\n\nThe video was directed by David Fincher, and featured Abdul acting as a choreographer and director of a children's performance (a 7-year-old Trevor Wright, 8-year-old Elijah Wood and 10-year-old Nikki Cox were among them). The &quot;Forever Your Girl&quot; video spent two weeks at number one on MTV's video rotation and helped establish Abdul as a leading visual entertainer.\n\nThe video also satirized Robert Palmer videos, having three little girls dressed like the three women who play backup guitars in his videos (black dresses, red lipstick, white makeup, and hair tied in buns).\n\nForever Your Girl is the debut album from singer Paula Abdul. It was released on June 13, 1988 and took 64 weeks from its release to hit number one on the Billboard 200 album sales chart, the longest an album has been on the market before hitting number one. The album was eventually certified seven times Platinum in the US and sold 12 million worldwide. It also included four number one Hot 100 singles - &quot;Straight Up&quot;, &quot;Forever Your Girl&quot;, &quot;Cold Hearted&quot;, and &quot;Opposites Attract.&quot; This ties for second most #1 songs from a single album, and is tied for the most number ones in a debut album. &quot;The Way That You Love Me&quot; reached #3 and &quot;Knocked Out&quot; reached #41.\n\nThe album also reached #4 on the R&amp;B album chart, while &quot;Straight Up,&quot; &quot;Opposites Attract,&quot; &quot;Knocked Out,&quot; and &quot;(It's Just) The Way That You Love Me&quot; all reached the top 10 of the R&amp;B tracks chart.\n\nAfter a slow start, the album's third single &quot;Straight Up&quot; helped the album breakout in spring/summer 1989 after its initial summer 1988 release. Forever Your Girl hit number one for the first time on October 7, 1989. After the release of the single &quot;Opposites Attract&quot;, it shot to number one spot again on February 3, 1990 and stayed there for nine consecutive weeks. At one point, Forever Your Girl reportedly sold 191,000 copies in a single day.\n\nPaula Abdul wrote one song on the Album, &quot;One or the Other&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6f1fa1297f7f2a0a3cd1ac72d50c69b5b6c58817","amp;dn":"Paula+Abdul+-+Forever+Your+Girl+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f1fa1297f7f2a0a3cd1ac72d50c69b5b6c58817","infoHashBuffer":{"type":"Buffer","data":[111,31,161,41,127,127,42,10,60,209,172,114,213,12,105,181,182,197,136,23]},"announce":[],"urlList":[]}}