{"title":"A-ha - Hunting High And Low (1985) WMA320","uid":6048894,"size":125979959,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6f7363d2948fed2032adee62ee406899fe68e8be&amp;dn=A-ha+-+Hunting+High+And+Low+%281985%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1292658722,"description":"When I first heard &quot;Take on me&quot; back in the 80's when I was 11-12 years old, I thought it was a cool new sound defining the growing new wave movement. I bought the cassette a couple of years later expecting it to be &quot;take on me&quot; and filler, as no other singles had been played from it. I was amazed as track after track of fantastic music kept me soaring on a musical cloud. They were immediately my favorite band, and I listen to a ton of other stuff. I have played this tape and it's replacement over and over for years, awestruck every time. The beautiful strings and guitar ballad &quot;Hunting high and low&quot; is one of the best songs ever written, a real tear-jerker. I play this song as part of my own musical repertoire, a-ha kept me inspired to become a musician myself. The child-like &quot;Living a boy's adventure tale&quot;, with the band's first use of clarinet is a masterpiece. The album includes vastly contrasted themes such as the dark and teen-spirited &quot;Dream myself alive&quot; and &quot;Here I stand and face the rain&quot;, probably my favorite song on the album with it's ethereal synths and haunting acoustic guitar and mysterious lyrics. The whole album rocks, soothes you, and trips you out from one song to the next. Lots of changing sounds and textures. Very talented musicians. I would say they are one of the top 5 most skilled users of synths. Skilled because they don't sound like computer music but rather like a pop orchestra with the great singer, lyrics, guitar, cool rhythms, nothing is overshadowed. All of their other albums are good too, but I agree with other reviewers that after &quot;Scoundrel Days&quot;, something was lost and the magic was not as strong as their first two albums. Their music became more organic, less youthful and dark, less colorful and changing. This album and really &quot;Scoundrel Days&quot; too, are must-haves for any music collection. I just wish they'd remaster them. \n\nby kozmikrokker\n\nTRACKLIST:\n\n01 - Take On Me.wma                                                             \n02 - Train Of Thought.wma                                                       \n03 - Hunting High And Low.wma                                                   \n04 - The Blue Sky.wma                                                           \n05 - Living A Boy's Adventure Tale.wma                                          \n06 - The Sun Always Shines On T.V..wma                                          \n07 - And You Tell Me.wma                                                        \n08 - Love Is Reason.wma                                                         \n09 - I Dream Myself Alive.wma                                                   \n10 - Here I Stand And Face The Rain.wma\n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:6f7363d2948fed2032adee62ee406899fe68e8be","amp;dn":"A-ha+-+Hunting+High+And+Low+%281985%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f7363d2948fed2032adee62ee406899fe68e8be","infoHashBuffer":{"type":"Buffer","data":[111,115,99,210,148,143,237,32,50,173,238,98,238,64,104,153,254,104,232,190]},"announce":[],"urlList":[]}}