{"title":"Patty Smyth - Downtown Train (2nafish)","uid":5955983,"size":153559044,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6fb47a834490285a29bb258443d998ab5e9c8eac&amp;dn=Patty+Smyth+-+Downtown+Train+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1289723455,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Downtown Train&quot; is a song by Tom Waits released on his album Rain Dogs in 1985.\n\nThe promo video for the song was directed by Jean-Baptiste Mondino and features the boxer Jake LaMotta.\n\nRod Stewart recorded a cover version that became a #3 hit on the Billboard Hot 100 chart after being released as a single in late 1989, and was also a #1 single on the album rock and adult contemporary charts. The song went to #1 in Canada and made the top 10 on the UK Singles Chart in 1990. Stewart also received a Grammy nomination for the song in the category Best Male Pop Vocal performance. Stewart's cover featured the slide guitar playing of Jeff Beck, who also appeared on the music video.\n\nOther artists who have covered &quot;Downtown Train&quot; include Mary Chapin Carpenter, who included it on her debut album Hometown Girl in 1987; and Patty Smyth, who released a version that same year that reached #95 on the Billboard Hot 100. Everything But the Girl also produced an acoustic cover of the song. Bob Seger also recorded a cover version of &quot;Downtown Train&quot; in 1989, but it was never released because Stewart's version had been released earlier.\n\nPatty Smyth (born June 26, 1957, New York) is an American rock and roll musician. She first enjoyed mainstream success in 1982 as lead singer of the band Scandal. That band's self-titled debut release became Columbia Records' biggest selling EP.\n\nNever Enough is the debut album by former Scandal frontwoman (and a singer-songwriter in her own right) Patty Smyth. It was released in 1987 on Columbia Records (also the group's label) three years after the band's breakup in 1984.\n\nInterestingly enough, in an interview Smyth gave on The Bloomberg Report, she is quoted as saying &quot;it (Smyth's solo debut) was never supposed to be a solo record; it was meant to be a record by Scandal Featuring Patty Smyth. Even though the band had broken up, I was still with Keith Mack; it was Zack &amp; I that had ended our partnership.&quot;\n\nThough she would have success as a songwriter later on, here she only co-wrote two tracks, the first and the last. It's also notable for including a cover version of the song &quot;Downtown Train&quot;, written by Tom Waits, which was covered that same year by country singer-songwriter Mary Chapin Carpenter for her album Hometown Girl.\n\nThe LP reached a peak of 66 in the U.S. and spawned three singles: the title track (#61 pop, #4 U.S. Mainstream Rock Tracks), &quot;Downtown Train&quot; (#95 pop, #40 Mainstream) and &quot;Isn't It Enough&quot; (failed to chart on pop, #26 Mainstream).\n\nOf note also is the production team. It was produced by William Wittman &amp; Rick Chertoff. Chertoff was one of the people on the production team of Cyndi Lauper's She's So Unusual, and would go on to work with platinum-selling singer-songwriter Joan Osborne on her 1995 album, Relish.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6fb47a834490285a29bb258443d998ab5e9c8eac","amp;dn":"Patty+Smyth+-+Downtown+Train+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fb47a834490285a29bb258443d998ab5e9c8eac","infoHashBuffer":{"type":"Buffer","data":[111,180,122,131,68,144,40,90,41,187,37,132,67,217,152,171,94,156,142,172]},"announce":[],"urlList":[]}}