{"title":"Distant Worlds -  Milestones in Planetary Exploration (2010) (Ma","uid":6097358,"size":40551660,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:701ab15a74d8df2d9b634c141fba517bd24f5e6b&amp;dn=Distant+Worlds+-++Milestones+in+Planetary+Exploration+%282010%29+%28Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"malestrom_HH","files":-1,"time":1294830387,"description":"Distant Worlds: Milestones in Planetary Exploration \nPublisher: Springer | ISBN: 0387402128 | edition 2010 | PDF | 325 pages\n\nThis book recounts the epic saga of how we as human beings have come to understand the Solar System. The story of our exploration of the heavens, Peter Bond reminds us, began thousands of years ago, with the naked-eye observations of the earliest scientists and philosophers. \n\nOver the centuries, as our knowledge and understanding inexorably broadened and deepened, we faltered many times, frequently labored under misconceptions, and faced seemingly insurmountable obstacles to understanding. Yet, despite overwhelming obstacles, a combination of determined observers, brilliant thinkers, courageous explorers, scientists and engineers has brought us, particularly over the last five decades, into a second great age of human discovery.\n\n\nAt our present level of understanding, some fifty years into the Space Age, the sheer volume of images and other data being returned to us from space has only increased our appetite for more and more detailed information about the planets, moons, asteroids, and comets of the Solar System. Taking a much-needed overview of how we now understand these &quot;distant worlds&quot; in our cosmic neighborhood, Bond not only celebrates the extraordinary successes of planetary exploration, but reaffirms an important truth: For seekers of knowledge, there will always be more to explore.","torrent":{"xt":"urn:btih:701ab15a74d8df2d9b634c141fba517bd24f5e6b","amp;dn":"Distant+Worlds+-++Milestones+in+Planetary+Exploration+%282010%29+%28Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"701ab15a74d8df2d9b634c141fba517bd24f5e6b","infoHashBuffer":{"type":"Buffer","data":[112,26,177,90,116,216,223,45,155,99,76,20,31,186,81,123,210,79,94,107]},"announce":[],"urlList":[]}}