{"title":"Kingdom Come - Do You Like It (2nafish)","uid":5948636,"size":133998596,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:70fca7017ddb4dffd42440e858ecfd825018e921&amp;dn=Kingdom+Come+-+Do+You+Like+It+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1289461148,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nIn Your Face is the second album by the band Kingdom Come.\n\nIn an interview, the band's members talk about the title of the album, saying that when you first look at the LP, you read &quot;Kingdom Come&quot;, than, as you move your eyes downwards, you read &quot;In your face&quot;. They laugh and say: &quot;Kingdom come ... in your face, get it?&quot;, making an obscene joke of it. (come - cum)\n\nKingdom Come is a hard rock band fronted by Hamburg-born vocalist Lenny Wolf. The group's first album, Kingdom Come was that band's only international hit. It currently consists of an entirely German line-up.\n\nThe musical style on Kingdom Come's debut album was very close to the early blues-rock style of English rock band Led Zeppelin, to the point that some listeners initially thought that Kingdom Come was actually a Led Zeppelin reunion. With a sound that was thought by many to be highly derivative of Led Zeppelin's, there was a backlash from critics, with the band being dubbed &quot;Kingdom Clone&quot; in the press.\n\nLed Zeppelin's guitarist and producer Jimmy Page himself commented in 1988:\n\n    Obviously it can get to the point where it gets past being a compliment, and it can be rather annoying, when you've got things like Kingdom Come, actually ripping riffs right off, that's a different thing altogether.\n\nIn 1988, the band released its debut LP, Kingdom Come. The band's first single, &quot;Get It On,&quot; was a big enough hit on AOR stations that the band's eponymous debut went gold. Their second single/video for the power ballad &quot;What Love Can Be&quot; received much airplay on US radio and MTV. By the time the single/video &quot;Loving You&quot; was released, the album had sold to platinum status in the United States, Germany and Canada, among other music markets. The band was chosen to open for the North American Monsters of Rock tour in 1988, supporting Dokken, Scorpions, Metallica and Van Halen. Following that, they were tapped to support the Scorpions on their North American &quot;Savage Amusement&quot; tour, until they were forced off. (According to Stag, Lenny Wolf found the stage ramps reserved for the Scorpions' set irresistible. After several reprimands from The Scorpions' management, the singer continued to use the full stage and the band was asked to forfeit the rest of the tour. Coincidentally, Scorpions were also signed to PolyGram, though only in America.)\n\nQuickly, the band was directed by management and Polygram to get a new recording available. In 1989, Kingdom Come released their next LP, called In Your Face. However, the subsequent backlash against the band's perceived appropriation of a similar Led Zeppelin sound (earning them the derisive moniker of &quot;Kingdom Clone&quot;) hurt their commercial appeal, and after the band's second album failed to sell well, all members other than Wolf quit the group.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:70fca7017ddb4dffd42440e858ecfd825018e921","amp;dn":"Kingdom+Come+-+Do+You+Like+It+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70fca7017ddb4dffd42440e858ecfd825018e921","infoHashBuffer":{"type":"Buffer","data":[112,252,167,1,125,219,77,255,212,36,64,232,88,236,253,130,80,24,233,33]},"announce":[],"urlList":[]}}