{"title":"Snap Timer","uid":6074033,"size":1539093,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:71320d25dd56e9d72733bafb6b06def56330b28c&amp;dn=Snap+Timer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DavyJones4ever","files":1,"time":1293748832,"description":"While looking for a simple timer to remind me of things to do while on my PC, I came across this little program and its perfect. Very simple to use with many possibilities and options. Use it once and you\\'ll have it locked on your taskbar.\n\n-----------------------------------------------------------------------------------\n\n\nSnapTimer 0.1\nA SnapMagic Software product\nWritten by Dan Hersam\nLicense: Freeware\n\nDescription and features\nSnapTimer is a simple, free, portable countdown timer for Windows.\n\nAll the timers I tested were too complex for my taste.  I decided to write one that was dead simple, so you could run it, type in a time and hit enter.  The aim of SnapTimer is to get out of the way and help you be productive.  It\\'s fast, lightweight and simple to use, but powerful too.\n\nA popular productivity strategy is to use a timer to do mini-sprints of work.  Using SnapTimer I\\'ve increased my productivity and reduced procrastination.  It\\'s easier to get yourself to work on a difficult task for 5 minutes because there\\'s a known end point.\n\n* Simple, clean interface\n* Displays time in the taskbar, as a hint in the tray and even in the right-click menu of the tray icon.\n* Tray icons indicate the mode of the timer (running, paused, completed)\n* Multiple alert types - message box, tray icon popup, audio file and any application\n* Stopwatch mode when you set minutes to 0\n* Play an optional ticking sound while the timer is running\n* Countdown can be paused and restarted, or reset\n* Portable (runs from your USB flash drive)\n* Can stay on top of other windows\n* No install required\n* Low RAM usage\n* Can automatically start counting down immediately\n* Includes over 20 loop-friendly alarm sounds (Meaning they\\'ll play over and over until you reset the timer)\n* Can automatically restart timer when it finishes\n* Lets you quickly and easily change the countdown time with mouse or keyboard shortcuts\n* Automatically saves all settings (optional)\n* Accepts time as command line argument, so you can create preset timer shortcuts or run the timer from a launcher (FARR, Launchy).\n* Can be minimized to tray\n* Supports multiple instances (You should disable always on top and probably autosave settings as well)\n* Can be docked to a corner, in the center or restore the last screen location\n* No internet access required\n* Doesn\\'t write to your registry\n* No ads, spyware or malware\n* 100% free\n","torrent":{"xt":"urn:btih:71320d25dd56e9d72733bafb6b06def56330b28c","amp;dn":"Snap+Timer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71320d25dd56e9d72733bafb6b06def56330b28c","infoHashBuffer":{"type":"Buffer","data":[113,50,13,37,221,86,233,215,39,51,186,251,107,6,222,245,99,48,178,140]},"announce":[],"urlList":[]}}