{"title":"Attentatet mot Hitler","uid":6054702,"size":263549255,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:727caf7a1efd4466b8720c1e3fc5a9d597edbafa&amp;dn=Attentatet+mot+Hitler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LowVideoQuality","files":2,"time":1292859494,"description":"Attentatet mot Hitler\n\nZDF enterprises to distribute HD drama-documentary on Valkyrie coup\nMainz, 1st October 2008\n\nAs of today, ZDF Enterprises is proud to include yet another important historical docu-drama in its sales catalogue: Stauffenberg - The True Story.\n\nFor once the title is fully deserved. This is as close as you can get to the July Plot, to Stauffenberg, and his motives for trying to kill Hitler. Claus von Stauffenberg's son, nephew, and the last eyewitnesses to Operation Valkyrie tell their stories.\n\nWe follow Stauffenberg minute by minute, closing in on Hitler at the Wolf's Lair - and later launching Operation Valkyrie in Berlin to overthrow the Nazi regime.\n\nWe learn: how tough it was to get close to Hitler - and why a wounded battle veteran with one eye and three fingers was the only man in Germany in a position both to kill Hitler and topple his government.\n\nThe 'star' of the 52' HD film is 86-year-old Ewald von Kleist, then a 22-year-old conspirator. He describes Stauffenberg's inspiring leadership, and recalls the last desperate hours of the Valkyrie coup. (Kleist is a genuine hero. He had himself planned to kill Hitler in a suicide attack, until allied bombs forced the meeting's cancellation).\n\nThe film is high in tension, emotion and unexpected humour, as it recounts Stauffenberg's journey from German patriot and passionate soldier, to resistant and would-be assassin - to his death on the night of the putsch. This is a rounded portrait of a man who teased and provoked his friends and fellow-officers, 'always playing devil's advocate', as his daughter recalls. For a long time he held back from the Resistance. But once he decided to act, he went further than anyone else could go.\n\nHistorian Richard Overy is our guide through the historical background.\n &lt;a href=&quot;\nhttp://www.zdf-enterprises.de/en/_stauffenberg_the_true_story.16086.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.zdf-enterprises.de/en/_stauffenberg_the_true_story.16086.htm&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1360221/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1360221/&lt;/a&gt;\n\nStauffenberg - Die wahre Geschichte\n\nStauffenberg - The True Story","torrent":{"xt":"urn:btih:727caf7a1efd4466b8720c1e3fc5a9d597edbafa","amp;dn":"Attentatet+mot+Hitler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"727caf7a1efd4466b8720c1e3fc5a9d597edbafa","infoHashBuffer":{"type":"Buffer","data":[114,124,175,122,30,253,68,102,184,114,12,30,63,197,169,213,151,237,186,250]},"announce":[],"urlList":[]}}