{"title":"Bambi(1942)DVDRip.AC3(ENG)-DROCK","uid":6098023,"size":733149184,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:73590a42c3e1b7b711e4e92c4ab1e333d0aabe9d&amp;dn=Bambi%281942%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1294853882,"description":"The classic Felix Salter story Bambi provides the basis for this near-perfect Disney animated feature. We follow the male deer Bambi from birth, through his early childhood experiences with woodland pals Thumper the rabbit and Flower the skunk, the traumatic sudden death of Bambi's mother at the hands of hunters, his courtship of the lovely doe Faline, and his rescue of his friends during a raging forest fire; we last see the mature, antlered Bambi assuming his proper place as the Prince of the Forest. In the grand Disney tradition, Bambi is brimming with unforgettable sequences, notably the young deer's attempts to negotiate an iced-over pond, and most especially the death of Bambi's mother--and if this moment doesn't move you to tears, you're made of stone (many subsequent Disney films, including Lion King, have tried, most in vain, to match the horror and pathos of this one scene). The score in Bambi yielded no hits along the lines of &quot;Whistle While You Work&quot;, but the songs are adroitly integrated into the action. Bambi was the last of the &quot;classic&quot; early Disney features before the studio went into a decade-long doldrums of disjointed animated pastiches like Make Mine Music. \n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:73590a42c3e1b7b711e4e92c4ab1e333d0aabe9d","amp;dn":"Bambi%281942%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73590a42c3e1b7b711e4e92c4ab1e333d0aabe9d","infoHashBuffer":{"type":"Buffer","data":[115,89,10,66,195,225,183,183,17,228,233,44,74,177,227,51,208,170,190,157]},"announce":[],"urlList":[]}}