{"title":"Mision X.(Cap. 1 y 2 de 4).(Docu.Spanish).","uid":6045041,"size":1153470464,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:735a5b3174069bd67f7f16cde942e1060e98d9d5&amp;dn=Mision+X.%28Cap.+1+y+2+de+4%29.%28Docu.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cholo24","files":-1,"time":1292524674,"description":"Mision X\n\nProductora: ZDF, Engstfeld Film.\nDirector: Oliver Frohnauer\nGuiÃƒÂ³n: Christian Heynen\nDuraciÃƒÂ³n aprox de cada episodio: 50 min.\nNacionalidad: Alemania\n\nCapitulo 1: La evoluciÃƒÂ³n del telÃƒÂ©fono\nArgumento:\nLa &quot;aldea global&quot;, la &quot;sociedad multimedia&quot;, las redes de comunicaciÃƒÂ³n: nuestra sociedad hoy en dÃƒÂ­a se caracteriza por la comunicaciÃƒÂ³n simultÃƒÂ¡nea e ilimitada. Hablar con gente de Australia por telÃƒÂ©fono, chatear en lÃƒÂ­nea con alguien en Argentina, o enviar fotos de tus vacaciones directamente desde la playa vÃƒÂ­a telÃƒÂ©fono mÃƒÂ³vil. Todo esto forma parte de nuestra vida cotidiana en el siglo XXI y comenzÃƒÂ³ gracias a Alexander Graham Bell. Para el escocÃƒÂ©s fue un camino arduo y lleno de contratiempos, una verdadera historia de David contra Goliat. Fue una lucha contra los espÃƒÂ­as y las artimaÃƒÂ±as de la corporaciÃƒÂ³n mÃƒÂ¡s poderosa de aquella ÃƒÂ©poca, que hizo todo lo posible para paralizar el invento de Bell. A dÃƒÂ­a de hoy, que Bell sea reconocido como el inventor del telÃƒÂ©fono sigue estando bajo disputa.\n\ncapitulo 2: El primer oleoducto\nArgumento:\nEn 1878 John D. Rockefeller controlaba desde hacÃƒÂ­a aÃƒÂ±os las empresas ferroviarias que transportaban el petrÃƒÂ³leo a las refinerÃƒÂ­as que ÃƒÂ©l monopolizaba. Mientras Rockefeller fijaba los precios y se enriquecÃƒÂ­a, el resto sÃƒÂ³lo ganaban una pequeÃƒÂ±a parte de los beneficios. Los periÃƒÂ³dicos se referÃƒÂ­an a esta lucha feroz por el control del negocio del petrÃƒÂ³leo como &quot;la guerra del petrÃƒÂ³leo&quot;. Otro empresario, Byron Benson sorprendiÃƒÂ³ a todos con un plan audaz de bombear el petrÃƒÂ³leo directamente en las pocas refinerÃƒÂ­as independientes que quedaban en la costa este a travÃƒÂ©s de una tuberÃƒÂ­a de metal. MarcÃƒÂ³ el iniciÃƒÂ³ de una de las mayores aventuras del siglo XIX. La batalla por construir una tuberÃƒÂ­a de acero hasta dicha costa se librÃƒÂ³ durante aÃƒÂ±os, tanto en los tribunales como en el ruedo polÃƒÂ­tico, y se llevÃƒÂ³ incluso a pie de obra con violencia fÃƒÂ­sica. Investigamos los proyectos de oleoductos mÃƒÂ¡s ambiciosos del mundo en las hostiles profundidades de los ocÃƒÂ©anos asÃƒÂ­ como en tierra firme, mostrando cÃƒÂ³mo estas mega-tuberÃƒÂ­as se basan en las ideas desarrolladas por Benson para crear el primer oleoducto en la historia\n\n","torrent":{"xt":"urn:btih:735a5b3174069bd67f7f16cde942e1060e98d9d5","amp;dn":"Mision+X.%28Cap.+1+y+2+de+4%29.%28Docu.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"735a5b3174069bd67f7f16cde942e1060e98d9d5","infoHashBuffer":{"type":"Buffer","data":[115,90,91,49,116,6,155,214,127,127,22,205,233,66,225,6,14,152,217,213]},"announce":[],"urlList":[]}}