{"title":"~ Jason Malachi - Critical 2010 @ 192kbps ~","uid":6110146,"size":60367864,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:758f703535d2f6b7f6a01c665700fb33fb23f17b&amp;dn=%7E+Jason+Malachi+-+Critical+2010+%40+192kbps+%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kartoffel18","files":13,"time":1295320097,"description":"\n The Mystery Man. Well, he\\\\\\'s Jason Malachi. A mind blowing, eye-popping, break dancing Italian kind of guy ready to unleash his powered force into the wild. Born in the outskirts of Washington, DC, Jason feels that music has always been a major part of his IDENTITY.\n\n    Well, just by the voice you hear you can almost guess who his inspiration is, but believe it or not Frank Sinatra was his first inspiration and Nat King Cole, Judy Garland, James Brown, Jackie Wilson, Gene Kelly and Fred Astaire to name a few. Growing up and exposing himself to the streets, he was captivated by the Break-Dance era and couldnt resist the temptation of breaking out a card board box. He started break dancing at age 5. But out of all of that dancing, \\\\\\&quot;Nothing caught my attention more than watching this Anti-Gravity like figure sliding across stages worldwide.\\\\\\&quot; You guessed it, none other than the King of Pop himself.\n\n    At the tender age of 9, Jason recalls staying up late with his uncle singing old Duop songs from groups like The Duprees and The Flamingos, as well as singing all his favorite Motown classics.\n\n    Artists such as Smokey Robinson, The Jackson 5, The Supremes, Marvin Gaye and Stevie Wonder had Jason hooked on that Motown sound. That Sound helped to better enhance the depth of his musical style.\n\n    Growing up as a teenager, you couldnt help getting consumed and inspired by the Hip-Hop culture. Not only can you be amazed by the breathy falsetto, but Jason has got the full package. He sings, dances, and choreographs and his ultimate favorite performing Live. He was once voted the best performing artist of his school and received a scholarship to Motion Mania Dance School. He also writes his own music, which coming from the heart is his motto. \\\\\\&quot;I really love the level of creativity that can be reached while in the studio atmosphere. I feel that my best writing occurs when I am alone, however, I do enjoy collaborative work.\\\\\\&quot;\n\n    He has worked with producers such as: Damon Sharpe (Damon Sharpe Music), Wayne M. Wilson, Tony Kurtis (Da Platinum House), Eddy Jenkins (Midas Touch), Eugene Hanes (Divine Mill), Big Dog Productions, Yewmon Byers (East Coast Studios), &amp; BlackHouse Entertainment.\n\n    When in the studio, he\\\\\\'s collaborating with artists such as Dru Hill, Ruff Endz, Davinch, Ray Jay, Mr. Slick, Calico, Paula Campbell and Tony Kurtis.\n\n    \\\\\\&quot;I have an influential, yet original sound and style. I always welcome criticism; whether it is positive, negative or constructive. I am confident with my talents, yet I am exceedingly grateful. I always strive for perfection and pray for the very best.\\\\\\&quot;\t\t","torrent":{"xt":"urn:btih:758f703535d2f6b7f6a01c665700fb33fb23f17b","amp;dn":"%7E+Jason+Malachi+-+Critical+2010+%40+192kbps+%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"758f703535d2f6b7f6a01c665700fb33fb23f17b","infoHashBuffer":{"type":"Buffer","data":[117,143,112,53,53,210,246,183,246,160,28,102,87,0,251,51,251,35,241,123]},"announce":[],"urlList":[]}}