{"title":"Zero Oil Cooking by SAAOL","uid":6065064,"size":510595331,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:75caa4061096dfa4c4626555b2a410d5f2f28ec4&amp;dn=Zero+Oil+Cooking+by+SAAOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Sonel","files":3,"time":1293312337,"description":"It is assumed that all Indian foods are spicy &amp; full of fat/oils.\nSo a health conscious person or a cholesterol level conscious heart patient can not eat those.\n\nHere are the recipe of conventional Indian food items without a drop of oil. This invention is by SAAOL. Dr. Bimal Chhajer have invented this method with the help of a local dietitians. This food habit is an ideal way to live with heart disease/Cholesterol problem. Even this high level of restriction in food habit can also help reduce cholesterol so much that with some medications a person can also avoid heart surgery(bypass Surgery).\n\nThis is not a mere cooking show of conventional Indian food item cooking. Rather its a medical science revealed in India to live Indians healthy. Here doctor even appear as cook; as according the doc living on wrong food habit &amp; only taking medicines &amp; operations on heart can not cure heart disease.\n\n'WHO' is also suspecting Heart Disease would be a one of the big reason in future in mortality ate of India.\n\nAudio Language: Hindi(Indian language)\nVideo: MPEG 1 (VCD)\nImage: .nrg (Nero image)[intact VCD image]\n\nMount with Nero image drive or any drive which support .nrg extension.\nAlternatively you can burn it by Nero. 100% VCD/DVD player compatible.\nRoxio player is included in the image which will automatically stat to play the content if image is mounted by correct image drive on Windows XP. Alternatively if image is mounted in correct way then you can play it with favorite WMP or any VCD play back software.\n\nIf you like it please seed. I can not keep it alone for long.","torrent":{"xt":"urn:btih:75caa4061096dfa4c4626555b2a410d5f2f28ec4","amp;dn":"Zero+Oil+Cooking+by+SAAOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75caa4061096dfa4c4626555b2a410d5f2f28ec4","infoHashBuffer":{"type":"Buffer","data":[117,202,164,6,16,150,223,164,196,98,101,85,178,164,16,213,242,242,142,196]},"announce":[],"urlList":[]}}