{"title":"Democracy Now - 18 jan 2011","uid":6112103,"size":447948637,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7626c4e2c4a5c131edd1857ee60d8ad22e0408a9&amp;dn=Democracy+Now+-+18+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1295392805,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 18, 2011\n\n- Tunisian Leader Ousted in Mass Uprising; Protesters Denounce Old Guard in New Gov't\n- U.S. Plans to Move Arizona Shooting Trial\n- College Releases Loughner Video\n- Giffords' Recovery Improves, Upgraded to Serious\n- Shooting Victim Arrested for Threatening Tea Party Member\n- House to Vote on Healthcare Repeal\n- Poll: Support for Healthcare Repeal Drops\n- Study: 129 Million Americans Suffer Pre-Existing Medical Conditions\n- 56 Killed in Iraq Suicide Bombing\n- South Sudan Referendum Expected to Back Independence\n- Prosecutors Issue Draft Indictments in Hariri Probe\n- Ex-Dictator &quot;Baby Doc&quot; Returns to Haiti\n- Former Banker Hands Offshore Account Data to WikiLeaks\n- Israel to Build 1,400 New Settlement Homes\n- Israeli Gov't to Probe Human Rights Groups\n- Blackwater-Linked Firm Awarded U.S. Contract in West Bank\n- 3 Arrested in MLK Day Protest at Tucson Military Base\n- Protesters Rally in Support of Manning, Targeted Activists\n\n\nSpecial reports\n\n- Tunisian Opposition Activist: &quot;Is Democracy Possible in the Arab World? Tunisians from All Around Tunisia are Saying 'Yes'&quot;\n\nTunisia has announced an interim national unity government days after a popular revolt ousted the president from power in the first Middle East revolution in a generation. President Zine El Abidine Ben Ali fled Tunisia on Friday after a month of unprecedented protests gripped the country. Thousands took to the streets to demonstrate against unemployment, high food prices, corruption and government repression. At least 80 people were killed in a crackdown by government security forces. We go to the capital city Tunis to speak with opposition activist, Fares Mabrouk.\n\n\n- Egypt-Based Political Analyst: &quot;The First Lesson from Tunisia is that Revolution is Possible&quot;\n\nWe speak to Issandr El Amrani, an independent political analyst and writer based in Cairo who writes the popular blog Arabist.net. He says the revolution in Tunisia is having an electrifying effect throughout the Arab world. &quot;The first lesson from Tunisia is that revolution is possible,&quot; says El Amrani. &quot;You have to remember that there hasn't been anything like this in the Arab world for decades.&quot;\n\n\n- Juan Cole: Tunisia Uprising &quot;Spearheaded by Labor Movements, by Internet Activists, by Rural Workers; It's a Populist Revolution&quot;\n\nIn the wake of the ouster of Tunisian President Zine El Abidine Ben Ali, we speak with University of Michigan History Professor Juan Cole. &quot;This is the first popular revolution since 1979,&quot; Cole says. &quot;This revolution so far has been spearheaded by labor movements, by internet activists, by rural workers. It's a populist revolution, and not particularly dominated in any way by Islamic themes, it seems to be a largely secular development.&quot;\n\n\n- Anthony Shadid in Beirut: Tunisia Has &quot;Electrified People Across the Arab World&quot;\n\nWe speak with journalist Anthony Shadid, two-time Pulitzer Prize winner, who is in Beirut where the government collapsed last week. Tunisia has &quot;electrified people across the Arab world,&quot; Shadid says, &quot;mainly for that prospect of change, that change can actually occur in a lot of countries that seem almost ossified at this point.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7626c4e2c4a5c131edd1857ee60d8ad22e0408a9","amp;dn":"Democracy+Now+-+18+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7626c4e2c4a5c131edd1857ee60d8ad22e0408a9","infoHashBuffer":{"type":"Buffer","data":[118,38,196,226,196,165,193,49,237,209,133,126,230,13,138,210,46,4,8,169]},"announce":[],"urlList":[]}}