{"title":"Pearl_Jam_1990_to_1999","uid":6036185,"size":18551885387,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:76b6a85a751f364e376b5e99d236dabf52c5bca5&amp;dn=Pearl_Jam_1990_to_1999&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Roach131313","files":2014,"time":1292235920,"description":"So I recently found an old hard drive of mine that was stashed away in a closet for about 5 years and on it I found all my old Pearl Jam music files.  These were amassed through years of collecting and trading back when there were a lot more music trading websites around.  In this torrent there are over 2000 files, &gt;17GB of live Pearl Jam music from 1990 to 1999.  In 2000 Pearl Jam started releasing their \\&quot;official\\&quot; bootlegs, so that is why I stopped there - the quality of the official soundboard sourced CDs was much better than the bootlegs contained in these files.\n\nSome of the concerts are in the mp3 format, others are in the lossless FLAC format.  Some have .txt files that detail their source, others don\\'t.  File names are not completely standardized, but concerts and years are placed in their proper folders.\n\nI considered listing the concert dates here in the description, but there\\'s too many folders to go through.  If you REALLY need a comprehensive list, ask nicely in the comments and I\\'ll consider it.\n\nSome highlights are the Pearl Jam, Nirvana, Red Hot Chili Peppers concert at the Cow Palace from 12/31/1991 - The entire Monkey Wrench Pirate Radio Broadcasts from \\'95 (I think) and \\'98 (Including special guests) - and a few Bridge School Benefits...\n\nHope you all enjoy this extensive collection of a decade of Pearl Jam concerts.","torrent":{"xt":"urn:btih:76b6a85a751f364e376b5e99d236dabf52c5bca5","amp;dn":"Pearl_Jam_1990_to_1999","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76b6a85a751f364e376b5e99d236dabf52c5bca5","infoHashBuffer":{"type":"Buffer","data":[118,182,168,90,117,31,54,78,55,107,94,153,210,54,218,191,82,197,188,165]},"announce":[],"urlList":[]}}