{"title":"Chatroom 2010(NLsubs)(R5)(rocco)","uid":5968566,"size":4647907068,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7a15b294758010b0c4722bb79d6f582650621449&amp;dn=Chatroom+2010%28NLsubs%29%28R5%29%28rocco%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rocco64","files":-1,"time":1290196354,"description":"\n \nChatroom (2010) \n\n\n\nVerenigd Koninkrijk\nDrama / Thriller\n97 minuten\n\ngeregisseerd door Hideo Nakata\nmet Aaron Johnson, Imogen Poots en Hannah Murray\n\n\n\nNederlands:\n\n\n\nWanneer de tieners Jim, Eva, Emily en Mo Willam online ontmoeten worden ze verleid door zijn charmes. \nMaar William is niet wie hij lijkt en heeft geen tijd voor mensen in de echte wereld. \nJim is kwetsbaar en heeft geen idee hoe gevaarlijk zijn vriendschap met William is en \nwanneer Jim verteld dat hij aan de antidepressiva zit weet William dat hij een slachtoffer heeft gevonden. \nHij bied aan om Jim te helpen van de medicijnen af te komen. Wanneer Eva en Mo inzien wat voor dodelijk spel Willam speelt proberen ze Jim te helpen. \nWat volgt is een dodelijk kat en muis spel over het internet. Wanneer William en Jim oog in oog staan in de metro ontmoet fantasie de werkelijkheid.\n\n\n\nEngels:\n\n\n\nWhen jaded teens Jim, Eva, Emily and Mo meet William online, they're seduced by his charisma. But William isn't what he seems. \nHe's calculating and manipulative and doesn't have time for people in the real world. \nJim is vulnerable and he has no idea how dangerous his new friendship with William will be. \nWhen Jim confesses he's on anti-depressants, William knows he's found a victim. He vows to help Jim off his drugs, and the rest of the group fall in line. \nWhat begins as friendly advice to help Jim becomes twisted and Eva and Mo realise the deadly game William's playing, \nbut the wheels are in motion. Jim is set on a path of self- destruction, and is going to do the unthinkable. \nAs Eva, Emily and Mo try to save Jim, William begins a terrifying game of cat and mouse chasing them across the internet, shutting down their systems, and cutting them off from his victim. \nFantasy meets reality when William and Jim are face to face in rush hour on the underground. Without the faceless security of the online world, everything becomes real. \nIt's now a race against time to save Jim, but the clock is ticking... and we fear someone must die. \n\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : R5\nAudio         : Engels DD 5.1\nOndertitels   : Nederlands (instelbaar)\nCover &amp; Label : Ja\nGenre         : Drama/Thriller\n  &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/53419&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/53419&lt;/a&gt; \n\n       &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1319704/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1319704/&lt;/a&gt;\n \n \n \nBrought to you by\n\nRocco","torrent":{"xt":"urn:btih:7a15b294758010b0c4722bb79d6f582650621449","amp;dn":"Chatroom+2010%28NLsubs%29%28R5%29%28rocco%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a15b294758010b0c4722bb79d6f582650621449","infoHashBuffer":{"type":"Buffer","data":[122,21,178,148,117,128,16,176,196,114,43,183,157,111,88,38,80,98,20,73]},"announce":[],"urlList":[]}}