{"title":"Two and a Half Men, TVSeries (divx), S07E09-12, NL Subs, DMT","uid":6216809,"size":981267226,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7a270f449dda4d9ffc3c16dac76f615746ad39a0&amp;dn=Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S07E09-12%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"MeMar","files":-1,"time":1299189198,"description":"Two and a Half Men, TVSeries (divx), S07E09-12, NL Subs, DMT\n\n\nVerenigde Staten\nCategorie: Beeld\nFormaat: DivX\nOndertitels (ingebakken): Nederlands\nGenre: Sitcom\nBron: Retail\nDuur: ongeveer 20 minuten per aflevering\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0369179/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0369179/episodes&lt;/a&gt; &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&lt;/a&gt;\n\nDe hoofdrollen worden vertolkt door Charlie Sheen, Jon Cryer en Angus T. Jones.\n\nIn seizoen 7 heeft Cupido eindelijk zijn pijlen gericht op het hart van Charlie Harper, \nin plaats van op een ander lichaamsdeel - en het was helemaal raak. Jazeker, Charlie heeft ontdekt dat Chelsea serieus is en \nin seizoen 7 probeert hij alles om haar vast te houden. Aardig zijn voor haar ouders. Doen alsof hij luistert als ze praat. \nZelfs, ehm, trouw blijven. (Proberen, zeiden we.) Dat betekent een hoop lol voor de fans van de mannen. Maar Charlie is niet \nde enige Harper die vast zit in het liefdesweb. Alan is ervan overtuigd dat hij alleen wat meer haar nodig heeft voor \nde status van dekhengst, dus probeert hij de variant uit een spuitbus. En Jake besluit dat hij de ruwe golven van het daten \nop tienerleeftijd wel door zal komen met wat advies. Van Charlie.\n\nAflevering 9: Captain Terry's Spray-On Hair\nCharlie wordt plots onzeker wanneer hij ontdekt dat Chelsea geen orgasme had tijdens hun laatste vrijpartij. \nVastberaden om deze scheve situatie recht te trekken, bereidt hij een romantisch avondje voor. \nMaar ook dat brengt geen zoden aan de dijk. Al snel ontdekt wat er scheelt : Chelsea voelt zich niet goed in \nhaar vel omdat haar ex op het punt staat opnieuw te trouwen\n\nAflevering 10:  That's Why They Call It Ball Room\nChelsea wil dat Charlie danslessen volgt zodat ze geen slecht figuur slaan op hun huwelijksfeest. Na lang aandringen \nzegt Charlie toe, maar hij stelt daar iets tegenover: hij wil dat ze een voorhuwelijkscontract afsluiten. \nHierdoor ontdekt hij dat Chelsea iets voor hem heeft verzwegen: ze bezit drie appartementsgebouwen en trouwt dus\n niet met hem voor het geld. Dat verontrust Charlie.\n\nAflevering 11: Warning, It's Dirty\nJakes vriendin Celeste brengt de feestdagen door bij haar moeder in Brentwood. Charlie spoort Jake aan om ondertussen \nkennis te maken met een knap tienermeisje op het strand. Jake volgt het advies van zijn oom, maar dat dreigt hem zuur \nop te breken. Ondertussen brengt Evelyn een oude man in een rolstoel mee naar het kerstfeest van de Harpers. \nDit roept meteen de nodige vragen op bij haar zonen.\n\nAflevering 12: Fart Jokes, Pie and Celeste\nCharlie voelt zich verantwoordelijk voor de breuk van Jake en Celeste. Om zijn neefje te helpen, spoort hij hem aan om zich \nte verontschuldigen en als dat niet helpt, met andere meisjes af te spreken. Ondertussen krijgt Herb het zwaar te verduren \nwanneer Judith ontdekt dat hij tijd doorbrengt met Alan. Herb besluit dan maar stiekem af te spreken met Alan.\n\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:7a270f449dda4d9ffc3c16dac76f615746ad39a0","amp;dn":"Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S07E09-12%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a270f449dda4d9ffc3c16dac76f615746ad39a0","infoHashBuffer":{"type":"Buffer","data":[122,39,15,68,157,218,77,159,252,60,22,218,199,111,97,87,70,173,57,160]},"announce":[],"urlList":[]}}