{"title":"Democracy Now - 10 dec 2010","uid":6028757,"size":449232404,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7a7a188caa4af9dfbeab5ddf7754d611afc3bfda&amp;dn=Democracy+Now+-+10+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1291998501,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 10, 2010\n\n- U.N. Human Rights Chief Concerned Over WikiLeaks Targeting\n- Cables: Pfizer Targeted Nigerian Attorney General in Drug Case\n- Alleged Nuclear, Missile Site Reported in Burma\n- Military Bars Removable Media Devices to Stem Leaks\n- Lula Backs WikiLeaks Release\n- House Dems Reject Obama-GOP Tax Deal\n- Senate GOP Blocks Don't Ask Don't Tell Repeal, DREAM Act, 9/11 Settlement\n- Liu Xiaobo Awarded Nobel Prize\n- Thousands Protest Student Fee Hikes in Britain\n- Free Speech Radio News Faces Closure\n\n\nSpecial reports\n\n- Nobel Awarded to Jailed Chinese Human Rights Activist Liu Xiaobo\n\nThe jailed Chinese human rights activist and writer Liu Xiaobo has been awarded this year's Nobel Peace Prize in Olso. Liu was sentenced to 11 years in prison last year after spearheading a petition calling for freedom of assembly, expression and religion in China. For the first time since the 1930s, a representative of the winner is not on hand to collect the award.\n\n\n- China Faces International Criticism at Nobel Ceremony in Olso and Climate Talks in CancÃƒÂºn\n\nThe Nobel Committee's decision to award Liu Xiaobo has enraged the Chinese government. In CancÃƒÂºn, Chinese climate negotiators reportedly refused to talk with their Norwegian counterparts. We discuss China's reaction to Xiaobo's award and its role at the climate talks with Lucia Green-Weiskel of the Beijing-based Innovation Center for Energy and Transportation.\n\n\n- Bolivian President Evo Morales at Cancun Climate Summit: WikiLeaks Cables Reveal &quot;Diplomacy of Empire&quot;\n\nSpeaking at the U.N. Climate Change Conference, Bolivian President Evo Morales warned against throwing out the Kyoto Protocol, saying such a move could result in ecocide or genocide. Bolivia has become a leading critic of how the climate talks have developed and of last year's U.S.-backed Copenhagan Accord. At a news conference, Morales also talked about U.S. dispatches on Bolivia unearthed by WikiLeaks, and his response to recent criticism from Nobel Prize winner Mario Vargas Llosa.\n\n\n- While Climate Talks Falter Behind Tight Security Cordon, Thousands Converge at Via Campesina's Alternative Summit\n\nOn the final scheduled day of the U.N. Climate Change Conference, negotiations remain deadlocked and negotiators are scrambling to come up with some form of agreement to prevent the talks from collapsing. Thousands of delegates from around the world have been meeting at the plush Moon Palace Hotel, which has been surrounding by a tightly controlled security cordon. More than 20 miles away, in downtown CancÃƒÂºn, thousands of peasant farmers, indigenous people and social movements from across the globe have gathered at an alternative summit organized by Via Campesina. We speak to John Vidal, the environment editor at the Guardian newspaper.\n\n\n- Whistleblower Daniel Ellsberg: Julian Assange is Not a Terrorist\n\nWikiLeaks founder Julian Assange will remain in a London prison until a British court takes up a Swedish request for extradition for questioning on sexual crime allegations. An international group of former intelligence officers and ex-government officials have released a statement in support of Assange. We speak to one of the signatories, Daniel Ellsberg, the famous whistleblower who leaked the Pentagon Papers about the Vietnam War in 1971. &quot;If I released the Pentagon Papers today, I would be called a terrorist,&quot; Ellsberg says. &quot;Bradley Manning and Julian Assange are no more terrorists than I am, and I am not.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7a7a188caa4af9dfbeab5ddf7754d611afc3bfda","amp;dn":"Democracy+Now+-+10+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a7a188caa4af9dfbeab5ddf7754d611afc3bfda","infoHashBuffer":{"type":"Buffer","data":[122,122,24,140,170,74,249,223,190,171,93,223,119,84,214,17,175,195,191,218]},"announce":[],"urlList":[]}}