{"title":"Monkey See&lt; Monkey Do","uid":5972556,"size":2143841353,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7a9120e8c2eab6d5a8c046733c2255b358354e00&amp;dn=Monkey+See%3C+Monkey+Do&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zsodo","files":1,"time":1290299442,"description":"The latest release from the multi-award winning Hot Aches Productions, the makers of E11 and Committed. This collection of four films features world class climbing from the UK, Canada and Madagascar.\n\nSlate Monkeys \nSet in the post industrial landscape of disused Welsh slate quarries, three very different climbers battle their way up some unusual climbing. Matt Segal, Hazel Findlay and Johnny Dawes take it in turn to crimp, palm, squirm and wriggle their way up the esoteric route, Gin Palace. But whose technique will prove successful?\n\nSingle-Handed \nWinner of 'People's Choice' and 'Best Climbing Film' at the Edinburgh Mountain Film Festival \nKevin Shields is known as the 'one handed climber'. Despite being born with most of his left hand missing Kevin has shocked the climbing world with some daring and inspirational ascents. The film exposes Kevin's motivations and follows his progression through the climbing grades, culminating in a gripping and palm-sweating attempt to solo E6 in Glen Nevis.\n\nLittle Big-Walling in Madagascar \nThe West Face of Karimbony in the Tsaranoro Massif is home to one of the world's hardest big-wall free climbs, &quot;Tough Enough?&quot;. James McHaffie and a team of top UK climbers head to Madagascar to find out if this route is indeed tough enough.\n\nHey Presto \nWinner of 'Best Short Film' at the 2010 Squamish Mountain Festival \nWorld class climber Sonnie Trotter teams up with world class belayer Cory Richards to take on the Squamish classic, 'Presto'. The film examines what it takes to belay on some the world's hardest climbs.","torrent":{"xt":"urn:btih:7a9120e8c2eab6d5a8c046733c2255b358354e00","amp;dn":"Monkey+See%3C+Monkey+Do","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a9120e8c2eab6d5a8c046733c2255b358354e00","infoHashBuffer":{"type":"Buffer","data":[122,145,32,232,194,234,182,213,168,192,70,115,60,34,85,179,88,53,78,0]},"announce":[],"urlList":[]}}