{"title":"Pacifico Sur 6 de 6 - Un paraiso fragil [dvdrip][spanish]","uid":6050138,"size":655405056,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7b1945dd4dc9e809208aab7432afad8026275402&amp;dn=Pacifico+Sur+6+de+6+-+Un+paraiso+fragil+%5Bdvdrip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"furtaperas","files":-1,"time":1292694051,"description":"El documental 'PacÃƒÂ­fico Sur' es la ÃƒÂºltima gran producciÃƒÂ³n en las series de BBC.\n\nGalardonada por la Unidad de Historia Natural, el documental recorre en seis episodios, la extraordinaria fauna, cultura e historia del ocÃƒÂ©ano mÃƒÂ¡s sorprendente y menos conocido de la Tierra: el PacÃƒÂ­fico Sur.\n\nFormado por miles de islas tan desconocidas como fascinantes, la gran masa de agua del PacÃƒÂ­fico -ÃƒÂºnicamente el 1% de su extensiÃƒÂ³n es tierra- dibuja una imagen paradisÃƒÂ­aca de naturaleza salvaje y exÃƒÂ³ticas historias humanas. Sin embargo, nada es lo que parece en este ocÃƒÂ©ano de contrastes e inmensa soledad.\n\nCualquier imagen idealizada sobre la vida en las islas -vacaciones de ensueÃƒÂ±o en hermosas playas desiertas y tranquilas aguas tropicales- poco o nada tiene que ver con la realidad. Un entorno de gran actividad volcÃƒÂ¡nica y con una meteorologÃƒÂ­a cambiante donde conviven seres vivos que han evolucionado hasta convertirse en rarezas ÃƒÂºnicas en su especie.\n\nRodada en alta definiciÃƒÂ³n a lo largo de tres aÃƒÂ±os, la serie muestra espectaculares imÃƒÂ¡genes del PacÃƒÂ­fico Sur con una complejidad tÃƒÂ©cnica nunca vista hasta ahora -como enormes barreras de olas grabadas en supercÃƒÂ¡mara lenta o volcanes acuÃƒÂ¡ticos filmados en time-lapse (secuencia de vÃƒÂ­deo acelerada) y tomas aÃƒÂ©reas con sistemas de ÃƒÂºltima generaciÃƒÂ³n.\n\nEl equipo, entre los que se encuentran los responsables de la premiada Planeta Tierra, Huw Cordey (el episodio Cuevas) y Mark Brownlow (productor de los episodios Agua dulce y Costas y arrecifes), se ha enfrentado a una naturaleza grandiosa y desconocida con viajes en barco de hasta diez dÃƒÂ­as para llegar a islas como Anuta, para llevar a cabo este gran proyecto de BBC que, por su espectacularidad y tratamiento, es propio de las grandes producciones cinematogrÃƒÂ¡ficas.\n\nPacifico Sur supone un hito por la manera de explorar la magnitud y majestuosidad del ocÃƒÂ©ano mÃƒÂ¡s grande del planeta. Salpicado de miles de islas, el PacÃƒÂ­fico Sur es un sueÃƒÂ±o para filmar. Un espacio en el que conviven palmerales, volcanes, lagunas de coral y coloridas aves que sobrevuelan ante una vegetaciÃƒÂ³n tropical.\n\nSin embargo, el aislamiento de sus islas y la vida salvaje cambiaron ante la llegada de los seres humanos. ExistÃƒÂ­an animales en evoluciÃƒÂ³n que se habÃƒÂ­an adaptado a extraÃƒÂ±os modos de vida. Orugas que se alimentan de carne, cangrejos gigantes capaces de abrir cocos, gecos que podÃƒÂ­an engendrar sin necesidad de un varÃƒÂ³n o ranas que nunca han sido renacuajos.\n","torrent":{"xt":"urn:btih:7b1945dd4dc9e809208aab7432afad8026275402","amp;dn":"Pacifico+Sur+6+de+6+-+Un+paraiso+fragil+%5Bdvdrip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b1945dd4dc9e809208aab7432afad8026275402","infoHashBuffer":{"type":"Buffer","data":[123,25,69,221,77,201,232,9,32,138,171,116,50,175,173,128,38,39,84,2]},"announce":[],"urlList":[]}}