{"title":"The Bible You DIDN'T Read","uid":6211313,"size":327698432,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7cd62e8592f79be37564583fcb82726a50e57ee5&amp;dn=The+Bible+You+DIDN%5C%27T+Read&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ezrydn","files":1,"time":1298995903,"description":"This is a series of audio MP3 files.  Ten files, to be exact.  There are 6-45 min MP3s and 2-30 min MP3s.  It is a presentation by Rev. J. Finis Dake on &quot;The Jest of the Bible.&quot;  It's not what you think.  Dake will bring to light things you might have read a thousand times yet never saw or understood it's meaning or connection.\n\nExample:  &quot;..harder to get into heaven than for a camel to pass through the eye of the needle.&quot;  Remember that one?  Jerusalem is surrounded by a wall.  This wall has but two openings in it.  The Commercial Wall is huge and handles daily commercial traffic.  It's open from sunup to sundown.  After sundown, The commercial gate closes and the only one left is the much smaller pedestrian gate.  It's name?  &quot;The Eye of the Needle.&quot;  Camels are incapable of bending down to transit such a small opening.  Ergo, biblical statement has true meaning.\n\nAnd there are many, many more covered in Rev. Dake's presentation.  Whether you are a believer or non-believer, you will learn new things from this series.  Of that, I'm sure!\n\nAs a bonus, there are two other MP# recordings:\n1.  Katherene Khuleman's last public presentation before her death.\n2.  Early Oral Roberts doing his &quot;The 4th Man&quot; presentation.  This will track the &quot;Jesus Thread&quot; from Genesis to Revealations.\n\nDake will prove to you that there is NO conflict between the Bible and Science.\n\nAll MP3s are on an ISO.  I use MagicDisk (free online) to mount and unmount.  There's no protection or cracking needed.","torrent":{"xt":"urn:btih:7cd62e8592f79be37564583fcb82726a50e57ee5","amp;dn":"The+Bible+You+DIDN%5C%27T+Read","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cd62e8592f79be37564583fcb82726a50e57ee5","infoHashBuffer":{"type":"Buffer","data":[124,214,46,133,146,247,155,227,117,100,88,63,203,130,114,106,80,229,126,229]},"announce":[],"urlList":[]}}