{"title":"Two and a Half Men, TVSeries (divx), S07E05-08, NL Subs, DMT","uid":6213064,"size":1009919258,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7e3511472f4f5f395e8c7ada1fd1244211e0aa83&amp;dn=Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S07E05-08%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"MeMar","files":-1,"time":1299059506,"description":"Two and a Half Men, TVSeries (divx), S07E05-08, NL Subs, DMT\n\n\nVerenigde Staten\nCategorie: Beeld\nFormaat: DivX\nOndertitels (ingebakken): Nederlands\nGenre: Sitcom\nBron: Retail\nDuur: ongeveer 20 minuten per aflevering\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0369179/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0369179/episodes&lt;/a&gt; &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&lt;/a&gt;\n\nDe hoofdrollen worden vertolkt door Charlie Sheen, Jon Cryer en Angus T. Jones.\n\nIn seizoen 7 heeft Cupido eindelijk zijn pijlen gericht op het hart van Charlie Harper, \nin plaats van op een ander lichaamsdeel - en het was helemaal raak. Jazeker, Charlie heeft ontdekt dat Chelsea serieus is en \nin seizoen 7 probeert hij alles om haar vast te houden. Aardig zijn voor haar ouders. Doen alsof hij luistert als ze praat. \nZelfs, ehm, trouw blijven. (Proberen, zeiden we.) Dat betekent een hoop lol voor de fans van de mannen. Maar Charlie is niet \nde enige Harper die vast zit in het liefdesweb. Alan is ervan overtuigd dat hij alleen wat meer haar nodig heeft voor \nde status van dekhengst, dus probeert hij de variant uit een spuitbus. En Jake besluit dat hij de ruwe golven van het daten \nop tienerleeftijd wel door zal komen met wat advies. Van Charlie.\n\nAflevering 5: For the Sake of the Child\nJake is het beu dat Charlie en Alan voortdurend ruziÃƒÂ«n en hij besluit opnieuw in te trekken bij zijn moeder. \nAlan denkt een einde te kunnen maken aan hun geruzie door te werken aan hun relatie. Een werkboek met allerlei \ntherapeutische opdrachten moet hen hierbij helpen.\n\nAflevering 6:  Give Me Your Thumb\nAlan stelt Chelsea voor om een borstverkleining te laten uitvoeren om verlost te raken van haar rugpijn. \nCharlie doet alsof hij zijn verloofde steunt, maar in werkelijkheid is hij razend op zijn broer en besluit hij hem enkele\n dagen uit het huis te zetten. Terwijl Alan tijdelijk intrekt bij zijn moeder, bidt Charlie dat hij Chelsea op andere gedachten kan brengen.\n\nAflevering 7: Untainted by Filth\nEvelyn heeft de perfecte locatie gevonden voor het trouwfeest van Charlie en Chelsea: het Bel Air Hotel. \nDat zou echter wel betekenen dat ze al op 26 juni in het huwelijksbootje stappen. Charlie zegt toe, maar slaat plots in paniek \nnu het huwelijk een concrete datum heeft. Samen met zijn broer besluit hij zijn zorgen te verdrinken in de bar. \nMaar voor Charlie het goed en wel doorheeft, wordt hij samen met zijn broer wakker in het bed van een vreemde vrouw \n\nAflevering 8: Gorp. Fnark. Schmegle\nChelsea's bloedmooie vriendin Gail lijdt zwaar onder de breuk met haar vriendje en komt enkele dagen bij Charlie en Alan logeren. \nDe komst van Gail laat niemand onberoerd. Terwijl Charlie zijn fantasieÃƒÂ«n en de verleiding nauwelijks kan onderdrukken, \nbesluit Alan zijn beste beentje voor te zetten. Zelfs Berta ziet Gail wel zitten.\n\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:7e3511472f4f5f395e8c7ada1fd1244211e0aa83","amp;dn":"Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S07E05-08%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e3511472f4f5f395e8c7ada1fd1244211e0aa83","infoHashBuffer":{"type":"Buffer","data":[126,53,17,71,47,79,95,57,94,140,122,218,31,209,36,66,17,224,170,131]},"announce":[],"urlList":[]}}