{"title":"scrooge-scrooge scrooged[ 3 disc upload ]xvids by winke@kidzcorn","uid":6048873,"size":2523072418,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7e3c0e8635228a79330910208dc2691752bc546e&amp;dn=scrooge-scrooge+scrooged%5B+3+disc+upload+%5Dxvids+by+winke%40kidzcorn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alanwatson","files":-1,"time":1292657537,"description":"This is a delightful musical adaptation of Charles Dickens' novel 'A Christmas Carol'. 'Scrooge' is an enchanting tale of the cold, callous and uncompromising Ebenezer Scrooge (Finney) as he undergoes a sequence of events that will change his attitude towards Christmas spirit and goodwill forever.\n\nMeet a host of entertaining and captivating characters as Scrooge encounters another realm, the night before Christmas. Marley's Ghost and the spirits of Christmas past, present and future come to life amid a medley of lively songs by Academy Award-winning composer Leslie Briscue (Willy Wonka &amp; the Chocolate Factory). Musical highlights include &quot;You...You&quot;, Scrooge's sad contemplation of losing the love of his life and &quot;Thank You Very Much&quot; a catchy musical finale.\nThroughout the much loved plot Finney gives an inspiring performance as twisted and gnarled Ebenezer Scrooge under the meticulous direction of Ronald Neame. The seasoned cast provide excellent performances as the featured members of the spirit world in this wonderful musical extravaganza that boasts lavish sets, and impressive storytelling to impart perhaps the best adaptation of this tale so far!\n\n\n\nscrooge[alistair sim]\n\nDigitally re-mastered, Alastair Sim's Scrooge is the all time favourite Christmas family film and a genuine classic of British cinema.\n\nScrooge is the definitive big screen adaptation of Charles Dickens' A Christmas Carol, one of the world's best loved Christmas stories.\n\n\nscrooged[bill murray]\n\nHigh-spirited high jinks on Christmas Eve put Frank Cross (Bill Murray) in a ghostly time warp in this hilarious take-off of Charles Dickens' &quot;A Christmas Carol.&quot;\n\nCross, who has made the meteoric rise from the depths of the mailroom to TV network president, is mean, nasty, uncaring, unforgiving and has a sadistic sense of humor - perfect qualities for a modern-day Scrooge.\n\nBefore the night is over, he'll be visited by a maniacal New York cab driver from the past, a present-day fairy who's into pratfalls and, finally, a ghoulish, seven-foot headless messenger from the future...","torrent":{"xt":"urn:btih:7e3c0e8635228a79330910208dc2691752bc546e","amp;dn":"scrooge-scrooge+scrooged%5B+3+disc+upload+%5Dxvids+by+winke%40kidzcorn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e3c0e8635228a79330910208dc2691752bc546e","infoHashBuffer":{"type":"Buffer","data":[126,60,14,134,53,34,138,121,51,9,16,32,141,194,105,23,82,188,84,110]},"announce":[],"urlList":[]}}