{"title":"Shroud for a Nightingale - P D James  (Unabridged)","uid":5990374,"size":217433671,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7e6b8d60b9d73a233e17c7060fd0b4ef35733a34&amp;dn=Shroud+for+a+Nightingale+-+P+D+James++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lucy1948","files":14,"time":1290865874,"description":"Audio Books : Mystery : Other quality : English\n\nUnabridged and read by Michael Jayston. 10 hours 2 mins duration. 12 Overdrive CD's. (48 kbps / 44 kHz Mono, Fraunhofer CBR, jetAudio 8+).\n\n \n[Book #4, 1971]\n\nThe young women of Nightingale House are there to learn to nurse and comfort the suffering. But when one of the students plays patient in a demonstration of nursing skills, she is brutally killed. Another student dies equally mysteriously, and it is up to Adam Dalgliesh to unmask a killer who has decided to prescribe murder as the cure for all ills.\n\nWith her fourth Adam Dalgliesh novel, &quot;Shroud for a Nightingale,&quot; P. D James ventured into new and dark territory, both in terms of the mystery and underlying themes. The first three novels in the Dalgliesh canon were, for the most part, traditional mystery novels with characters who you sensed were complex human beings, but who were never fleshed out entirely, as if to do so would be violating the &quot;rules&quot; of the detective story. With &quot;Shroud for a Nightingale,&quot; however, P. D. James introduced us into the dark world of Nightingale House, where nurses, nursing students, physicians, and patients suddenly find a double murderer in their midst. This is the first of P. D. James's novels in which the characters' pasts are truly made to bear on the present. By the end of the novel, we are terrified at the bounds of loyalty and deception to which our fellow human beings are capable. The terror in &quot;Shroud for a Nightingale&quot; is there from the start, as the first victim-to-be meets a demise that, simply put, is worthy of a horror novel. Such horror, when expressed in James' elegant prose, becomes even more frightening.(AC) \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:7e6b8d60b9d73a233e17c7060fd0b4ef35733a34","amp;dn":"Shroud+for+a+Nightingale+-+P+D+James++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e6b8d60b9d73a233e17c7060fd0b4ef35733a34","infoHashBuffer":{"type":"Buffer","data":[126,107,141,96,185,215,58,35,62,23,199,6,15,208,180,239,53,115,58,52]},"announce":[],"urlList":[]}}