{"title":"Motorhead - Stay Clean (Live-Germany) (2nafish)","uid":6081180,"size":101322756,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7eb4de1843d518077060bee5b862c3231497f9d3&amp;dn=Motorhead+-+Stay+Clean+%28Live-Germany%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1294127381,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nOverkill is the second album released by MotÃƒÂ¶rhead, in 1979, and their first for Bronze Records. It peaked at number 24 on the UK charts.\nIt has a big impact in the british punk culture of that time, paving the way for UK82.\n\nBronze Records signed the band in 1978 and gave them time in Wessex Studios in London to record Richard Berry's &quot;Louie Louie&quot; and a new song by the band, &quot;Tear Ya Down&quot;. The band toured to promote their single &quot;Louie Louie&quot; while Chiswick released the MotÃƒÂ¶rhead album in white vinyl, to keep the momentum going. Sales of the single brought the band their first appearance on BBC Television's Top of the Pops, which gave Bronze the confidence to get the band back into the studio to record a second album.\n\nThe first release from those sessions was the single release of &quot;Overkill&quot; backed with &quot;Too Late, Too Late&quot; in 7&quot; and 12&quot; pressings. The Chiswick album &quot;MotÃƒÂ¶rhead&quot; had been a hasty affair as was its production, although it had a sub-bootleg quality which may be appealing, Overkill had more spring and bounce, and a thundering title track that would become a show-stopper for years to come. Three weeks after the initial release of the album in black vinyl, the album was released in a limited edition of 15,000 in green vinyl.\n\nIn June 1979 &quot;No Class&quot; was lifted from the album as a follow-up single, backed with a previously unreleased song, &quot;Like a Nightmare&quot;. With a view to increasing the sales, the single was released in three different covers, one each of Lemmy, Clarke and Taylor.\n\nThe album was reissued on Cassette, CD and vinyl by Castle Communications in 1988, coupled with Another Perfect Day, Bronze having issued a cassette of the album covered with Bomber in 1980.\n\nJoe Petagno, the sleeve artist, had this to say about the cover of the album, which he felt rushed into because the band could not find him:\n\n    I had about a week and a half to get it finished... But it was always a disappointment for me, personally. It should have been multi-layered. It was supposed to have a feeling that there was more to it, there were going to be more bits and pieces. In a way, I kind of did it on the Inferno thing. I sort of took my revenge on the new trinity. In a way.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7eb4de1843d518077060bee5b862c3231497f9d3","amp;dn":"Motorhead+-+Stay+Clean+%28Live-Germany%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eb4de1843d518077060bee5b862c3231497f9d3","infoHashBuffer":{"type":"Buffer","data":[126,180,222,24,67,213,24,7,112,96,190,229,184,98,195,35,20,151,249,211]},"announce":[],"urlList":[]}}