{"title":"CorkScrew The Elder Scrolls IV Oblivion For Linux","uid":6210671,"size":5700892816,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7eb7a2a866b56744e0e17bbe01acb86c32ad9397&amp;dn=CorkScrew+The+Elder+Scrolls+IV+Oblivion+For+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"evilgold","files":3,"time":1298972478,"description":"This package contains The Elder Scrolls IV: Oblvion + Knights of the Nine and Shivering Isles addons.\n\nCorkScrews are prepackaged wine prefixes inspired by the &quot;Wine bottle&quot; of\nCrossover (cxgames.). This package was built using ArchLinux and also tested on Ubuntu 10.04, it should work properly on any Linux distribution with wine installed.\n\nTo install the game run oblivion_installer.sh. This will extract the archive to ~/.wine/wineprefixes/TES4_Oblivion. \n\nIMPORTANT: If you experience issues running the game at first, try chaning the resolution in the options menu to your monitors native resolution before launching the game. Alternativly you can run &quot;WINEPREFIX=$HOME/.wine/wineprefixes/TES4_Oblivion winecfg&quot; from a terminal and configure the bottle to run in a virtual desktop.\n\nTo launch the game execute the script located in ~/bin, either by double clicking on it, or from a terminal enter: ~/bin/oblvivion . I reccomend adding $HOME/bin to your $PATH, especially if you want to use more then one corkscrew. A desktop launcher is not included with this release, but you can easily make one yourself.\n\nTo uninstall delete the TES4_Oblvion folder in ~/.wine/wineprefixes.\n\nI encourage you to package, test, and distribute CorkScrews of other applications and games. This package along with the installer can be freely redistributed and/or modified only by qualified software pirates. If you are happy to see a game or program you like running on linux be sure to let the developers know. \n\nFor other packages just search &quot;CorkScrew&quot; on your favorite torrenting site. \n\nAny requests/feedback/questions/issues/comments/virgin offerings, are welcome. Contact me on Demonoid:or leave a comment on tpb.\n\n","torrent":{"xt":"urn:btih:7eb7a2a866b56744e0e17bbe01acb86c32ad9397","amp;dn":"CorkScrew+The+Elder+Scrolls+IV+Oblivion+For+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eb7a2a866b56744e0e17bbe01acb86c32ad9397","infoHashBuffer":{"type":"Buffer","data":[126,183,162,168,102,181,103,68,224,225,123,190,1,172,184,108,50,173,147,151]},"announce":[],"urlList":[]}}