{"title":"All That Remains - Chiron (2nafish)","uid":6041320,"size":154159108,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7f26cf0aa2a8c6f4c49d1799c54ec1c7f83ca479&amp;dn=All+That+Remains+-+Chiron+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292400563,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nOvercome is the fourth studio album by American metalcore band, All That Remains. It was released on September 16 2008. Overcome is the first album by All That Remains since their debut to not be produced by Adam Dutkiewicz of Killswitch Engage, it is as well the first to feature the band's current drummer, Jason Costa. It is also the only album to not feature melodic death metal elements.\n\nOn July 21, 2008, two tracks from the new album - Before the Damned and Relinquish - made their debut on the band's MySpace profile. Commenting on the tracks, vocalist Philip Labonte stated, &quot;This represents the heavier side of ATR. Last time we did this we put up 'The Weak Willed' and we feel like it's a bit of a tradition to really kick you in the nuts when we first show off new stuff! So here is the heaviest stuff we came up with for 'Overcome.'&quot; Chiron made its debut on August 11, 2008 on the band's MySpace profile. The song is the first single from the album, with a behind-the-scenes shoot up and the official music video submitted to YouTube.\n\nTwo of the album's tracks, &quot;Two Weeks,&quot; and &quot;Chiron,&quot; were made available as downloadable content for Rock Band on September 9, 2008. The tracks were exclusive to Rock Band for one week before the album was released.\n\nThe song &quot;Two Weeks&quot; was added to the band's MySpace page on September 8, 2008 to help promote the release of the song pack on Rock Band. It is the album's second single and a music video has been released for it. The song has since become their biggest hit to date, cracking the top ten on Billboard's Mainstream Rock Tracks.\n\nThe album debuted at #16 on the Billboard 200, and has sold over 200,000 copies, making it their most successful album to date.\n\nThe band sent their third single from the album &quot;Forever In Your Hands&quot; out to radio on June 15, 2009. This single also featured an acoustic version of the song, marking the first time the band had released a &quot;Acoustic&quot; song.\n\nOn October 7, 2009, the band released the bonus track &quot;Frozen&quot;, previously available in Japan only, as a free download from their website. On the same day, a music video for &quot;Forever in Your Hands&quot; was released. \n\nOn March 17, 2010, the song &quot;Days Without&quot; was released on the Rock Band Network as a downloadable song. On April 8, 2010, the &quot;Forever in Your Hands&quot; followed, and finally &quot;Undone&quot; was released on April 27, 2010\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7f26cf0aa2a8c6f4c49d1799c54ec1c7f83ca479","amp;dn":"All+That+Remains+-+Chiron+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f26cf0aa2a8c6f4c49d1799c54ec1c7f83ca479","infoHashBuffer":{"type":"Buffer","data":[127,38,207,10,162,168,198,244,196,157,23,153,197,78,193,199,248,60,164,121]},"announce":[],"urlList":[]}}