{"title":"Osmos - Linux Version - [deb-rpm Multi12] action puzzle [TNTVill","uid":6115823,"size":81436569,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7f32780b7f59a72bb2991ccdf8e334042c5b686f&amp;dn=Osmos+-+Linux+Version+-+%5Bdeb-rpm+Multi12%5D+action+puzzle+%5BTNTVill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dedalo33","files":4,"time":1295546619,"description":" Osmos - Linux version\n\n\n.: Recensione :.\n\nPremiato all'Independent Games Festival del 2009, Osmos ÃƒÂ¨ un ampliamento esponenziale di quel genere di giochi in cui si impersona un essere unicellulare, ambientato in un mondo ostile dominato dalla legge naturale &quot;mangia gli altri prima che loro mangino te&quot;.\nA prima vista potrebbe sembrare il solito gioco in cui la nostra cellulina ÃƒÂ¨ libera di nuotare, sacrificando un po' della sua massa per spingersi &quot;a reazione&quot;, e a noi sta controllarla in modo da mangiare le cellule piÃƒÂ¹ piccole ed evitare le piÃƒÂ¹ grandi per non essere assorbiti.\nIl gioco ÃƒÂ¨ suddiviso in tre sezioni, ognuna molto particolare e dal gameplay che spazia dall'azione al puzzle, richiedendo attenzione, strategia e abilitÃƒÂ  al giocatore in una prova tutt'altro che facile. In ogni sezione ci sono diversi livelli e sottolivelli, ognuno dei quali richiede che venga completato il precedente per essere giocato; perÃƒÂ² si puÃƒÂ² avanzare nei livelli delle tre sezioni indipendentemente.\n\nC'ÃƒÂ¨ la classica &quot;lotta per la sopravvivenza&quot; in cui bisogna assorbire gli organismi che vagano nel mondo fluido di Osmos, badando ad impedire che le cellule &quot;ostili&quot; (dotate di un'ottima IA) non diventino le piÃƒÂ¹ grandi della regione, rendendoci cosÃƒÂ¬ impossibile il loro assorbimento e facendoci anzi diventare il loro pasto.\n\nPoi c'ÃƒÂ¨ la sezione che ricorda, nello stile, il puzzle Qui ogni livello inizia con la nostra cellulina piccolissima immersa in un mondo quasi immobile in cui le altre &quot;cellulone&quot; dominano la scena. Bisogna fare un attentissimo uso delle abilitÃƒÂ  di accelerare/rallentare il tempo per fare spostamenti con precisione chirurgica e bilanciare le nostre perdite di massa con gli assorbimenti, destreggiarsi tra i minuscoli cunicoli che si aprono, spingere le altre cellule a mangiarsi l'una con l'altra... Un vero crivello.\n\nSeppur in tutto il gioco sia la fisica l'elemento centrale, nella parte della gravitÃƒÂ  essa diventa cruciale. Verremo proiettati in una sorta di sistema solare, dove una miriade di celluline roteano attorno ad un (e anche a due!) corpo centrale. Bilanciare le spinte per &quot;catturare&quot; le nostre prede durante il moto, evitando di finire assorbiti dal &quot;sole&quot; oppure proiettati al di fuori del suo campo attrattivo ÃƒÂ¨ un'impresa tutt'altro che facile.\n\nL'esperienza di gioco ÃƒÂ¨ innovativa, accattivante, rilassante e nevrotica al tempo stesso, ÃƒÂ¨ molto godibile anche grazie alle azzeccatissime atmosfere elettroniche/ambient di Loscil, Gas/High Skies, Julien Neto, Biosphere e altri. L'atmosfera della tranquilla spietatezza &quot;biologica&quot; del mondo di Osmos ÃƒÂ¨ caratterizzata da una splendida grafica e dagli ottimi effetti sonori.\n\nChi non ha mai giocato a questo genere di giochi troverÃƒÂ  di certo piacevole l'esperienza di cominciare con Osmos, mentre chi ÃƒÂ¨ giÃƒÂ  un abitueÃƒÂ© lo considererÃƒÂ  un gioiellino, da avere sullo scaffale. In ogni caso nella pagina dello sviluppatore sono disponibili la demo per Win, Mac e Linux.\n\nIn questa versione completa, a differenza della demo:\n\n    * tutti i tipi di livelli, tutti i tipi di cellule, potenziamenti, puzzle; 47 livelli in tutto, piÃƒÂ¹ contenuti bonus\n    * generazione random di livelli di ogni tipo\n\n\n.: Scheda tecnica del Gioco :.\n\nSistema operativo: GNU/Linux\nDimensione: 77.7 MB (circa 50 MB installato)\nVersione: 1.6.0\nLingua: menu in Italiano, Inglese, Francese e Spagnolo\nGenere: puzzle/azione/fisica\nSviluppatore: Hemisphere Games\nSito Ufficiale: http://www.hemispheregames.com\nData di uscita: 18/08/2009\n\n\n.: Requisiti Minimi :.\n\nProcessore: 1.0 GHz\nMemoria RAM: 512 MB\nScheda grafica: qualsiasi purchÃƒÂ© supporti OpenGL\nScheda sonora: qualsiasi purchÃƒÂ© supporti OpenAL\n\n\n.: Note di installazione :.\n\nE' sufficiente aprire gli archivi precompilati con un gestore di pacchetti (tipicamente Synaptic su sistemi basati su Debian). Potrebbe essere necessario avere i privilegi di root per effettuare l'installazione. Se la vostra distribuzione Linux utilizza un sistema di gestione di pacchetti basato su Debian e volete per qualche motivo utilizzare i pacchetti .rpm ÃƒÂ¨ consigliato utilizzare l'applicazione alien per convertire i pacchetti in .deb piuttosto che bypassare il sistema di gestione dei pacchetti.\n\nUna volta installato il gioco dovrebbe partire senza problemi. Alcune difficoltÃƒÂ  si potrebbero incontrare se non avete installati i driver proprietari per la vostra scheda grafica oppure se avete il gestore grafico X e non avete attivato l'estensione glx.","torrent":{"xt":"urn:btih:7f32780b7f59a72bb2991ccdf8e334042c5b686f","amp;dn":"Osmos+-+Linux+Version+-+%5Bdeb-rpm+Multi12%5D+action+puzzle+%5BTNTVill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f32780b7f59a72bb2991ccdf8e334042c5b686f","infoHashBuffer":{"type":"Buffer","data":[127,50,120,11,127,89,167,43,178,153,28,205,248,227,52,4,44,91,104,111]},"announce":[],"urlList":[]}}