{"title":"St. Trinians DVDRIP ~PINKHONEY0269~","uid":5991988,"size":1013916698,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7f4b3a43809eed3cd6ccf696116a81541b3faed4&amp;dn=St.+Trinians+DVDRIP+%7EPINKHONEY0269%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pinkhoney0269","files":1,"time":1290916639,"description":"Run Time: 97 Minutes\n\n\nStarring:\n\nRupert Everett\nColin Firth\nTalulah Riley\nLena Headey\nRussell Brand\nCaterina Murino\nGemma Arterton\n\n\nSt Trinian's is an anarchic school for uncontrollable girls. The film opens with meek and timid Annabelle Fritton, niece of the highly eccentric headmistress Miss Camilla Dagey Fritton, being admitted to the school by her father Carnaby. She meets Kelly Jones, head girl, who shows her around the school and introduces the various cliques in the school - Posh Totty (slang for gorgeous upper class girls), Chavs, Emos, Geeks and First Years. (Two of the First Years are twins and described as Dolchester's answer to The Sopranos). The girls trick Annabelle (involving a lot of horrible gloop), causing her to take a shower. Meanwhile, they steal her clothes as well as her towel while another girl secretly changes the water's temperature to cold. Annabelle doesn't realise that she is being broadcast on YouTube by the other girls while running naked from the shower to the dormitory. She phones Carnaby and demands to be taken away from the school but Carnaby pretends to lose reception. In frustration Annabelle shoots her mobile phone with a hockey stick across the hall until it hits a marble statue, smashing it into pieces. A teacher catches Annabelle in the act and instantly drafts her into the school's hockey team.\n\n\n","torrent":{"xt":"urn:btih:7f4b3a43809eed3cd6ccf696116a81541b3faed4","amp;dn":"St.+Trinians+DVDRIP+%7EPINKHONEY0269%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f4b3a43809eed3cd6ccf696116a81541b3faed4","infoHashBuffer":{"type":"Buffer","data":[127,75,58,67,128,158,237,60,214,204,246,150,17,106,129,84,27,63,174,212]},"announce":[],"urlList":[]}}