{"title":"Democracy Now - 10 jan 2011","uid":6093781,"size":452335350,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:80170ac09f276f4213b068571d498651b229d8dd&amp;dn=Democracy+Now+-+10+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1294677677,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 10, 2011\n\n- Rep. Giffords Survives Assassination Attempt in Tucson; Six Die\n- FBI: Evidence Indicates Gunman Plotted Giffords Shooting\n- Investigators Probe Arizona Gunman's Links to Hate Group\n- Tucson Sheriff Condemns Hateful Political Rhetoric\n- Incendiary Packages Mailed in Maryland and Washington, D.C.\n- DOJ Subpoenas Twitter for Info on WikiLeaks Accounts\n- Scott Sisters Freed After Serving 16 Years in Prison for $11 Robbery\n- Unemployment Rate Falls as More Drop Out of Labor Force\n- Wells Fargo &amp; U.S. Bancorp Lose Landmark Foreclosure Court Case\n- Three Die in Algerian Food Riots\n- Southern Sudan Begins Voting on Independence\n- 51 Killed in Mexican Drug Violence; 15 Decapitated in Acapulco\n- Accused Airliner Bomber, CIA Operative Faces Trial\n- Muslims Act As Human Shields For Coptic Christians in Egypt\n\n\nSpecial reports\n\n- &quot;Politics in Arizona Have Become Fueled By Hate...Driven By Anger:&quot; Rep. Raul Grijalva on Shooting of Giffords\n\nFederal prosecutors have charged Jared Lee Loughner with the attempted assassination of Rep. Gabrielle Giffords (D-AZ). She was shot in the back of the head at close range on Saturday morning outside a supermarket in Tucson where she was holding an event called &quot;Congress on Your Corner&quot; to meet with constituents. In all, 20 people were shot, six were killed. The dead include U.S. District Judge John Roll, Giffords' aide Gabriel Zimmerman, a nine-year-old girl born on Sept. 11, 2001, and three people in their late 70s. We speak with Giffords' fellow Arizona House Representative, Raul Grijalva, about the shooting.\n\n\n- Pima County Sheriff Clarence Dupnik: &quot;People Who Are Mentally Unstable Are Susceptible to the Rhetoric Going on in This Country&quot;\n\nThe court documents filed Sunday suggest the the attempted assassination of Democratic Rep. Gabrielle Giffords of Arizona was premeditated. While the motivation for the attack remains unclear, the picture emerging of the suspect, Jared Lee Loughner, is of a severely disturbed 22-year-old with mental health issues. We speak with Pima County Sheriff Clarence Dupnik.\n\n\n- Jeff Biggers: Arizona Facing &quot;Lethal Combination&quot; of &quot;Hate-Filled Speech&quot; &amp; &quot;Dangerous and Easy Access to Weapons&quot;\n\n&quot;Arizona] is a gun state,&quot; says Tucson-based journalist Jeff Biggers. &quot;I think we see a huge difference between the right to own a weapon to go hunting or to defend yourself and the right for mentally disturbed people to purchase semiautomatic firearms without any sort of registration or regulation.&quot; We speak to Biggers about Arizona's gun laws.\n\n\n- Chip Berlet on &quot;The Becking of Rep. Gabrielle Giffords&quot;\n\nWe speak with Chip Berlet, co-author of Right-Wing Populism in America: Too Close for Comfort. In his latest article, Berlet writes, &quot;From a moral viewpoint Rep. Gabrielle Giffords is the victim of demagogues such as Glenn Beck and his allies at Fox News and in the Tea Party Movement. This is not about legal liability but about moral culpability. This is about a nation that has lost its moral compass.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:80170ac09f276f4213b068571d498651b229d8dd","amp;dn":"Democracy+Now+-+10+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80170ac09f276f4213b068571d498651b229d8dd","infoHashBuffer":{"type":"Buffer","data":[128,23,10,192,159,39,111,66,19,176,104,87,29,73,134,81,178,41,216,221]},"announce":[],"urlList":[]}}