{"title":"Coast to Coast AM - 11 - 02 - 10 - Evolution of Technology","uid":5963488,"size":55160146,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:81cba0086507f104ff5a628778517d9917848129&amp;dn=Coast+to+Coast+AM+-+11+-+02+-+10+-+Evolution+of+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":4,"time":1290029782,"description":"Evolution of Technology\n\nDate: 11-02-10\nHost: George Noory\nGuests: Kevin Kelly, James Gardner, John M. Curtis\n\nIn the middle two hours, former Executive Editor of Wired Magazine, Kevin Kelly and science writer Jim Gardner discussed how technology functions as a living part of the universe, and is evolving in ways that are almost biological. An ecosytem of technologies, which Kelly referred to as the &quot;technium,&quot; could be thought of as a kind of super organism that is an extension of the evolutionary process, he explained. Gardner used the phrase &quot;the virtual Cambrian&quot; (during the Cambrian era life evolved from simple cells to more complex creatures) to describe our new era in which we are &quot;birthing a new kind of kingdom of life,&quot; with our technology.\n\nKelly described future advances-- people won't carry separate devices like cell phones, but will interact with technology embedded in the environment that recognizes you and displays your preferred interface. In the next 10 years, he sees the Internet evolving to become less static, and in transportation, automatic driving will begin to be adopted. Google is already experimenting with self-driving cars, using video cameras, GPS, and various sensors.\n\nAs machines and robots become more autonomous, there may be dangers associated with their ability to self-replicate, or how they are incorporated into the military, Gardner pointed out. By creating technology that has a degree of autonomy, we are giving up some control, Kelly conceded, &quot;but that's the only way we can get our creations to surprise us,&quot; he suggested.\n\nThe last hour of the show featured Open Lines.\n\nElection Analysis\nFirst hour guest, columnist John M. Curtis offered analysis on the mid-term election results. He views the Republican victories as a repudiation of Obama's policies, and part of an anti-incumbent trend sweeping the country. If Obama is to succeed, he needs to reset his policies, become more bi-partisan, and &quot;step into the leadership of being President of the United States on his own, without Nancy Pelosi, Harry Reid, and Rahm Emanuel calling the shots,&quot; he commented.","torrent":{"xt":"urn:btih:81cba0086507f104ff5a628778517d9917848129","amp;dn":"Coast+to+Coast+AM+-+11+-+02+-+10+-+Evolution+of+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81cba0086507f104ff5a628778517d9917848129","infoHashBuffer":{"type":"Buffer","data":[129,203,160,8,101,7,241,4,255,90,98,135,120,81,125,153,23,132,129,41]},"announce":[],"urlList":[]}}