{"title":"The JoBoxers - Just Got Lucky (2nafish)","uid":6061987,"size":137752580,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:82b0074641ce851f4f210c8c9cc583b5a9ef11af&amp;dn=The+JoBoxers+-+Just+Got+Lucky+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1293166947,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Just Got Lucky&quot; is the name of the band JoBoxers' second single. The track was initially released on the band's debut album, Like Gangbusters in 1983. The song was a hit, making the UK Top 10 and the US Top 40 that autumn. It was later released on the band's albums Doing the Boxerbeat - The Anthology and Essential Boxerbeat.\n\nThis was used in a radio ad for a promo from Max's restaurant &quot;Lucky with the tilaok.&quot; It was also included in the compilation album Chorus Girl and the films The 40-Year-Old Virgin, starring Steve Carell, Just My Luck starring Lindsay Lohan, Bagets, and Lucky 13 starring Lauren Graham.\n\nJoBoxers, a predominantly British-American pop group was formed in 1982, when former Subway Sect members - guitarist Rob Marche, keyboardist Dave Collard, bassist Chris Bostock and drummer Sean McLusky - teamed up with American singer, Dig Wayne (born Timothy Wayne Ball, 20 July 1962, Cambridge, Ohio). Wayne had previously fronted the New York based rockabilly band, Buzz and the Flyers as Buzz Wayne.\n\nThe band's debut single, &quot;Boxerbeat&quot;, found success in Britain, peaking at number 3 in the UK Singles Chart. Their next hit &quot;Just Got Lucky&quot; also sold 250,000 copies, and made the UK Top 10 and US Top 40.\n\nSubsequent singles, &quot;Johnny Friendly&quot; and &quot;Jealous Love&quot; did less well. JoBoxers' debut album, Like Gangbusters, reached the Top 20 of the UK Albums Chart. The band released another single &quot;Is This Really The First Time&quot; and a second album Skin and Bone in 1985, but then split up, with McLusky joining Marche and Paul Wells in the indie-dance band called If? and Bostock joining Dave Stewart's post-Eurythmics group, The Spiritual Cowboys.\n\nMeanwhile, Wayne remained in London and briefly attempted a solo career, releasing the album Square Business in 1987, featuring fellow former JoBoxer Dave Collard on keyboards. One single, &quot;Mastermind&quot; was released from this album. After his solo efforts proved unsuccessful, Wayne began pursuing an acting career. He would go on to appear in several stage productions (including a starring role in the successful West End musical Five Guys Named Moe) in the UK. In 1995, he returned to the US, settling in Los Angeles, California to continue pursuing his acting/television career.\n\nWayne has returned to his music roots and fronts the band Dig Wayne and the Chisellers. Also a guitarist and drummer, Wayne has toured both America and Europe with his band.\n\nWayne also appeared in the sixth episode of season 8 of CSI, &quot;Who and What&quot;, playing a pawn shop owner.\n\n&quot;Just Got Lucky&quot; was featured in the films: The 40-Year-Old Virgin, starring Steve Carell, and Just My Luck starring Lindsay Lohan.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:82b0074641ce851f4f210c8c9cc583b5a9ef11af","amp;dn":"The+JoBoxers+-+Just+Got+Lucky+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82b0074641ce851f4f210c8c9cc583b5a9ef11af","infoHashBuffer":{"type":"Buffer","data":[130,176,7,70,65,206,133,31,79,33,12,140,156,197,131,181,169,239,17,175]},"announce":[],"urlList":[]}}