{"title":"The Vault - Peter Lovesey  (Unabridged)","uid":6045678,"size":170358025,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8340a5bfa765bac19c35fabfdb97aeb15344a8f3&amp;dn=The+Vault+-+Peter+Lovesey++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lucy1948","files":12,"time":1292539485,"description":"Unabridged and read by Peter Barker. 11 hours 50 mins duration. 10 CD's. (Fraunhofer CBR 32 kbit/s 22050 Hz Mono).\n\n\n[ Book 7 ]\n\nSkeletal remains are found in a cellar below Bath's Georgian tearooms. To Peter Diamond's delight they are not all of medaeival origin, a radius proves to be only twenty years old and bears the marks of a sharp weapon. While a police team painstakingly sift through the cellar looking for the rest of the body, Diamond is distracted by the search for a missing American tourist, the wife of an English Professor who has been behaving very oddly. What Diamond doesn't know is that the professor believes he is on the point of locating the diaries of Mary Shelley written whilst in Bath finishing the manuscript of FRANKENSTEIN. Suspecting the professor of disposing of his wife but unable to prove anything, Diamond concentrates on trying to identify whose remains have been found in the cellar, and by solid old-fashioned detection he does so with shocking results. But before he can begin to work out who might have been the killer, the owner of the city's largest 'antique' emporium is found brutally murdered and the last person known to have seen her alive is the Professor.\n\nWith consummate skill, wit, erudition and ingenuity, Peter Lovesey has crafted a whodunnit of brilliant complexity and, finally, of total satisfaction.","torrent":{"xt":"urn:btih:8340a5bfa765bac19c35fabfdb97aeb15344a8f3","amp;dn":"The+Vault+-+Peter+Lovesey++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8340a5bfa765bac19c35fabfdb97aeb15344a8f3","infoHashBuffer":{"type":"Buffer","data":[131,64,165,191,167,101,186,193,156,53,250,191,219,151,174,177,83,68,168,243]},"announce":[],"urlList":[]}}