{"title":"Democracy Now - 13 jan 2011","uid":6100454,"size":447489782,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:837c06134ab0202d7d705974c9bf75de12d8f702&amp;dn=Democracy+Now+-+13+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Roys","files":1,"time":1294944898,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 13, 2011\n\n- Thousands Mourn Arizona Shooting Victims; Giffords Opens Eyes for First Time\n- Police Stopped Suspect on Day of Shooting\n- House Reconvenes, Condemns Attack\n- Palin Dismisses Criticism as \\&quot;Blood Libel\\&quot;\n- Man Arrested for Allegedly Threatening Rep. McDermott\n- On Anniversary, Haiti Increases Earthquake Death Toll Estimate to 316,000\n- Bill Clinton Defends Reconstruction Commission Efforts\n- Lebanese Gov\\'t Collapses After Hezbollah Withdraws Ministers\n- Women\\'s Rights Activist Slain in Ciudad JuÃƒÂ¡rez\n- 2010 Tied for Warmest on Record\n- Study: Number of Homeless Increased During Recession\n- Government Spy Infiltrated Antiwar Groups Before FBI Raids\n\n\nSpecial reports\n\n- Obama Calls for \\&quot;Civil and Honest Public Discourse\\&quot; at Tucson Shooting Memorial\n\nMore than 26,000 people attended a memorial Wednesday night to remember the victims of Saturday\\'s shooting in Tucson that left six people dead and 20 wounded, including Democratic Rep. Gabrielle Giffords, who remains in critical condition. In his 33-minute address, President Obama called for civil and honest public discourse and paid tribute to the victims of Saturday\\'s shooting. [includes rush transcript]\n\n\n- Tavis Smiley on Obama\\'s Arizona Memorial Speech, Martin Luther King and Hate in America\n\nWe get reaction to President Obama\\'s memorial speech in Tucson from journalist Tavis Smiley. \\&quot;I thought the speech the President gave was a wonderful speech, and I thought it properly contextualized what it is that we are up against as a nation,\\&quot; Smiley says. \\&quot;I wish the President had gotten around to giving this speech a year ago.\\&quot; And on this eve of the birthday of Rev. Martin Luther King, Jr., who decried violence abroad and at home, we also play excerpts of his historic 1967 address at the Riverside Church, when he called for an end to the Vietnam War. Smiley is hosting a nationally televised discussion tonight titled, \\&quot;America\\'s Next Chapter.\\&quot; [includes rush transcript]\n\n\n- Icelandic Parliamentarian Calls U.S. Subpoena of Her Twitter Account over WikiLeaks Involvement \\&quot;Disturbing\\&quot;\n\nThe U.S. Department of Justice has subpoenaed the internet company Twitter for personal information from several people linked to the online whisteblower website WikiLeaks. The subpoena asks Twitter for all records and correspondence relating to their accounts. Icelandic parliament member Birgitta JÃƒÂ³nsdÃƒÂ³ttir, who has collaborated with WikiLeaks, is one of the five people targeted by the subpoenas. \\&quot;I think it opens up a whole can of worms when it comes to parliamentary immunity worldwide,\\&quot; JÃƒÂ³nsdÃƒÂ³ttir says. \\&quot;Icelandic authorities are taking this very seriously.\\&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:837c06134ab0202d7d705974c9bf75de12d8f702","amp;dn":"Democracy+Now+-+13+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837c06134ab0202d7d705974c9bf75de12d8f702","infoHashBuffer":{"type":"Buffer","data":[131,124,6,19,74,176,32,45,125,112,89,116,201,191,117,222,18,216,247,2]},"announce":[],"urlList":[]}}