{"title":"Flipsyde - When It Was Good (Xvid-2nafish)","uid":5978227,"size":58143278,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:85238468b087ec537ae12c54b5f3fc6af0234d51&amp;dn=Flipsyde+-+When+It+Was+Good+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1290508794,"description":"File Info:\n\n\nValid : Yes [AVI]\nDuration : 00:03:31\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2072 Kbps\nQuality Factor : 0.41 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\nWhen It Was Good is the First single off Hip hop group Flipsyde's Second album State of Survival. This is Flipsyde's first single with their new member, Chantelle Paige.\n\nState of Survival is the second studio album from Flipsyde, and also the first since the addition of Chantelle Paige. It was released in 2009 in varying regions across the world, none including the United States. Track listing was revealed on Flipsyde World.\n\nDespite being released in other locations around the world, after months of push-backs in the US, it became known in September that Interscope Records was considering dropping Flipsyde without even releasing the album stateside. This resulted in any future Flipsyde plans being abandoned for the time being.\n\nFlipsyde is a rap/R&amp;B/rock band from Oakland, California. Flipsyde consists of singer/guitarist Steve Knight, guitarist Dave Lopez, rapper Jinho &quot;the Piper&quot; Ferreira, and recently singer Chantelle Paige. They have toured extensively with Fort Minor, The Black Eyed Peas, Snoop Dogg and on the Anger Management Tour. Flipsyde's single, &quot;Someday&quot;, was chosen as NBC's theme song for the 2006 Winter Olympic Games held in Torino, Italy, as well as part of the soundtrack for the 2008 film Never Back Down. Their debut album, We the People, also featured three other singles (&quot;Happy Birthday&quot;, &quot;Trumpets (Never Be The Same Again)&quot;, and &quot;Angel&quot;) and was highly lauded by critics, including a review from the Washington Post proclaiming it the best hip hop album of 2006.\n\nIn 2008, following the addition of Paige to the group, Flipsyde once again had a song of theirs selected as a theme song for the Olympics. This time their song &quot;Champion&quot; was chosen as the theme for the 2008 Summer Olympics in Beijing, China, as well as the primary song for EA Sports NBA Live 09 video game. They enjoy touring in India, where their first tour took place in 2005 via VH1's Hip Hop Hustle, and have already performed there twice and may be planning a third trip. Recently it was announced through their MySpace that they had started touring with Akon, promoting their second studio album, State of Survival, produced by Akon and Konvict Muzik. The album has started to circulate for release on varying dates across the world via Kon Live Distribution and Cherrytree Records, and contrary to earlier reports Akon is not featured vocally on any tracks. During the production of Lady GaGa's first single, &quot;Just Dance&quot;, the members of Flipsyde made a cameo in the video with the members displayed sitting around in a screen shot and Chantelle holding a disco ball sitting next to Piper. Steve Knight and Dave Lopez are seen in the lower corners of the screen.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:85238468b087ec537ae12c54b5f3fc6af0234d51","amp;dn":"Flipsyde+-+When+It+Was+Good+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85238468b087ec537ae12c54b5f3fc6af0234d51","infoHashBuffer":{"type":"Buffer","data":[133,35,132,104,176,135,236,83,122,225,44,84,181,243,252,106,240,35,77,81]},"announce":[],"urlList":[]}}