{"title":"Aces of the Deep [dos]","uid":6217043,"size":5296023,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:854832736de28a769f1256d455673a60d36a9a30&amp;dn=Aces+of+the+Deep+%5Bdos%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtSposh","files":1,"time":1299197991,"description":"Aces of the Deep is a World War II U-boat combat simulation game developed and published by Dynamix for MS-DOS in 1994.\n\n&quot;Aces of the Deep&quot; was the last installment of Dynamix &quot;Aces&quot; series, which included the flight simulators Red Baron, Aces of the Pacific and Aces Over Europe. However, unlike its predecessors, &quot;Aces of the Deep&quot; places you at the command of a German Navy U-Boat during the Second World War. The game includes single mission mode, where the player can choose to attack a convoy, a task-force of warships (consisting of cruisers and/or battleships), or a carrier task-force in a variety of conditions. There are also several historical missions where the player can replay the role of some of Germany's greatest U-Boat captains.\n\nAlongside the single missions, &quot;Aces of the Deep&quot; includes a single player &quot;Career Mode,&quot; where the player can choose which year of the war he wants to start his career, up until the end of the war. Career features the &quot;Nightclub&quot; for war news and scuttlebutt for viewing the tonnage board. Within the Career Mode the player can receive promotions, medals, and opportunities to take command of newer U-Boats. There are three models of U-Boats in several variations for the player to choose from, each of which becomes available during its historical period.\n\nThe game includes a rich variety of ships, ranging from oil tankers and merchantmen to large troop ships, several different escorts such as corvettes, frigates and destroyers, and warships such as cruisers, battleships and carriers. It also includes a variety of aircraft on anti-submarine patrols. All these vessels are historically based, and their appearance in the game coincides with their historical appearance on the battlefield. The tactics and weapons used by the ships within the game is also historically based.\n\nThough it suffers from obsolete graphics, it is still considered by many[attribution needed] to be the best subsim to date, for it revolved around its highly randomized and replayable single player &quot;Career Mode&quot;, also found in SSI's Silent Hunter.","torrent":{"xt":"urn:btih:854832736de28a769f1256d455673a60d36a9a30","amp;dn":"Aces+of+the+Deep+%5Bdos%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"854832736de28a769f1256d455673a60d36a9a30","infoHashBuffer":{"type":"Buffer","data":[133,72,50,115,109,226,138,118,159,18,86,212,85,103,58,96,211,106,154,48]},"announce":[],"urlList":[]}}