{"title":"Democracy Now - 07 dec 2010","uid":6019104,"size":456448058,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:856cbd176c5afc5c29e940e5eafaabda591ade81&amp;dn=Democracy+Now+-+07+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1291740147,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 07, 2010\n\n- WikiLeaks Founder Assange Detained in Britain\n- Holder: U.S. Continues WikiLeaks Probe\n- Cables: U.S. Has Contingency Plan for Russian Attack in Eastern Europe\n- Pakistani PM Cites U.S. Sway on Military; Iraqis View Saudi Arabia as Chief Threat\n- Despite Public Stance and Polls, U.S. Opposes Taliban Reconciliation\n- Obama-GOP Deal Preserves Cuts to Income, Estate Taxes for Wealthiest\n- Sen. Sanders Suggests Filibuster of Tax Deal\n- 50 Killed in Pakistan Attack\n- Afghanistan Drops Private Military Ban\n- U.S. Holds Talks on North Korea\n- Argentina, Brazil, Uruguay Recognize Palestinian State in Occupied Territories\n- California Appeals Court Takes Up Same-Sex Marriage Ban\n- Supreme Court to Hear Walmart Challenge to Discrimination Case\n\n\nSpecial reports\n\n- Glenn Greenwald on the Arrest of Julian Assange and the U.S. &quot;War on WikiLeaks&quot;\n\nWikiLeaks founder Julian Assange has been arrested in London on an international warrant to face sex crime allegations in Sweden. Assange is expected to face a hasty extradition process to Sweden. We speak with Glenn Greenwald, constitutional attorney and blogger at Salon.com. Greenwald says, &quot;Whatever you think of WikiLeaks, they've never been charged with a crime, let alone indicted or convicted... They've been essentially removed from the internet... Their funds have been frozen... Leading politicians and media figures have called for their assassination, their murder, to be labeled a terrorist organization. What's really going on here is a war over control of the internet and whether or not the internet can actually serve what a lot of people hoped its ultimate purpose was, which was to allow citizens to band together and democratize the checks on the world's most powerful factions.&quot;\n\n\n- Chief EU Climate Negotiator: WikiLeaks Cables' Account of Copenhagen Manipulation &quot;One-Sided and Selective&quot;\n\nWikileaks is a hot topic at the CancÃƒÂºn Climate Summit after secret diplomatic cables revealed new details about how the United States manipulated last year's climate talks in Copenhagen. The Guardian newspaper reported the cables provide evidence that spying, threats and promises of aid formed part of U.S. diplomatic offensive to shore up the controversial Copenhagen accord. Amy Goodman questions European Union Commissioner for Climate Action Connie Hedegaard about the account of her discussion with U.S. negotiators on leveraging climate aid to gain the support of vulnerable nations.\n\n\n- U.S. Negotiator Refuses to Answer Questions on WikiLeaks Cables' Account of Climate Talks Manipulation\n\nAt the U.N. Climate Change Conference in CancÃƒÂºn, U.S. Special Envoy for Climate Change Todd Stern refuses to comment on the WikiLeaks cables' account of discussions with the European Union on using climate aid to gain the backing of small island states for the informal Copenhagen accord reached at last year's U.N. climate summit. He also avoided answering a question addressing the removal of funding to Bolivia and Ecuador, whose governments opposed the accord.\n\n\n- Guardian Environment Editor John Vidal on WikiLeaks Cables and U.S. Manipulation of Climate Talks\n\nJohn Vidal, the environment editor for the Guardian of London, is in Cancun after reporting on the Copenhagen summit a year ago. The Guardian is one the five news outlets to receive the massive trove of WikiLeaks cables ahead of time and has been publishing new revelations every day. We speak to Vidal about the latest diplomatic cables on the U.S. manipulation of the climate talks.\n\n\n- Bill McKibben: Climate Talks So Weakened by U.S., Major Polluters That Walkout Could Be Good News for Planet\n\nLongtime environmental writer and activist and 350.org Founder Bill McKibben has won the 2010 Puffin/Nation Prize for Creative Citizenship. Speaking outside the U.N. Climate Change Conference in CancÃƒÂºn, McKibben says: &quot;In certain ways, [a U.S. walk-out] would be the best thing that could happen. For 15 years ... the U.S. comes and says, weaken the agreement so Congress can go along. Then Congress does not agree anyway. It has wrecked the whole process time after time after time and now the U.S. is doing it again.&quot;\n\n\n- Nigerian Environmental Activist Nnimmo Bassey Wins Right Livelihood Award\n\nLongtime activist Nnimmo Bassey has been awarded the 2010 Right Livelihood Award for &quot;revealing the full ecological and human horrors of oil production&quot; by multinational corporations in Nigeria and for his leadership in advocating environmental justice and human rights throughout the world. During his speech, Bassey blasted rich nations for their efforts to use carbon markets as a mechanism to mitigate global warming.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:856cbd176c5afc5c29e940e5eafaabda591ade81","amp;dn":"Democracy+Now+-+07+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"856cbd176c5afc5c29e940e5eafaabda591ade81","infoHashBuffer":{"type":"Buffer","data":[133,108,189,23,108,90,252,92,41,233,64,229,234,250,171,218,89,26,222,129]},"announce":[],"urlList":[]}}