{"title":"Kevin Spencer - Complete","uid":6105375,"size":21093830722,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:864f2e4057c7dea45f8462ac5687a976338da433&amp;dn=Kevin+Spencer+-+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"Duthos","files":-1,"time":1295137416,"description":"A truly hilarious show that seems to have been forgotten in the annuls of time. When I went looking to collect this I had one hell of a time finding it anywhere, to buy or download. I managed to find all the episodes from various torrents around the net and compiled them into this collection.\n\nI never understood why this wasn't more popular. It is funny as hell and lasted 8 seasons, but no one is pining for it to come back. Who knows, maybe having a complete collection available will introduce some new people, and maybe even rekindle interest for this lost treasure.\n\nSeason One - You may want to skip this. You miss little of signifigance and it looks as low budget as you can get (think south park season one)\n\nQuality - These are the only versions I could find. Most of them are about TV quality, but one episode is particularily bad. I included it for completions sake (also I forgot which one it is). If you have a better version and wish to upload it I will update this torrent\n\nAside - Every person who comments &quot;plz seed&quot; or any variation of that message, is a total fucking idiot too stupid to understand that not a single person has ever, or will ever, seed because of a comment to do so. People who have the means, file and inclination will seed, and those that don't, don't.\n\nAnyway, I hope you enjoy Kevin Spencer as much as I.","torrent":{"xt":"urn:btih:864f2e4057c7dea45f8462ac5687a976338da433","amp;dn":"Kevin+Spencer+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"864f2e4057c7dea45f8462ac5687a976338da433","infoHashBuffer":{"type":"Buffer","data":[134,79,46,64,87,199,222,164,95,132,98,172,86,135,169,118,51,141,164,51]},"announce":[],"urlList":[]}}