{"title":"On Borrowed Time","uid":5951014,"size":1264575712,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:866c94237398512c6021db743d44b03be88857d9&amp;dn=On+Borrowed+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"timelyone","files":-1,"time":1289525936,"description":"On Borrowed Time is a 1939 film about the role death plays in life, and how humanity cannot live without it. It is adapted from Paul Osborn's 1938 Broadway hit play. The play, based on a novel by Lawrence Edward Watkin, has been revived twice on Broadway since its original run.\n\nSet in small-town America, the film stars Lionel Barrymore, Beulah Bondi and Sir Cedric Hardwicke. Barrymore plays Julian Northrup, a wheelchair user (Barrymore had broken his hip twice previously and was now using a wheelchair, though he continued to act), who, with his wife Nellie, played by Bondi, are raising their orphaned grandson, Pud.\n\nPlot\n\nOne day the fedora-wearing Mr. Brink (the personification of death, played by Sir Cedric Hardwicke), who has recently taken Pud's (Bobs Watson) parents in an auto wreck, comes for Gramps (Lionel Barrymore). Not knowing who he's talking to, the crotchety old Gramps orders Mr. Brink off the property. Later, Mr. Brink takes Granny Nellie (Beulah Bondi).\n\nPud, Gramps' grandson, tells him that when he does a good deed, he will be able to make a wish. Because his apples are constantly being stolen, Gramps wishes that anyone that climbs up his apple tree will have to stay there until he lets them down.\n\nPud's aunt, Demetria Riffle (Eily Malyon), has designs on Pud and especially the money left him by his parents. Gramps spends much time fending off her efforts to adopt the boy.\n\nWhen Mr. Brink returns for Gramps, the old man realizes who his visitor is and determined not to leave Pud to Demetria, Gramps tricks Mr. Brink into climbing the old tree. While stuck in the tree, he cannot take Gramps or anyone else. The only way anyone or anything can die is if they touch Mr. Brink or the apple tree.\n\nMeanwhile, Demetria plots to have Gramps committed to the insane asylum for claiming that Death is trapped in his apple tree. He proves his story is true by shooting the man who has come to take him to the asylum - the man lives, when he should have died.\n\nGramps's doctor (Henry Travers) is now a believer, but he tries to convince Gramps to let Death down so people who are suffering can find release. Gramps refuses. Mr. Brink dares Pud to climb the tree. Pud gets over the fence Gramps has had built around the tree, but falls and is crippled for life. Distraught, Gramps lets Death down from the tree. He takes both Gramps and Pud, who find they can walk again. In the final scene, they walk together up a beautiful country lane and hear Grandma calling to them from beyond a brilliant light.\n\nCast:\n\n    * Lionel Barrymore as Julian Northrup (Gramps)\n    * Cedric Hardwicke as Mr. Brink (as Sir Cedric Hardwicke)\n    * Beulah Bondi as Nellie Northrup (Granny)\n    * Una Merkel as Marcia Giles, the Northrups' housekeeper\n    * Bobs Watson as John 'Pud' Northrup\n    * Nat Pendleton as Mr. Grimes\n    * Henry Travers as Dr. James Evans\n    * Grant Mitchell as Ben Pilbeam, Gramps' lawyer\n    * Eily Malyon as Demetria Riffle\n    * James Burke as Sheriff Burlingame\n    * Charles Waldron as Reverend Murdock\n    * Ian Wolfe as Charles Wentworth\n    * Phillip Terry as Bill Lowry, Ben Pilbeam's assistant and Marcia's boyfriend\n    * Truman Bradley as James Northrup\n","torrent":{"xt":"urn:btih:866c94237398512c6021db743d44b03be88857d9","amp;dn":"On+Borrowed+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"866c94237398512c6021db743d44b03be88857d9","infoHashBuffer":{"type":"Buffer","data":[134,108,148,35,115,152,81,44,96,33,219,116,61,68,176,59,232,136,87,217]},"announce":[],"urlList":[]}}