{"title":"The Office S07E01-09 (PSP, iPod, Zune)","uid":5990591,"size":756085530,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:86fb56f632a991e7772dabf9f763768e1690904f&amp;dn=The+Office+S07E01-09+%28PSP%2C+iPod%2C+Zune%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"qwersd","files":9,"time":1290876236,"description":"The American television comedy The Office was renewed by NBC for a seventh season on March 5, 2010. The season premiered on September 23, 2010 and will air on Thursdays at 9:00 p.m. ET as part of Comedy Night Done Right.On June 28, 2010, it was confirmed that the seventh season will be Steve Carell's last on the show, as his contract expires.[4] NBC plans on continuing the series after his departure, and would welcome any return appearances by Carell.[5] Actor and writer/co-executive producer B. J. Novak has renewed his contract with Universal Media Studios through an eighth season and will be promoted to full executive producer halfway through the seventh season.[6] As of this season, Zach Woods, who plays Gabe Lewis on the show, has been promoted to a series regular.[7] Executive producer/writer/actor Paul Lieberstein has confirmed that Amy Ryan, who portrays Holly Flax, will appear in eight episodes of the season. He also confirmed Kathy Bates will return as Jo Bennett in the season premiere.[8] Melora Hardin, who portrays Jan Levinson, has announced on her Twitter account that she will return this season.[9] Timothy Olyphant will guest star in at least two episodes as a rival salesman.[10] It is also revealed that Pam dated Olyphant's character while Jim dated Karen.[11] Holly will return to Dunder Mifflin in the hour-long Christmas episode that will be written by Mindy Kaling and directed by Rainn Wilson.[12]\nThe seventh season of the show is produced by Reveille Productions and Deedle-Dee Productions, both in association with Universal Media Studios. The show is based upon theseries created by Ricky Gervais and Stephen Merchant, both of whom are executive producers on both the US and UK versions.[13] The Office is produced by Greg Daniels,[13] who is also an executive producer. Returning writers from the previous season include Mindy Kaling, B. J. Novak, Paul Lieberstein, Brent Forrester, Justin Spitzer, Aaron Shure, Charlie Grandy, Daniel Chun, Warren Lieberstein, and Halsted Sullivan. New writers in the seventh season include Peter Ocko, Jon Vitti, Steve Hely, and Carrie Kemper (sister of Ellie Kemper). Lieberstein serves as executive producer and showrunner. Kaling, Novak, Shure, Chun and Ocko are co-executive producers; Forrester and Vitti are consulting producers; Spitzer and Grandy are supervising producers; and Warren Lieberstein, Halsted Sullivan and Steve Hely are producers.\n\nThese files will work on all iPods &amp; PSP's and should also work on Zune but I can't confirm it.\n\nSource of these files are 720p files and I have encoded them using Handbrake.\n\nPlease seed these files atleast to 1:1 ratio.","torrent":{"xt":"urn:btih:86fb56f632a991e7772dabf9f763768e1690904f","amp;dn":"The+Office+S07E01-09+%28PSP%2C+iPod%2C+Zune%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86fb56f632a991e7772dabf9f763768e1690904f","infoHashBuffer":{"type":"Buffer","data":[134,251,86,246,50,169,145,231,119,45,171,249,247,99,118,142,22,144,144,79]},"announce":[],"urlList":[]}}