{"title":"Tina Turner-What's Love Got To Do With It(B&amp;W Version)(Xvid-2na","uid":6038092,"size":40933530,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:87904b73f2e52a22928cb58c3e656992010b0e6d&amp;dn=Tina+Turner-What%5C%27s+Love+Got+To+Do+With+It%28B%26W+Version%29%28Xvid-2na&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292302449,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:48\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1307 Kbps\nQuality Factor : 0.26 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\n\nTina Turner - What's Love Got To Do With It (Black &amp; White Version)(Xvid-2nafish)\n\n\n\nThis video has no logos or titles.\n\n\n&quot;What's Love Got to Do with It&quot; is the second single released from Tina Turner's breakthrough solo debut album, Private Dancer. In the UK and Continental Europe it was the third single, following Turner's cover of The Beatles' &quot;Help!&quot;. The song is widely credited for the huge success of the Private Dancer album itself. &quot;What's Love Got to Do With It&quot; is arguably Tina Turner's most popular and successful single, becoming her first number-one hit in the United States and establishing Tina Turner as a mainstream Pop and Rock artist, while also reaching number one in Australia and number three in the UK. In 1993, the song's name was used as the title for What's Love Got to Do With It, a biographical film about Turner's life leading up to the actual release of the song. The music video was directed by Mark Robinson. It is ranked #309 on the Rolling Stone magazine's list of &quot;The 500 Greatest Songs of All Time&quot;. It also ranked #38 on Songs of the Century. It was the 17th best-selling single of 1984 in the UK. The song was originally recorded by UK pop group Bucks Fizz, but unreleased until 2000.\n\nThe video features Turner walking down the street, intercut with scenes when she's singing directly to the viewers. The video was shot in New York City during the summer of 1984. There's also an alternative black and white video for the song aimed at more mature audiences.\n\nTina Turner had not had a top twenty single in thirteen years, and Capitol Records did not expect the song to turn out to be the hit it became. The song was originally written for the R&amp;B singer Phyllis Hyman. &quot;What's Love Got to Do With It&quot; went straight to number one on the Billboard Hot 100, and remained there for three weeks, becoming Turner's first number one hit. Billboard ranked it as the number two single of 1984. Tina Turner's first single (&quot;A Fool in Love&quot; with her then-husband Ike) had charted in 1960, and she achieved her first number-one single on September 1, 1984, which set a new record from the longest span between an artist's first charted record and first number-one single (a difference of 24 years, to the exact week). It also established another record, as Turner was 45-years-old when the song went to number one, making her the oldest female artist to place a number-one single on the Hot 100, until Grace Slick (with Starship) broke the record twice (in 1985) with &quot;We Built This City&quot; and 1987 with &quot;Nothing's Gonna Stop Us Now&quot;). Cher later broke Slick's record in 1999, who was 53 when &quot;Believe&quot; hit #1.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:87904b73f2e52a22928cb58c3e656992010b0e6d","amp;dn":"Tina+Turner-What%5C%27s+Love+Got+To+Do+With+It%28B%26W+Version%29%28Xvid-2na","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87904b73f2e52a22928cb58c3e656992010b0e6d","infoHashBuffer":{"type":"Buffer","data":[135,144,75,115,242,229,42,34,146,140,181,140,62,101,105,146,1,11,14,109]},"announce":[],"urlList":[]}}