{"title":"Accepted(2006)DVDRip.AC3(ENG)-DROCK","uid":6063464,"size":733657088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:87ac4f1d31e4c22fd2d742afbf65d8f037af35f8&amp;dn=Accepted%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1293222740,"description":"When the weight of rejection begins to set in after being denied entry to every college he has applied to, a high school burnout attempts to placate his mom and dad and win the heart of his dream girl by scheming with his friends to create a fake university in a hilarious comedy of artificial education directed by Steve Pink and starring Justin Long. Bartleby &quot;B&quot; Gaines (Long) is a high school senior whose street smarts just never seemed to translate into the classroom, and whose bad luck in love has left him pining for the unattainable Monica (Blake Lively). When Bartleby and his rebellious crew of outcasts find the frequent college rejection letters they have all been receiving bringing endless grief from their disappointed parents, they soon band together to create the fictional South Harmon Institute of Technology. After creating a believable faÃƒÂ§ade in an abandoned psychiatric hospital, employing the talents of a close friend's brilliantly subversive uncle (Lewis Black) to pose as the dean, and creating a phony website in order to sell the school to their parents, Bartleby and friends soon realize that all of their hard work has paid off in ways than they never imagined. With a variety of college rejects attempting to enroll in classes at the ersatz university and the skepticism of some privileged students from a nearby college drawing unwanted attention to the South Harmon Institute of Technology, Bartleby and friends find their ruse becoming ever more difficult to maintain.\n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:87ac4f1d31e4c22fd2d742afbf65d8f037af35f8","amp;dn":"Accepted%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87ac4f1d31e4c22fd2d742afbf65d8f037af35f8","infoHashBuffer":{"type":"Buffer","data":[135,172,79,29,49,228,194,47,210,215,66,175,191,101,216,240,55,175,53,248]},"announce":[],"urlList":[]}}