{"title":"Gorgeousaurus DVD","uid":6118191,"size":555153408,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:880dfe8c728ed8fe32d92c7d06fd1a06d96efc09&amp;dn=Gorgeousaurus+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sockerkakan","files":11,"time":1295646063,"description":"In the video, children construct their own trumpets and trombones out of plastic pipes, tubes, funnels and cups, then perform a song together, as a DIY brassband from a shut down mining town. The elegiac song 'Where do we go from here?', from an episode of TV-show Buffy the Vampire Slayer, plays over images of empty tunnels, overgrown slag heaps, and abandoned machinery.\n\n\nFrom the catalogue text of the 4:th Bucarest Biennale:\n\n&quot;An interest in the events of PiaÃ…Â£a UniversitÃ„Æ’Ã…Â£ii in 1990, when Romanian miners from the Jiu Valley attacked protesters who had gathered in a square in Bucarest to demand the resignation of a neo-communist government, led to a series of meetings with both people involved in the actual events and also with researchers trying to untangle the facts from the myths. Confusion, uncertainty, shifting allegiances and ideals seems to define the event, and history seems written based on conflicting personal testimony. Some testimonials lament the lost chance for a founding myth, based on the event.\n \nVisiting the mining communities in Jiu Valley brought associations to the area in south Sweden where I grew up, where the landscape is perforated by miles of flooded tunnels and shafts, since the coal mines were shut down in the 1960's. A plastic dinosaur stands on the overgrown slag heap atop what used to be the biggest coal mine in Sweden.&quot;\n\n\nEssayistic work split into various media, where each module adds to the story from a different perspective and in a different tone - a poetical videoinstallation, a published newspaper article, rambling associative live talks and presentations - each connecting the modules of the larger story in a different way.\n\n","torrent":{"xt":"urn:btih:880dfe8c728ed8fe32d92c7d06fd1a06d96efc09","amp;dn":"Gorgeousaurus+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"880dfe8c728ed8fe32d92c7d06fd1a06d96efc09","infoHashBuffer":{"type":"Buffer","data":[136,13,254,140,114,142,216,254,50,217,44,125,6,253,26,6,217,110,252,9]},"announce":[],"urlList":[]}}