{"title":"Democracy Now - 02 mar 2011","uid":6213785,"size":454443038,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8852cf1c768d4d8cca2d5f31a172047acfddbb81&amp;dn=Democracy+Now+-+02+mar+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1299083724,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 02, 2011\n\n- Thousands Protest Anti-Union Bill in Ohio\n- Wisconsin Gov. Proposes Drastic Spending Cuts to Districts, Education\n- Gaddafi Forces Launch New Attacks\n- U.S. Warships Head Toward Libya\n- Venezuela Accuses U.S. of &quot;War Mongering&quot;\n- Yemenis Protest Saleh in Largest Protests to Date\n- Thousands Join Anti-Gov't Protests in Iran\n- Pakistani Minister Who Opposed Blasphemy Laws Slain\n- House Avoids Shutdown With Short-Term Budget Measure\n- Supreme Court Rejects Privacy Rights for Corporations in FOIA Cases\n- Report: Tax Cuts Could Cost 19 States $5.3 Billion\n- Untreated Radioactive Wastewater from Hydrofracking Dumped in Rivers, Streams\n- Dems Urge Probe of Firms Linked to Chamber of Commerce\n\n\nSpecial reports\n\n- Prof. Horace Campbell: Peace &amp; Justice Movement Should Oppose U.S.-Led Intervention in Libya\n\nForces aligned with Libyan leader Col. Muammar Gaddafi have launched new assaults to regain control of several towns captured in a popular uprising over the past two weeks. Meanwhile, two U.S. warships have moved through the Suez Canal into the Mediterranean Sea towards Libya under orders by U.S. Defense Secretary Robert Gates. As talk of potential Western military intervention grows, we speak to Horace Campbell, a professor of African American Studies and Political Science at Syracuse University.\n\n\n- U.N.: More Than 140,000 Have Fled Libyan Clashes\n\nReports have emerged of a dire situation on Libya's borders with Tunisia and Egypt, where tens of thousands have fled to evade the clashes. We speak to Elizabeth Tan of the Office of the United Nations High Commissioner for Refugees.\n\n\n- U.S. Silent on Deadly Iraqi Gov't Crackdown on Protests; 300 Arrested in Sweeps Targeting Dissidents\n\nWhile the United States has sharply criticized the Libyan government for brutally cracking down on opposition protesters, it has remained noticeably silent on the recent attacks against Iraqi dissidents. On Friday, tens of thousands of people participated in Iraq's largest protest in years. Although the protests were largely peaceful, authorities fired water cannons, sound bombs and live bullets to disperse crowds as Iraqi army helicopters buzzed overhead, killing an estimated 29 people. Then on Sunday, U.S.-backed Iraqi security forces detained about 300 people, including prominent journalists, artists and lawyers who had taken part in the rallies.\n\n\n- Labor Protests Spread: Thousands Rally Against Anti-Union Bill in Ohio\n\nLabor protests are continuing across the country from Idaho to Indiana as Republican state lawmakers attempt to push through legislation aimed at crushing public employee unions. In Ohio, 20,000 workers and protesters rallied in Columbus on Tuesday to oppose a bill to end collective bargaining rights for state employees. Harvey Wasserman, editor of the Ohio-based The Free Press, spoke to Democracy Now! from the rally.\n\n\n- As Demonstrators Remain Locked Out, Wisconsin Gov. Walker Unveils Budget to Slash Education, Gov't Aid\n\nWisconsin Gov. Scott Walker has unveiled a budget slashing aid to schools and local districts, cutting an estimated 12,000 jobs. Critics say the plan would devastate Wisconsin's public education system. As Gov. Walker spoke, thousands of protesters were being denied entry to the state Capitol despite a court order to open the building to the public. We speak speak with Mary Bottari of the Madison-based Center for Media and Democracy's Real Economy Project.\n\n\n- Indiana Dems Vow to Remain in Illinois to Stall Anti-Union Bill\n\nMirroring their Wisconsin counterparts, 35 Democratic members of the Indiana Assembly have fled to Illinois to deny Republicans quorum for a vote on a similar anti-union bill. We speak to Indiana State Rep. Matt Pierce from Illinois.\n\n\n- Idaho Students Stage Walk-Out to Oppose Teacher Layoffs, Collective Bargaining Curbs\n\nHundreds of high school students in Idaho have walked out of classes to protest a plan to lay off public school teachers and curtail their collective bargaining rights. We speak to student activist Jonny Saunders of Timberline High School in Boise.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:8852cf1c768d4d8cca2d5f31a172047acfddbb81","amp;dn":"Democracy+Now+-+02+mar+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8852cf1c768d4d8cca2d5f31a172047acfddbb81","infoHashBuffer":{"type":"Buffer","data":[136,82,207,28,118,141,77,140,202,45,95,49,161,114,4,122,207,221,187,129]},"announce":[],"urlList":[]}}