{"title":"Krokus - Eat The Rich (2nafish)","uid":5956170,"size":154966020,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8a0f4dc4281aaefa9b8d1a6db6d79c6a43ccb6c6&amp;dn=Krokus+-+Eat+The+Rich+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1289729733,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nHeadhunter is the seventh album by Krokus and was released in 1983. It achieved platinum album status in the United States, and was a gold album in Canada and Switzerland. The track &quot;Screaming in the Night&quot; was the band's biggest hit to date, and is still played on classic rock radio stations. Headhunter is the only Krokus album to feature Steve Pace on drums and includes the Bachman-Turner Overdrive cover &quot;Stayed Awake All Night&quot;.\n\nKrokus is a hard rock/heavy metal band from Switzerland. They enjoyed moderate success in North America during the 1980s.\n\nKrokus was founded in Solothurn in 1974 by bassist (and original lead vocalist) Chris von Rohr and guitarist Tommy Kiefer. Former Eazy Money vocalist Marc Storace joined the band as frontman in time for their Metal Rendez-vous album in 1980.\n\nOn 18 November 2007 the line up featuring Chris von Rohr, Fernando von Arb, Fready Steady and Marc Storace reunited to play a medley (&quot;Tokyo Nights&quot;, &quot;Bedside Radio&quot; and &quot;Heatstrokes&quot;) during the TV show Die grÃƒÂ¶ssten Schweizer Hits on Swiss television. This event broke the ice between the members of the 1982 formation and led to their reunion concert on 2 August 2008.\n\nKrokus's cover of Sweet's &quot;The Ballroom Blitz&quot; also appeared in the 2007 game Guitar Hero Encore: Rocks the 80s.\n\nIt was announced on 20 April 2008 that the classic lineup of Chris von Rohr, Fernando von Arb, Freddy Steady, Mark Kohler and Marc Storace had reunited and would be releasing a new studio record in 2010 with a supporting world tour.\n\nOn 2 August 2008 the band performed live in the Stade de Suisse in Bern.\n\nKrokus will perform the official anthem of the 2009 Ice Hockey World Championships, which are hosted by their home country of Switzerland. The song is entitled &quot;Live for the Action&quot;.\n\nAs of March 3, 2010 their latest album, Hoodoo including cover to Steppenwolf's classic &quot;Born To Be Wild&quot; and more ten songs, is available in stores (at least in Switzerland). It comes in a regular edition and also in a what they call &quot;limited&quot; edition (even though it is unlikely to be &quot;limited&quot; in the regular sense, but rather just a &quot;special version&quot;) that comes packed with a (most likely exclusive) DVD featuring concert footage.\n\nThe band name &quot;Krokus&quot; evolved from the word for a flower common to the region of southern Europe, the crocus. Early in the spring of 1975, band founder Chris von Rohr observed a field of these flowers while traveling by train. He was returning from L'Ecole des Chefs located in France after an aborted career in the culinary arts, and it was around this time the idea for a Metal band was formed. The band members stated that it was the perfect name, since it features &quot;Rock&quot; right in the middle.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8a0f4dc4281aaefa9b8d1a6db6d79c6a43ccb6c6","amp;dn":"Krokus+-+Eat+The+Rich+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a0f4dc4281aaefa9b8d1a6db6d79c6a43ccb6c6","infoHashBuffer":{"type":"Buffer","data":[138,15,77,196,40,26,174,250,155,141,26,109,182,215,156,106,67,204,182,198]},"announce":[],"urlList":[]}}