{"title":"Star.Sentinel.Tactics-SKIDROW","uid":6037664,"size":844183198,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8a6c80b1f5c04933fab6f7d2c5bddee2fa7352db&amp;dn=Star.Sentinel.Tactics-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rlf-rls","files":-1,"time":1292289270,"description":"Star Sentinel Tactics / Tri Synergy\n\nRELEASE DATE : 13-12-2010              PROTECTION : SecuROM            \nGAME TYPE    : Strategy                DISKS      : 1 DVD \n\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible\n\ntwice the fun \\/ double the trouble\n\n\nOn with the game release information:                         \n                                                             \nStar Sentinel Tactics is a turn-based tactics game that puts   \nyou in command of a squad of elite United Alliance marines -   \naka the Star Sentinels - as they battle to stop a race of     \nbloodthirsty reptilians launching a devastating attack on our  \nGalaxy. Along the way you'll encounter giant mechs, rotting    \nzombies, mutants and a host of other foes, all intent on your  \ndestruction.\n                                                               \nStar Sentinel Tactics takes the classic turn-based tactical    \ncombat of classic 2D turn-based strategy games, and brings it  \nback up to date with beautiful 3D graphics, realistic          \nline-of-sight, an engaging story, and an array of new weapons  \nand enemies. This is 100% pure tactical combat, with no        \nbase-building, no research trees, no resource management and   \nno strategic planning and absolutely no random encounters.     \n                                                               \n28 hand-crafted missions, requiring a wide range of tactical   \napproaches. Use stealth, provide cover fire, snipe, set up     \nambushes, hold strategic positions, rescue fallen comrades or  \njust go for an all out brute force attack.                     \n                                                              \nAn engaging storyline, sharp dialogue and a cast of            \ncompelling characters. Or, if you prefer, just skip all the    \ntalking and get on with the tactical action.                   \n                                                               \nComplex scripted AI opponents who will try to pin you down,    \nsnipe you, ambush you, flush you out or just come in all guns  \nblazing.                                                       \n                                                               \nDozens of different weapons to utilize, including handguns,   \nrifles, shotguns, assault rifles, grenades, melee weapons and  \na range of laser and plasma weaponry.                          \n                                                               \nFully moddable game engine, allowing almost everything to be   \nedited with basic knowledge of XML and Lua. Create your own  \nmissions or modify existing ones. Create new weapons, new     \nenemies or allies. Write your own scripted cutscenes. Write    \nyour own AI scripts for enemies. Full access to the game       \nengine, and the same tools used to create the game. Modify     \ngraphics, lighting, materials and textures, or add your own.\n\n\nInstall Notes:\n\n1. Unpack release                                              \n2. Mount image or burn it                                      \n3. Install                                                     \n4. Copy the cracked content from the SKIDROW folder on the DVD \n   to the main installation folder and overwrite               \n5. Play the game  \n\nSupport the companies, which software you actually enjoy!\n\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\n\n\n\nCHRISTMAS IS COMING :) SUPPORT THE SOFTWARE DEVELOPERS AND BUY \n\n        SOME NICE GAMES FOR YOUR FRIENDS AND FAMILY. \n\n","torrent":{"xt":"urn:btih:8a6c80b1f5c04933fab6f7d2c5bddee2fa7352db","amp;dn":"Star.Sentinel.Tactics-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a6c80b1f5c04933fab6f7d2c5bddee2fa7352db","infoHashBuffer":{"type":"Buffer","data":[138,108,128,177,245,192,73,51,250,182,247,210,197,189,222,226,250,115,82,219]},"announce":[],"urlList":[]}}