{"title":"Cuentame.Como.Paso.12X06.HDTV.Xvid.Spanish.By.Ainhdesi","uid":6050539,"size":770527344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8b232392528f29094526a8837d01b8c2c1219e1e&amp;dn=Cuentame.Como.Paso.12X06.HDTV.Xvid.Spanish.By.Ainhdesi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ainhdesi","files":3,"time":1292708692,"description":"12X06 - El empujoncito\nSeptiembre de 1978. La posiciÃƒÂ³n de Antonio en el Ministerio tiene sus privilegios o por lo menos es lo que piensan alguno. Desi le pide a Antonio que le eche una mano a Clara, ya que va a presentarse a una oposiciÃƒÂ³n para bedel en Agricultura. Antonio intentarÃƒÂ¡ hacer todo lo posible, aunque no siempre las cosas salen como uno quiere ni siendo Director General. Mercedes no acaba de congeniar con Pituca, pero visto el interÃƒÂ©s que pone ella no puede negarse a la propuesta que le hace de ir de compras. Lo que parecÃƒÂ­a que iba a ser una tranquila tarde de tiendas se acaba complicado debido a las excentricidades de su vecina. La cosa tambiÃƒÂ©n se complica para Toni. A la desapariciÃƒÂ³n de las pruebas testificales del juicio de despidos masivos se une el hecho de que el ÃƒÂºnico testigo que tenÃƒÂ­an decide no acudir a la audiencia. Mientras, en casa la situaciÃƒÂ³n con InÃƒÂ©s continÃƒÂºa tensa y mÃƒÂ¡s desde que Toni se ha enterado que mantiene una relaciÃƒÂ³n con Jaime. Toni no acaba de ver al novio de su hermana con buenos ojos, y serÃƒÂ¡ Cecilia la que le confirme lo que ÃƒÂ©l ya sospechaba. Luis, el amigo de la infancia de Carlos, vuelve al barrio con una sorprendente noticia que dejarÃƒÂ¡ a todos boquiabiertos. Y es que aunque acaban de cumplir la mayorÃƒÂ­a de edad algunos ya piensan en sufuturo mÃƒÂ¡s inmediato. Por su parte, Miguel estÃƒÂ¡ disgustado porque desde que discutiÃƒÂ³ con Francoise y se fue a ParÃƒÂ­s con su madre no ha vuelto a saber nada de ella. ","torrent":{"xt":"urn:btih:8b232392528f29094526a8837d01b8c2c1219e1e","amp;dn":"Cuentame.Como.Paso.12X06.HDTV.Xvid.Spanish.By.Ainhdesi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b232392528f29094526a8837d01b8c2c1219e1e","infoHashBuffer":{"type":"Buffer","data":[139,35,35,146,82,143,41,9,69,38,168,131,125,1,184,194,193,33,158,30]},"announce":[],"urlList":[]}}