{"title":"Jade Dynasty Vengeance [MAC] ~ {Port}","uid":6046416,"size":4699983919,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:8b2b12c66de0725378fad42626e1ab1b8f34693a&amp;dn=Jade+Dynasty+Vengeance+%5BMAC%5D+%7E+%7BPort%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Poeticile","files":2,"time":1292570263,"description":"From WIKI:\n\n\nJade Dynasty revolves around the conflict between 5 factions called Jadeon, Skysong, Vim, Lupin and Modo, and their eventual goal of attaining immortality.\nPlayers can join one of the factions at level 15. Each faction in Jade Dynasty has different skills, strengths, weaknesses and styles of play.\n\nJadeon: Magician (nuker) or glass cannon class. Jadeon have powerful long-distance and AoE (area of effect) attacks but low HP and armor.\nSkysong: Priest (healer) class. Skysong have some long-distance and AoE (area of effect) magic attacks, but their skills focus mainly on healing and buffing other players.\nVim: Tanker class. Vim have heavy armor, high HP low SP, and are good at melee combat.\nLupin: Assassin class. High crit rates, high crit bonus, high HP and fast, but have low defense.\nModo: Tanker/DoT'er(Damage over Time)/Magician class. Has 3 forms Human, Demonic, and Modon, and each form has different benefits, Human low HP and average SP the AOE form; Demonic High HP and average SP the melee form; Modon average HP and High SP uses a series of draining attacks the Ranged form.\nArden: Archer class. One of the Athan (demigod) classes. Low HP and armor. Average SP. Long range, fast, powerful, and can summon monsters and AOE plants. Close to Lupin, but not quite as high of a crit rate.\nBalo: Another tanking class. One of the Athan (demigod) classes. High defense decent offense, perfect for tanking. Close to the Vim class. Extremely good at De-buffing targets.\nRayan: Master of the Shadows. Can enter stealth mode as well as summon shadow clones of themselves to aid in combat.Arrived August 25 2010.\nCelan: Mystic Performer of the musical bard. A very good Support class with AOE Arrays/Songs that can hinder opponents and aid their allies. Arrived august 25 2010.\n\nVengeance Expansion\nThe new expansion dropping in July will introduce two more Demi-God factions, the Rayan and the Celan. The release date for Jade Dynasty: Vengeance is 25.8.2010 and more new classes, such as 'Voida'(Fire Mage) and 'Barbe'(Shape shifter)will appear during may-august 2011.\n\n[From Demonoid.]\n","torrent":{"xt":"urn:btih:8b2b12c66de0725378fad42626e1ab1b8f34693a","amp;dn":"Jade+Dynasty+Vengeance+%5BMAC%5D+%7E+%7BPort%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b2b12c66de0725378fad42626e1ab1b8f34693a","infoHashBuffer":{"type":"Buffer","data":[139,43,18,198,109,224,114,83,120,250,212,38,38,225,171,27,143,52,105,58]},"announce":[],"urlList":[]}}