{"title":"Tom Brokaw - The Greatest Generation Speaks","uid":6105158,"size":319324842,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8c6922057e27c27457fd22ad1c16d5f70d729f55&amp;dn=Tom+Brokaw+-+The+Greatest+Generation+Speaks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1295129165,"description":"General Information\n===================\n Title:                  The Greatest Generation Speaks\n Author:                 Tom Brokaw\n Read By:                Author &amp; Supporting Staff\n Copyright:              1999\n Audiobook Copyright:    2000\n Genre:                  Non Fiction\n Publisher:              Books on Tape\n Abridged:               No\n\nOriginal Media Information\n==========================\n Media:                  CD\n Number:                 6\n Source:                 Library\n Condition:              Good\n\nFile Information\n================\n Number of MP3s:         6\n Total Duration:         7:23:21\n Total MP3 Size:         304.48\n Parity Archive:         No\n Ripped By:              me\n Ripped With:            Magix\n Encoded With:           \n -----------\nWinRAR Each disk is a Zero compressed file with all tracks\n Encoded At:             CBR 96 kbit/s 44100 Hz Mono\n Normalize:              None\n Noise Reduction:        None\n ID3 Tags:               Set, v1.1, v2.3\n\n      \n\nBook Description\n================\nAmazon.com Review\nThe popularity and credibility of charismatic news anchor Tom Brokaw \nensured bestseller status for The Greatest Generation, Brokaw's homage \nto the Americans who survived and overcame the depression and World \nWar II. The Greatest Generation Speaks expands his thesis that we owe \na huge debt of gratitude to those tough and courageous men and women \nfor ensuring the freedoms and comforts that Americans enjoy today. Their \nstories, culled from letters, interviews, and personal histories of \nthe Greatest Generation and their family members, are anecdotal but \nextremely powerful, showing how men and women were sustained by simple \nideals of patriotism, family, and fair play. This individualistic portrait \nis exactly how Americans saw themselves: Brokaw's book is a valid reflection \nof the times.\n\nDuring a period of economic hardship and in a country united by the \nwar effort, choices were simple; few people questioned why America was \nfighting Germany and Japan. Adversity brought out the best, especially \nin an optimistic culture like America's. As the soldier who found Beethoven's \npianos in a Weimar house says after his unit is shelled, &quot;Nothing like \na close call to make the morning more beautiful.&quot; The greatest impression \nthat war veterans seem to carry back from war is a sense of comradeship \nthat, in spite of pain and loss, render their war years the most rewarding \nof all their life experiences. Modern life doesn't necessarily have \nthe same certainties. The Greatest Generation Speaks is a healthy reminder \nof the foundations on which American society is built. --John Stevenson-\n\nFrom Publishers Weekly\nBrokaw's TV anchorman voice is deep and reassuring, with a remarkable \nair of patriarchal authority. With so much puff-chested attitude, he \nlaunches into this tape's introduction, explaining that the letters \nand comments contained came to him in a responsive outpouring in reaction \nto his book The Greatest Generation, which chronicled the varied experiences \nof World War II veterans. For him, these missives expressed a shared \nsense of &quot;values,&quot; since lost in American life. The material itself \nis far less posturing, mostly clear-eyed remembrances from former soldiers, \nmedics, clergy and reporters who served in Europe and Asia. From the \nhome front come stories from women munitions workers, war widows and \nwar orphans. Finally, the author tells of making efforts to reunite \nparties long-ago separated by tragic events. Here, the matters described \nmove vividly into the present, giving the program a sense of real drama \nand pathos. Based on the 1999 Random hardcover.\n &lt;a href=&quot;\nhttp://bayimg.com/LAdaCaaDf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LAdaCaaDf&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:8c6922057e27c27457fd22ad1c16d5f70d729f55","amp;dn":"Tom+Brokaw+-+The+Greatest+Generation+Speaks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c6922057e27c27457fd22ad1c16d5f70d729f55","infoHashBuffer":{"type":"Buffer","data":[140,105,34,5,126,39,194,116,87,253,34,173,28,22,213,247,13,114,159,85]},"announce":[],"urlList":[]}}