{"title":"The Dark Age v1.0.1 ipod itouch www. iApp Torrent. blogspot. com","uid":6086684,"size":13438741,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:8c838aef9d8955dab56d34796e3eb46837f2aeb2&amp;dn=The+Dark+Age+v1.0.1+ipod+itouch+www.+iApp+Torrent.+blogspot.+com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Goon23","files":1,"time":1294358948,"description":"EW STYLE DUAL-STICK CONTROL: melee attack instead of only shooting\n\nIn the Middle Ages, there was a terrific, miserable and suffocating atmosphere pervading all over the European continent.\nThe pandemic of plague broke out all over the land. Feudalism and the setting up of separatist regime by force of arms lead to frequent battles which caused\nenormous death and disappearance. People were living in hopeless pain, and such a memorable period was named as &quot;the Dark Age&quot;.\nThe story began with the adventuring-loving hero had arrived a village called &quot;Moterloo&quot;.\nAccording to the villagers, the feudal lord lost him temper one day suddenly.\nThe tyranny resulted in riots of the villagers. However, they were suppressed by the lord's force very quickly.\nThe feudal lord forced all the strong men to mine gold in a cave since then. Soilders were ordered to guard strictly outside.\nNo one was allowed to enter or leave the cave throughout the 3 years. Also, there were continuous misterious disappearances of the remaining villagers.\nIn order to find out the truth and save the villagers, the Hero decided to get into the cave for investigation.\n\nCheck out www. iAppTorrent. blogspot. com","torrent":{"xt":"urn:btih:8c838aef9d8955dab56d34796e3eb46837f2aeb2","amp;dn":"The+Dark+Age+v1.0.1+ipod+itouch+www.+iApp+Torrent.+blogspot.+com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c838aef9d8955dab56d34796e3eb46837f2aeb2","infoHashBuffer":{"type":"Buffer","data":[140,131,138,239,157,137,85,218,181,109,52,121,110,62,180,104,55,242,174,178]},"announce":[],"urlList":[]}}