{"title":"Black Sabbath - Feels Good To Me (2nafish)","uid":6051251,"size":170557444,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8c96dc5203b5d61f7eaa4904562d827bcaaae5d3&amp;dn=Black+Sabbath+-+Feels+Good+To+Me+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1292741781,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nTYR is the fifteenth studio album by heavy metal band Black Sabbath, released in August 1990 by I.R.S. Records.\n\nThe album title and several song titles are taken from Norse Mythology which led many to call Tyr a concept album, although bassist Neil Murray dispelled that in 2005, stating that while many of the songs may seem loosely related, very little of the album has to do with mythology and it was not intended to be a concept recording.\n\nTyr is the son of Odin, the chief god in Norse mythology. He is the god of single combat and heroic glory, portrayed as a one-handed man. The usage of such analogies and mythology was a great departure from Headless Cross' descent into the Dark Side and the power of Satan. This is due to the direction of the lyrics by singer Tony Martin, who is an avid fan of history and joked that people &quot;could get history degrees by listening to Black Sabbath!&quot;\n\nThis album represents possibly the most dramatic departure from Black Sabbath's traditional sound, with only traces of it found in the occasional riff. The production has been criticized by some (who claim Cozy Powell's drums drown out most of the other instruments) and praised by others, who note that this is one of Sabbath's heaviest albums and perhaps the most prominently reliant on keyboards by the perennial 5th member, Geoff Nicholls. As a result, much of the music is a lot darker than previous Sabbath works, closely resembling the previous album Headless Cross in terms of darkness.\n\nThe band has stated that while they do not disown or regret the song &quot;Feels Good To Me,&quot; it was put on the album solely to be released as a single and doesn't fit in musically with the rest of the record.\n\nGeezer Butler, Ian Gillan and Brian May made guest appearances on the European leg of the Tyr tour; Butler and May appearing during the encore of the show performed on 8 September 1990 at the Hammersmith Odeon in London.\n\nThe runes on the cover are taken from the RÃƒÂ¶k Runestone in Sweden.\n\nThe only track to feature on post-TYR tours was &quot;Anno Mundi&quot;, e.g. on the &quot;Cross Purposes Live&quot; VHS/DVD.\n\nTony Martin re-recorded &quot;Jerusalem&quot; for his 1992 solo album Back Where I Belong.\n\nThe Black Sabbath lineup that recorded TYR would reunite to record their last studio album, Forbidden, in 1995.\n\nFrontman Heri Joensen of Viking metal band Tyr claims to have been influenced by the album cover when designing his own bands logo.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8c96dc5203b5d61f7eaa4904562d827bcaaae5d3","amp;dn":"Black+Sabbath+-+Feels+Good+To+Me+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c96dc5203b5d61f7eaa4904562d827bcaaae5d3","infoHashBuffer":{"type":"Buffer","data":[140,150,220,82,3,181,214,31,126,170,73,4,86,45,130,123,202,170,229,211]},"announce":[],"urlList":[]}}