{"title":"Amy Grant - Takes A Little Time (Xvid-2nafish)","uid":6004795,"size":76222700,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8cc6b7ba9c48c32a821678a117fa66d0042416fc&amp;dn=Amy+Grant+-+Takes+A+Little+Time+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1291287337,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:13\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2282 Kbps\nQuality Factor : 0.34 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Takes a Little Time&quot; was a maxi-single released in 1997 to promote Amy Grant's album Behind the Eyes, which was also released that year. &quot;Takes a Little Time&quot; included two songs from Behind the Eyes, as well as a new version of Amy's 1982 Christian radio hit, &quot;El Shaddai.&quot; The maxi-single was also an enhanced CD (ECD), meaning it had a video consumers could watch when they put it in their home computer. The ECD portion of the CD contained a live acoustic version of the song After the Fire, which Grant later released on her 2003 album Simple Things. Grant stated on Oprah that she had written the song for her mother.\n\nBehind the Eyes is the fifteenth album by Christian music and pop music singer Amy Grant, released in 1997.\n\nIssued near the end of Grant's marriage to Christian singer-songwriter Gary Chapman, many of the songs on Behind the Eyes reflect Grant's struggles in her marriage and all relate to a theme of optimism. Upon its release, it went to #2 on Billboard's Christian albums chart and #8 on the Billboard 200. Meanwhile, the first single from the album, &quot;Takes A Little Time,&quot; was a Top Five Adult Contemporary hit and a Top Thirty pop chart single. &quot;Like I Love You&quot; and &quot;I Will Be Your Friend&quot; also reached the Adult Contemporary chart, at #10 and #27, respectively. The CD was also released in a limited 2 CD version (with the second CD titled, More Music From Behind the Eyes).\n\nIn 2007, Behind the Eyes was reissued and digitally remastered by Grant's new record label, EMI/Sparrow Records, along with thirteen other Amy Grant albums. The remastered edition is labeled with a &quot;Digitally Remastered&quot; logo in the 'gutter' on the CD front. Because of Grant's deal with her previous label, Word Records, the remastered editions of Behind the Eyes and A Christmas to Remember will not be sold in Christian Music retailers such as Family Christian Stores or Lifeway Christian Resources until 2009. Until that time, Word Records will continue to distribute those titles to Christian retailers in the original, non-remastered editions while EMI will distribute the remastered editions to most major retailers. The twelve remaining remastered editions are distributed by EMI to all US retailers, both Christian and secular.\n\nThe album was listed at #44 in the 2001 book, CCM Presents: The 100 Greatest Albums in Christian Music.\nOn the opening track &quot;Nobody Home&quot;, Grant was supposed to sing &quot;boarded up or broken down&quot; in the first verse. She mistakenly sings &quot;broken up or broken down&quot; instead.\nBehind the Eyes was Grant's most successfully charting Album, reaching number 8 on the Billboard charts, compared with Heart In Motion, which reached number 10, and House of Love which reached number 13.\nBehind the Eyes is widely considered to be Grant's most mature album, lyrically and musically.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:8cc6b7ba9c48c32a821678a117fa66d0042416fc","amp;dn":"Amy+Grant+-+Takes+A+Little+Time+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cc6b7ba9c48c32a821678a117fa66d0042416fc","infoHashBuffer":{"type":"Buffer","data":[140,198,183,186,156,72,195,42,130,22,120,161,23,250,102,208,4,36,22,252]},"announce":[],"urlList":[]}}