{"title":"Natural.Porn.Killers.2010.XXX.DVDRip.XviD-JBM","uid":6106591,"size":733115326,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8cf4051f0e91f614ca6dbf97ff979fa0e60cded8&amp;dn=Natural.Porn.Killers.2010.XXX.DVDRip.XviD-JBM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":2,"time":1295188282,"description":"Screens:\n\n\n\n\n\nStarring \tVanessa Lee, Moxxie Maddron, Jason Andrews, Juan Largo, Amanda Logue, Dirk Styles\n\nA match made in hell.\n\nWhen Forbidden Gem hired a dozen adult performers to shoot together in a house in September of 2009, they expected sparks to fly. They were hoping for animal attraction, lust and debauchery. No one could have expected the tragic events that would unfold just months later over a thousand miles away.\n\nWhen Amanda Logue (AKA Sunny Dae) met fellow adult film performer Jason Andrews (AKA Addison), the chemistry was immediate and the attraction unmistakable. The two worked together for the first time and were inseparable from that point on. What seemed like a passionate porn love story would soon turn to tragedy for the lust-struck couple.\n\nIn the months that followed their meeting, Lougue and Andrews allegedly became a genuine X-Rated Bonnie and Clyde. Their wild ride would take them down the East Coast to Florida where they continued their two-person crime wave with charges ranging from shoplifting and theft to prostitution.\n\nThis tumultuous twosome would see their tornado of terror come to an end in Florida with the alleged murder of a tattoo shop owner.\n\nThis is the true story of two stars drawn together by lust, fueled by adrenaline and driven to violence.\n\nIt is unadulterated story of Sunny Dae and Addison available from Forbidden Gem.","torrent":{"xt":"urn:btih:8cf4051f0e91f614ca6dbf97ff979fa0e60cded8","amp;dn":"Natural.Porn.Killers.2010.XXX.DVDRip.XviD-JBM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cf4051f0e91f614ca6dbf97ff979fa0e60cded8","infoHashBuffer":{"type":"Buffer","data":[140,244,5,31,14,145,246,20,202,109,191,151,255,151,159,160,230,12,222,216]},"announce":[],"urlList":[]}}