{"title":"The Hand Behind the Mouse:The Ub Iwerks Story","uid":5968432,"size":816824264,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8e3281f72365b64520323c2c3edfa094d3c58196&amp;dn=The+Hand+Behind+the+Mouse%3AThe+Ub+Iwerks+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"darkmech","files":1,"time":1290193021,"description":"&quot;The Hand Behind the Mouse&quot; is the story of the man Walt Disney called &quot;the greatest animator in the world.&quot; There's not a person in the world who wouldn't recognize Mickey Mouse. But until now, not many knew the man who originally gave shape, movement and personality to the world's most beloved icon. &quot;The Hand Behind the Mouse: The Ub Iwerks Story&quot; takes you behind the scenes to meet Walt Disney's best friend and chief animator. Called a modern day &quot;Da Vinci,&quot; a technical genius who brought the unimaginable to the screen, Ub's triumphs reign among the greatest of success stories. This documentary traces the exciting and challenging path he led in shaping the film and animation industry into what it is today. Narrated by Kelsey Grammer and written, directed and produced Ub Iwerk's granddaughter Leslie Iwerks, &quot;The Hand Behind the Mouse: The Ub Iwerks Story&quot; includes never before seen archival footage, previously censored cartoon clips from the 1920's and '30s and interviews with Roy Disney, director John Lasseter (&quot;Toy Story,&quot; &quot;A Bug's Life&quot;), veteran Disney animators, actress Tippi Hedren (&quot;The Birds&quot;), film historian Leonard Maltin and more. Also includes two Ub Iwerks-animated Mickey Mouse cartoons, &quot;Plane Crazy,&quot; Mickey's first cartoon and &quot;Steamboat Willie,&quot; the first synchronized sound cartoon. This version is the unedited, full-length documentary (90 min. runtime). An edited, 44-minute version of this documentary aired on Bravo.","torrent":{"xt":"urn:btih:8e3281f72365b64520323c2c3edfa094d3c58196","amp;dn":"The+Hand+Behind+the+Mouse%3AThe+Ub+Iwerks+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e3281f72365b64520323c2c3edfa094d3c58196","infoHashBuffer":{"type":"Buffer","data":[142,50,129,247,35,101,182,69,32,50,60,44,62,223,160,148,211,197,129,150]},"announce":[],"urlList":[]}}