{"title":"MGI VideoWave III ( 3 ) - Dell Edition .ISO","uid":6026351,"size":180000768,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:904518e419a103676ce42ee58c6fbf6eaedfb980&amp;dn=MGI+VideoWave+III+%28+3+%29+-+Dell+Edition+.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"footron","files":-1,"time":1291941662,"description":"VideoWave 3 by MGI takes a unique approach to PC video. It provides a superior and uncomplicated way to edit and create videos from beginning to end. VideoWave 3 offers powerful editing features that allow you to create special effects, titles, transitions, audio tracks, and more. You can even mix two clips into one. And with a click of your mouse, the real-time preview feature lets you see what you've done right away. Use VideoWave 3 with your capture card to capture video from a video camcorder, television, VCR, or laserdisc player. Then, use VideoWave 3's full range of video-and-audio editing tools to edit the capture to your liking. You can view live video before and during the capture, and you can play back captured video and audio from your hard disk. Depending on the capabilities of your capture card, VideoWave 3 lets you output your video directly to your VCR for recording onto videotape. VideoWave 3 offers support in traditional analog video-capture hardware and the new, next-generation Digital Video camcorders with PC connection standards. With VideoWave 3, you are ready to move to new digital products as they become available, and you can now work with both analog and DV since VideoWave 3 enables their compatibility. This means you can work in and with both formats at the same time, using your existing VCR, camcorder, and traditional video-capture hardware.\n\n\nMount or burn the cd image; install; use...","torrent":{"xt":"urn:btih:904518e419a103676ce42ee58c6fbf6eaedfb980","amp;dn":"MGI+VideoWave+III+%28+3+%29+-+Dell+Edition+.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"904518e419a103676ce42ee58c6fbf6eaedfb980","infoHashBuffer":{"type":"Buffer","data":[144,69,24,228,25,161,3,103,108,228,46,229,140,111,191,110,174,223,185,128]},"announce":[],"urlList":[]}}