{"title":"Primus - Jerry Was A Race Car Driver (Live) (2nafish)","uid":6038138,"size":128538628,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:908e38b1c916a2e93f93fafb6aad869ecf50b9f8&amp;dn=Primus+-+Jerry+Was+A+Race+Car+Driver+%28Live%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292304926,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Jerry Was a Race Car Driver&quot; is the first single off Primus's 1991 album Sailing the Seas of Cheese. The song tells the stories of two characters, Jerry, an ill-fated race car driver who collides with a telephone pole while driving intoxicated (hence the &quot;was&quot;) and Captain Pierce, a retired fireman.\n\nThe song is featured in the music game Rock Band 3.\n\nDespite popular belief, &quot;Jerry Was a Race Car Driver&quot; was not the first ever Primus single. That credit goes to &quot;John the Fisherman&quot; from 1990's indie release Frizzle Fry. Because &quot;John the Fisherman&quot; was released on an indie record it had limited popularity, whereas &quot;Jerry Was a Race Car Driver&quot; was released on a major label, allowing for greater availability at record stores and more media exposure.\n\nThe music is built around Les Claypool's funky idiosyncratic finger-tapped bass line and silly story-telling style vocals, as well as eccentric guitar accompaniment from Larry LaLonde, including a guitar solo (which has been included in many of the Top 100 guitar solos lists on the internet and in magazines), and Tim Alexander's tight drumming. The chorus is followed by a metallic riff that mimics an engine revving. The result was a catchy song that helped Primus expand their fanbase. &quot;Jerry Was a Race Car Driver&quot; received heavy airplay on rock radio, and peaked at number 23 on the Modern Rock Tracks in 1991.\n\nThe song features a sample of Bill Moseley's character Chop Top from the film The Texas Chainsaw Massacre 2, chuckling to himself then remarking: &quot;Dog will hunt!&quot;\n\nThe phrase, &quot;El Sob #1&quot;, is a reference to El Sobrante, CA, Claypool's hometown.\n\nJerry is proud to display a Bocephus sticker on his Oldsmobile 442 racecar, pegging him as a man from the south and muscle-car aficionado.\n\nThe title of the song may be an allusion to the Robert A. Heinlein short-story, &quot;Jerry Was a Man&quot;.\n\n&quot;Jerry Was a Race Car Driver&quot; appeared in the first Tony Hawk's Pro Skater video game.\n\nSailing the Seas of Cheese is the second studio album and major-label debut by Primus, released on May 14, 1991. It spawned three singles: &quot;Jerry Was a Race Car Driver&quot;, &quot;Tommy the Cat&quot;, and &quot;Those Damned Blue-Collar Tweekers&quot;. &quot;Jerry Was a Race Car Driver&quot; appeared in Tony Hawk's Pro Skater video game, while &quot;American Life&quot; appears in Tony Hawk's Project 8.\n\nThe album contains several samples from other media:\n\n    * &quot;Jerry Was a Race Car Driver&quot; contains a sample from the movie The Texas Chainsaw Massacre 2 in which the character Chop Top exclaims &quot;Dog will hunt!&quot;\n    * &quot;Los Bastardos&quot; contains samples from the BBC television series The Young Ones including Vyvyan shouting, &quot;Shut up, you bastards!&quot; as well as Rick saying, &quot;You just called me a bastard, didn't you?&quot; and &quot;Mike, you bastard!&quot;\n\nSailing the Seas of Cheese reached Gold status March 1993. It was certified platinum in December 2001.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:908e38b1c916a2e93f93fafb6aad869ecf50b9f8","amp;dn":"Primus+-+Jerry+Was+A+Race+Car+Driver+%28Live%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"908e38b1c916a2e93f93fafb6aad869ecf50b9f8","infoHashBuffer":{"type":"Buffer","data":[144,142,56,177,201,22,162,233,63,147,250,251,106,173,134,158,207,80,185,248]},"announce":[],"urlList":[]}}