{"title":"Pirates of the Caribbean At World's End (Multi Subs)(2Lions-Tea","uid":5942339,"size":4511139298,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:90b348c8a2223e2ee23564041c1166dbd6e3e8b0&amp;dn=Pirates+of+the+Caribbean+At+World%5C%27s+End+%28Multi+Subs%29%282Lions-Tea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"juutje","files":-1,"time":1289174900,"description":"Pirates of the Caribbean: At World's End 2007\n\nVerenigde Staten\nActie / Avontuur\n168 minuten\n\ngeregisseerd door Gore Verbinski\nmet Johnny Depp, Orlando Bloom en Keira Knightley\n\nIn deze donkere tijden waarin piraten harteloos worden vermoord en piratenschepen genadeloos worden vernietigd, besluiten Kapitein Barbossa, Will Turner, Elizabeth Swann en de crew van de Black Pearl om naar het einde van de wereld te reizen om Kapitein Jack Sparrow te zoeken. Om daar te komen moeten ze eerst langs piraat Kapitein Sao Feng in het gevaarlijke, maar exotische Singapore, om zijn schip en de belangrijke landkaart te bemachtigen, dat hen naar het einde van de wereld zal brengen. Als Jack gevonden wordt, lijkt zijn gevangenschap hem nog gekker gemaakt te hebben. Toch stemt hij in om te helpen en vaart met succes The Black Pearl uit het Land van de Doden. Maar eenmaal onderweg stapelt het verraad zich op en wordt het duidelijk dat Jack, Will, Elizabeth, Sao Feng en Barbossa allemaal hun eigen plannen hebben en dat niemand te vertrouwen is. Toch moet iedere partij kiezen en een definitieve alliantie vormen voor ÃƒÂ©ÃƒÂ©n laatste slag. Zou dit het einde betekenen van de vrijheid op de zeven zeeÃƒÂ«n voor de piraten?\n\n\nEngels\n\nAfter Elizabeth, Will, and Captain Barbossa rescue Captain Jack Sparrow from the the land of the dead, they must face their foes, Davy Jones and Lord Cutler Beckett. Beckett, now with control of Jones' heart, forms a dark alliance with him in order to rule the seas and wipe out the last of the Pirates. Now, Jack, Barbossa, Will, Elizabeth, Tia Dalma, and crew must call the Pirate Lords from the four corners of the globe, including the infamous Sao Feng, to gathering. The Pirate Lords want to release the goddess Calypso, Davy Jones's damned lover, from the trap they sent her to out of fear, in which the Pirate Lords must combine the 9 pieces that bound her by ritual to undo it and release her in hopes that she will help them fight. With this, all pirates will stand together and will make their final stand for freedom against Beckett, Jones, Norrington, the Flying Dutchman, and the entire East India Trading Company.\n\nWeblink http://www.imdb.com/title/tt0449088/\nWeblink http://www.moviemeter.nl/film/38169\n\nVideo           : Retail DVD 5\nAudio           : AC 3 5.1 English AC 3  2 Hindi\nSubs            : English Hindi Swedish Norwegian Danish Finnish Iselandic Dutch\nID              : 224 (0xE0)\nFormaat         : MPEG Video\nFormaatversie   : Version 2\nBitrate-modus   : Variabel\nBreedte         : 720 pixels\nHoogte          : 576 pixels\nBeeldverhouding : 16:9\nFramerate       : 25,000 fps\nStandaard       : PAL\nCover+label     : Yes\n\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\nEnjoy\n2Lions-Team\n\n                        \nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n\n\n\n","torrent":{"xt":"urn:btih:90b348c8a2223e2ee23564041c1166dbd6e3e8b0","amp;dn":"Pirates+of+the+Caribbean+At+World%5C%27s+End+%28Multi+Subs%29%282Lions-Tea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90b348c8a2223e2ee23564041c1166dbd6e3e8b0","infoHashBuffer":{"type":"Buffer","data":[144,179,72,200,162,34,62,46,226,53,100,4,28,17,102,219,214,227,232,176]},"announce":[],"urlList":[]}}