{"title":"MX vs ATV Reflex [PC-DVD][Multi5][Spanish][www.consolasatope.com","uid":5991836,"size":6874685876,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:90c4ab8838848ecea1e6c78e34ef267bf8561a8d&amp;dn=MX+vs+ATV+Reflex+%5BPC-DVD%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"consolasatope","files":71,"time":1290910626,"description":"MX vs. ATV Reflex no es el primer juego que tiene en cuenta la fÃƒÂ­sica de los pilotos, aunque sÃƒÂ­ el primero en el que debes controlarlo por separado con un stick porque su peso marca la lÃƒÂ­nea que separa una curva tomada a la perfecciÃƒÂ³n o una salida de la pista.\n\nCon el stick izquierdo manejas el vehÃƒÂ­culo mientras que con el derecho te ocupas de mover al conductor para cambiar el centro de gravedad. La sensaciÃƒÂ³n de control que obtienes es mucho mayor, y con un poco de prÃƒÂ¡ctica aprendes a combinar el control del vehÃƒÂ­cuo con el movimiento del conductor, de forma que se equilibren las fuerzas centrÃƒÂ­fuga y centrÃƒÂ­peta y tu moto o quad se mantenga en la pista pese a tomar la curva a gran velocidad. Es un concepto al que te acostumbras a los pocos segundos de haber agarrado el mando pero que te llevarÃƒÂ¡ un poco de tiempo dominar.\n\nAsÃƒÂ­, si te das cuenta de que has cogido la curva muy abierta puedes mantener la direcciÃƒÂ³n del vehÃƒÂ­culo o rectificarla sÃƒÂ³lo ligeramente y desplazar por el interior al corredor para compensar, como sucede en las carreras reales. Reflex tampoco pretender con este sistema lograr una simulaciÃƒÂ³n alta. MÃƒÂ¡s bien apuestan por instaurar un nuevo concepto. Ian Wood, director de arte del juego, apunta en este sentido: &quot;en el tÃƒÂ­tulo anterior era como ver la carrera en la televisiÃƒÂ³n, y ahora hemos intentado mejorar la inmersiÃƒÂ³n, hacerte sentir al personaje y que estÃƒÂ¡s en el juego&quot;. No creerÃƒÂ¡s que estÃƒÂ¡s sobre un quad pero sÃƒÂ­ tendrÃƒÂ¡s que ocuparte de todos los elementos como si lo estuvieras.\n\nCuando veas que tu vehÃƒÂ­culo empieza a dar bandazos o intuyas que lo siguiente que vas a ver es una caÃƒÂ­da, no pierdas la esperanza. Para ayudarte en estas situaciones lÃƒÂ­mite Rainbow ha ideado la ayuda Recovery. Cuando todo parece perdido, aparecerÃƒÂ¡ una gran flecha en un lateral de la pantalla. Si giras rÃƒÂ¡pidamente el stick derecho en la direcciÃƒÂ³n que indica la flecha lograrÃƒÂ¡s superar el tropezÃƒÂ³n y te mantendrÃƒÂ¡s sobre tu vehÃƒÂ­culo.\n\n","torrent":{"xt":"urn:btih:90c4ab8838848ecea1e6c78e34ef267bf8561a8d","amp;dn":"MX+vs+ATV+Reflex+%5BPC-DVD%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90c4ab8838848ecea1e6c78e34ef267bf8561a8d","infoHashBuffer":{"type":"Buffer","data":[144,196,171,136,56,132,142,206,161,230,199,142,52,239,38,123,248,86,26,141]},"announce":[],"urlList":[]}}