{"title":"Georgia Satellites Open All Night(rock)(flac)[rogercc]","uid":6211899,"size":293053957,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:92326ab11e317f9205f82e3b90db8243f110280a&amp;dn=Georgia+Satellites+Open+All+Night%28rock%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rogercc1","files":11,"time":1299014406,"description":"GEORGIA SATELLITES  OPEN ALL NIGHT\nLabel: Elektra\nReleased: 1988\nFormat: Flac\n\nOpen All Night had the unwieldy pressure of being the follow-up album to a surprise hit. The Georgia Satellites\\' self-titled offering, issued in 1986, yielded the smash single \\&quot;Keep Your Hands to Yourself,\\&quot; which was also an MTV staple for six months. The track and its accompanying video were viewed as novelties by radio and MTV, so when Open All Night appeared, the \\&quot;joke\\&quot; was over. Too bad. If ever a band was miscast as class clown, it was these guys. Songwriter and frontman Dan Baird wrote another slew of tough rootsy rockers that evoked everyone from Chuck Berry to AC/DC. Boogie, biker bluesy rock, Faces-style garagey rawness, and the swagger of the Rolling Stones along with the overdriven razored guitar of Rick Richards powered Baird\\'s songs. And the man could write a hook, as evidenced by \\&quot;Sheila,\\&quot; which sounds like a punk Del Shannon backed by .38 Special at their best. The cover of \\&quot;Whole Lotta Shakin\\' Goin\\' On\\&quot; takes the Jerry Lee Lewis arrangement and rips it wide open with a honky tonk piano shoved into the \\'80s by stomping guitars. Likewise, the Satellites\\' cover of Ringo Starr\\'s \\&quot;Don\\'t Pass Me By\\&quot; makes it a bona fide Saturday night barroom country-rock number. Once again, though, it\\'s Baird\\'s own material that separates them from their peers -- not that there were many in the mid-\\'80s. \\&quot;Mon Cheri\\&quot; feels like a remake of \\&quot;Keep Your Hands to Yourself,\\&quot; but its storyline is amusing and the guitar crunch is irresistible. \\&quot;Down Down\\&quot; is a balls-out rocker with open ringing riffs like \\&quot;Highway to Hell.\\&quot; The set closes with a fine Rick Richards tune called \\&quot;Hand to Mouth.\\&quot; It\\'s true that he\\'s not much of a singer, but he can write a power ballad and he loves Ron Wood and Ronnie Lane. If this recording had been issued in another era, it would have been truly appreciated for what it was: a solid and punchy, loud and proud rock &amp; roll album. ~ Thom Jurek\n\nTracklist:\n01 - Open All Night (02:49)\n02 - Sheila (03:41)\n03 - Whole Lotta Shakin\\' (02:32)\n04 - Cool Inside (02:58 )\n05 - Don\\'t Pass Me By (04:50)\n06 - My Baby (04:07)\n07 - Mon Cheri (04:39)\n08 - Down And Down (03:49)\n09 - Dunk \\'N\\' Dine (02:31)\n10 - Baby So Fine (03:48 )\n11 - Hand To Mouth (04:51)\n\nRecording information: Musiplex, Atlanta, GA; Studio D, Austin, TX.\n\n\nPersonnel: Dan Baird, Rick Richards (vocals, guitar); Rick Price (vocals); Ian McLagan (piano); Mauro Magellan (drums).\n","torrent":{"xt":"urn:btih:92326ab11e317f9205f82e3b90db8243f110280a","amp;dn":"Georgia+Satellites+Open+All+Night%28rock%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92326ab11e317f9205f82e3b90db8243f110280a","infoHashBuffer":{"type":"Buffer","data":[146,50,106,177,30,49,127,146,5,248,46,59,144,219,130,67,241,16,40,10]},"announce":[],"urlList":[]}}