{"title":"Huey Lewis And The News - Doing It All For My Baby (2nafish)","uid":6055964,"size":283551748,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9321fe8393c04ce2c3b8bb7a390b55e4a84410a6&amp;dn=Huey+Lewis+And+The+News+-+Doing+It+All+For+My+Baby+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1292914192,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Doing It All for My Baby&quot; is a song performed by Huey Lewis and the News, released as a single from the album Fore! in 1987. The single peaked at number six on the U.S. Billboard Hot 100 in September 1987, becoming the fifth top-ten hit from the album and making the band the first group to have five top-ten Hot 100 singles from one album.\n\nThe music video for &quot;Doing It All for My Baby&quot; was a parody of monster movies and was over 7 minutes in length.\n\nThe song was written by Mike Duke and Phil Cody. Duke had previously written the song, &quot;Hope You Love Me Like You Say You Do&quot;, the News' second top 40 hit from the 1982 album, Picture This, and went on to write, &quot;Let Her Go and Start Over,&quot; a minor adult contemporary hit for the band, from the album, Plan B, in 2001.\n\nFore! is the fourth album by American rock band Huey Lewis and the News, released in 1986. The album hit number one on the Billboard 200 album chart and contained five top-ten Billboard Hot 100 singles, including the number-one hits: &quot;Stuck with You&quot; and &quot;Jacob's Ladder.&quot;\n\nThe wall that Lewis and the members of the band stand against on the album's cover is a wall from Tamalpais High School in Mill Valley, California. Band members Huey Lewis, Bill Gibson, Sean Hopper and Mario Cipollina went to this school together.\n\nThe album cover for Fore! is seen in the movie, American Psycho, starring Christian Bale. Bale's character, Patrick Bateman, goes on to have a nearly one minute discussion regarding the band and how &quot;Hip to Be Square&quot; was a follow up to the mainstream hit &quot;The Power of Love.&quot; He incorrectly states that the album came out in 1987 when, in actuality, it came out in September 1986.\n\nHuey Lewis and the News are an American rock band based in San Francisco, California. They had a run of hit singles during the 1980s and early 1990s, eventually scoring a total of 19 top-ten singles across the Billboard Hot 100, Adult Contemporary and Mainstream Rock charts. Their greatest success was in the 1980s with the number-one album, Sports, coupled with a series of highly successful MTV videos. Their worldwide fame expanded when the song &quot;The Power of Love&quot; was featured as a key track in the film Back to the Future, became a number-one hit, and nominated for an Academy Award. The News combined a rock (and sometimes, a &quot;blues rock&quot;) backing with soul and doo-wop-influenced harmony vocals and Lewis's voice.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9321fe8393c04ce2c3b8bb7a390b55e4a84410a6","amp;dn":"Huey+Lewis+And+The+News+-+Doing+It+All+For+My+Baby+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9321fe8393c04ce2c3b8bb7a390b55e4a84410a6","infoHashBuffer":{"type":"Buffer","data":[147,33,254,131,147,192,76,226,195,184,187,122,57,11,85,228,168,68,16,166]},"announce":[],"urlList":[]}}