{"title":"Bucky Covington - A Different World (2nafish)","uid":5957845,"size":135002116,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:96b44765e94ae53c5ff816706fd3907f9e49d976&amp;dn=Bucky+Covington+-+A+Different+World+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1289805442,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;A Different World&quot; is the first single by American country musician, Bucky Covington, from his first album Bucky Covington. He performed it at Great American Country in December 2006, and the song was released for country radio on January 16, 2007. The song is produced by Mark Miller, and was released by Lyric Street Records, a country label of Disney's Buena Vista Music Group.\n\nA music video was released in February 2007, and was directed by Trey Fanjoy. It begins with Covington as a child (J.D. Ironfield), sitting in front of an old television. On the T.V. is the adult version of Covington, who is on the patio of a house. Throughout the video, the young Covington watches his older counterpart on the TV as the adult version of him walks around a small town, supposedly like the town he grew up in. Certain children in the town are shown leading a simpler life than most do today, as the song's lyrics describe. The video ends with the adult Covington entering the house where the young version of him is watching. It then shows him as an adult shutting off a modern day television.\n\nThe video reached #1 on CMT's Top Twenty Countdown for the week of May 31, 2007.\n\nBucky Covington is the self-titled debut album of American country music artist Bucky Covington. It was released by Lyric Street Records, the country division of Hollywood Records, on April 17, 2007. The lead-off single, &quot;A Different World&quot;, reached the Top 10 on the Billboard Hot Country Songs chart, with a peak of #6. &quot;It's Good to Be Us&quot;, the album's second single, reached #11. A third single, &quot;I'll Walk&quot;, also reached the Top 10 with a peak of #10. The song &quot;Empty Handed&quot; is featured on Nascar 08.\n\nWilliam Joel &quot;Bucky&quot; Covington III (born November 8, 1977) is an American country music singer. He placed eighth on the 5th season of the Fox Network's talent competition series American Idol. In December 2006, he signed a recording contract with Lyric Street Records. His self-titled debut album, produced by Mark Miller of the band Sawyer Brown, was released on April 17, 2007. The album debuted at #1 on the Billboard Top Country Albums chart, and produced three hit singles on the Hot Country Songs charts: &quot;A Different World&quot; at #6, &quot;It's Good to Be Us&quot; at #11, and &quot;I'll Walk&quot; at #10. A second album, slated for release on September 28, 2010, has produced three more singles: &quot;I Want My Life Back,&quot; &quot;Gotta Be Somebody&quot; and &quot;A Father's Love (The Only Way He Knew How).&quot;\n\nIn the 2005-06 season, the Covington twins auditioned for American Idol in Greensboro, NC individually. Of the two, Bucky advanced to the final twelve. On March 22, Bucky remained in the bottom three, along with Lisa Tucker and Kevin Covais. On April 12, when Covington was in the bottom three with Ace Young and Elliott Yamin, the votes went to the latter two.\n\nIn the Top 8 results show of season six of American Idol, he appeared in one of the front rows. Since being on Idol he has had his teeth capped.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:96b44765e94ae53c5ff816706fd3907f9e49d976","amp;dn":"Bucky+Covington+-+A+Different+World+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96b44765e94ae53c5ff816706fd3907f9e49d976","infoHashBuffer":{"type":"Buffer","data":[150,180,71,101,233,74,229,60,95,248,22,112,111,211,144,127,158,73,217,118]},"announce":[],"urlList":[]}}