{"title":"Democracy Now - 07 jan 2011","uid":6087989,"size":456779988,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:98713f1ce97683dc89767e090822c8ab26f769fd&amp;dn=Democracy+Now+-+07+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1294418502,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 07, 2011\n\n- CBO: Repeal of Health Law Would Increase Deficit by $230 Billion\n- House GOP Kill Global Warming Committee\n- Puerto Rico and D.C. Lose House Voting Rights\n- Bill Introduced to Rewrite 14th Amendment\n- Boehner Pushes $100B in Cuts, Can't Name Any Programs to End\n- Pentagon Budget Continues to Grow Despite Budget Cuts\n- WikiLeaks: Israeli Corruption at Gaza Crossing Exposed\n- Israeli Troops Kill 65-Year-Old Man in Home Raid\n- Ex-Mossad Chief: Iran Nuclear Program Set Back Many Years\n- U.S. Urged to Not Resume Deportations to Haiti\n- California Health Insurance Company Hikes Rates 59%\n\n\nSpecial reports\n\n- From Wall Street to the White House: Obama Taps JPMorgan Exec William Daley for Chief of Staff\n\nPresident Obama appointed William Daley, a top financial executive and former Clinton administration official, as his new White House chief of staff. Daley is the Midwest chair of JPMorgan Chase, a board member of Merck, and former head of SBC. Obama will also reportedly name former Goldman Sachs consultant Gene Sperling to head the National Economic Council. We speak with Ari Berman of The Nation magazine.\n\n\n- Legendary Muckraking Reporter Wayne Barrett Laid Off from Village Voice\n\nThe Village Voice alternative news weekly in New York City lost two legendary muckraking reporters this week: Wayne Barrett was laid off, and Tom Robbins quit soon after in solidarity. Barrett worked at the Voice for nearly four decades. He exposed corruption and broke stories on New York's elected officials, from Ed Koch to Al D'Amato to Rudy Giuliani. Barrett joins us in our studio. &quot;It makes you live and breathe, a good story,&quot; Barrett says. &quot;I hope to write a few more, but I've loved writing the ones I've written so far.&quot;\n\n\n- As Activists Plan Protest for 9th Anniv. of GuantÃƒÂ¡namo, Former Gitmo Commander Subpoenaed in Spain over Prisoner Torture\n\nProtests are planned at the White House next week to mark the ninth anniversary of the first transfer of foreign prisoners to the U.S. military prison at GuantÃƒÂ¡namo Bay, Cuba. Meanwhile, the Center for Constitutional Rights filed a request Thursday asking a Spanish court to subpoena the former commanding officer at GuantÃƒÂ¡namo Bay, Major General Geoffrey Miller, over the alleged torture of four GuantÃƒÂ¡namo prisoners. Last month, the CCR also asked another Spanish judge to prosecute six former Bush administration officials who authored the legal memos authorizing the torture of foreign prisoners.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:98713f1ce97683dc89767e090822c8ab26f769fd","amp;dn":"Democracy+Now+-+07+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98713f1ce97683dc89767e090822c8ab26f769fd","infoHashBuffer":{"type":"Buffer","data":[152,113,63,28,233,118,131,220,137,118,126,9,8,34,200,171,38,247,105,253]},"announce":[],"urlList":[]}}