{"title":"A Nice Class of Corpse - Simon Brett  (Unabridged)","uid":6029174,"size":72686248,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:990efd792dcfb63513ad287764594c5c0a20eece&amp;dn=A+Nice+Class+of+Corpse+-+Simon+Brett++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lucy1948","files":14,"time":1292013617,"description":"Unabridged and read by Simon Brett. 5 hours 2 mins duration.(Fhg CBR 32 kbit/s 22050 Hz Mono)\n\n\n\nMrs Melita Partridge,a regular series creation of Mr Brett, has been called a kind of anti-Miss Marple and I can see what is being hinted at for while cast in the same fictional mould of of elderly lady snoop she is some way away from being the cosy old grandmother type who inhabit the closed world of British crime novels with a genteel setting. For one thing her late husband was a burglar and she has retained contacts with the criminal elements albeit not the more thuggish elements. Events are centred around the Devereux Hotel in Littlehampton(a town whose name is guaranted to evoke scholboyish sniggers from any Englishman given the smutty overtones it conveys) It is a residential hotel with nought but permanent residents.Residents begin dying,ostensibly accidently but we as readers are made privy to the thoughts of the murderer,for indeed the crimes are murder.The body count begins to mount while Mrs P pursues her investigations with a little help from her criminal friends. The residents are nicely differentiated one from the other -the haughty aristocrat fallen on hard times,the fading actress,the conventional military man and his dim friend etc. The title is deeply significant for the book has the subtext of class.The hotel proprietor is obsessed by it as are some of the residents. An enjoyable light read.","torrent":{"xt":"urn:btih:990efd792dcfb63513ad287764594c5c0a20eece","amp;dn":"A+Nice+Class+of+Corpse+-+Simon+Brett++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"990efd792dcfb63513ad287764594c5c0a20eece","infoHashBuffer":{"type":"Buffer","data":[153,14,253,121,45,207,182,53,19,173,40,119,100,89,76,92,10,32,238,206]},"announce":[],"urlList":[]}}