{"title":"Glee - S01E06 - Vitamin D [Np]","uid":5938826,"size":366696420,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9984a769b7d8a5c577769839890653060707ea49&amp;dn=Glee+-+S01E06+-+Vitamin+D+%5BNp%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoahPuckerman","files":1,"time":1289063480,"description":"Name: Glee\nSeason: 1\nEpisode: 6\nEpisode Name: Vitamin D\nOriginal Air Date on TV: October 7, 2009\n\n\nEpisode Plot\n(Via: Wikipedia)\n\nBelieving the glee club are becoming complacent ahead of the forthcoming sectionals round of competition, director Will Schuester divides the club into boys against girls for a mash-up competition. Cheerleading coach Sue Sylvester observes that head cheerleader Quinn Fabray's (Dianna Agron) performance standards are slipping. When Quinn blames her tiredness on her glee club participation, Sue renews her resolve to destroy the club, planning to sabotage Will's personal life. Sue tells Will's wife Terri that guidance counselor Emma Pillsbury has romantic feelings for Will. Determined to stay close to her husband, Terri takes a job as the school nurse, despite having no medical qualifications. She encourages Emma's boyfriend Ken Tanaka (Patrick Gallagher) to propose to her, which he does. After asking Will if there is any reason she should not marry Ken, and being warned off Will by Terri, Emma accepts his proposal. Terri is still hiding the fact she experienced a hysterical pregnancy from Will, and upon realizing how much her life is changing due to her pregnancy, Quinn agrees to let Terri secretly adopt her baby.\n\nClub member Finn Hudson (Cory Monteith) is exhausted by his extra-curricular activities, so Terri gives him pseudoephedrine tablets, which Finn shares with the rest of the males in the glee club. The effects of the tablets enhance their performance, and they give an energetic mash-up of &quot;It's My Life and &quot;Confessions Part II&quot;. When Kurt (Chris Colfer) tells the girls the secret behind the boys' performance, they, too, request the tablets from Terri, and give a high-spirited mash-up of &quot;Halo&quot; and &quot;Walking On Sunshine&quot;. Finn and Rachel (Lea Michele) feel guilty for cheating, however, and agree to nullify the competition. When Principal Figgins (Iqbal Theba) learns what has happened, he fires Terri and, angry with Will, appoints Sue as co-director of the glee club.\n\nI Will Be Uploading All Glee Episodes As Single Files Then All Together (:\nI Will Also Be Uploading All Albums To Each Season (:\n\nEnjoy (: &amp; Please Seed \n\nThanks\n\n- [Np]\n","torrent":{"xt":"urn:btih:9984a769b7d8a5c577769839890653060707ea49","amp;dn":"Glee+-+S01E06+-+Vitamin+D+%5BNp%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9984a769b7d8a5c577769839890653060707ea49","infoHashBuffer":{"type":"Buffer","data":[153,132,167,105,183,216,165,197,119,118,152,57,137,6,83,6,7,7,234,73]},"announce":[],"urlList":[]}}