{"title":"Ciderhus reglene.DVDrip.AC3-5.1.Norsk tekst.Rippet av Robban","uid":6035110,"size":1586213987,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99d9f1984115548f4ebea2686b785bb8d7517c76&amp;dn=Ciderhus+reglene.DVDrip.AC3-5.1.Norsk+tekst.Rippet+av+Robban&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"P&lt;","files":-1,"time":1292204417,"description":"En av mine favorittfilmer, om man tar en liten actionpause;-)\n\nSeed, ogsÃƒÂ¥ dere som ikke er sÃƒÂ¥ flinke, dere hjelper til med utvalget her;-)\n\n\n\nRobbanPobban\n\n\n\nCiderhus reglene\n\nHomer Wells grows up in an orphanage where he spends his childhood &quot;being of use&quot; as a medical assistant to the director, Dr. Wilbur Larch, whose history is told in flashbacks: After a traumatic misadventure with a prostitute as a young man, Wilbur turns his back on sex and love, choosing instead to help women with unwanted pregnancies give birth and then keeping the babies in an orphanage. He makes a point of maintaining an emotional distance from the orphans, so that they can more easily make the transition into an adoptive family, but when it becomes clear that Homer is going to spend his entire childhood at the orphanage, Wilbur trains the orphan as an obstetrician and then comes to love him.\nWilbur's and Homer's lives are complicated by Wilbur also secretly being an abortionist. Wilbur came to this work reluctantly, but he is driven by having seen the horrors of back-alley operations. Homer, upon learning Wilber's secret, considers it morally wrong.\nHomer befriends a young couple, Candy Kendall and Wally Worthington, who work in an apple orchard, and leaves the orphanage with them. Wally and Homer become best friends and Homer develops a secret love for Candy. Wally goes off to war and his plane is shot down over Burma. He is presumed missing by the military, but Homer and Candy both believe he is dead and move on with their lives. They have sexual relations, and Candy becomes pregnant. They go back to St. Cloud's Orphanage, where their child is born and named Angel. Candy becomes the first mother to take her own child home with her.\nSubsequently, Wally is found in Burma and returns home, paralyzed from the waist down. He is still able to have sexual intercourse but is sterile due to an infection received in Burma. They lie to the family about Angel's parentage, claiming that Homer decided to adopt him. Wally and Candy marry shortly afterward, but Candy and Homer maintain a secret affair that lasts some fifteen years.\nMany years later, teenaged Angel falls in love with Rose Rose, the daughter of the head migrant worker at the apple orchard. She becomes pregnant with her father's child, and Homer performs an abortion on her. Homer decides to return to the orphanage after the death of Dr. Larch, to work as the new director. Though he maintains his distaste for abortions, he continues Dr. Larch's legacy of honoring the choice of his patients, and he dreams of the day when abortions are free, legal, and safe, so he'll no longer feel obligated to offer them.\nA subplot follows the character Melony, who grew up alongside Homer in the orphanage. She was Homer's first girlfriend in a relationship of circumstances. After Homer leaves the orphanage, so does she in an effort to find him. She eventually becomes an electrician and takes a female lover, Lorna. Melony is an extremely stoic woman, who refuses to press charges against a man who brutally broke her nose and arm so that she can later retaliate herself. She is the catalyst that transforms Homer from his comfortable but not entirely admirable position at the apple orchard to becoming Dr. Larch's replacement at the orphanage.\n\n\nAllmÃƒÂ¤nt\n FullstÃƒÂ¤ndigt namn               : D:\\Downloads\\Seeding\\Ciderhus reglene.DVDrip.AC3-5.1.Norsk tekst.Rippet av Robban\\Ciderhus reglene.DVDrip.AC3-5.1.Norsk tekst.Rippet av Robban.avi\n Format                          : AVI\n Format/                         : Audio Video Interleave\nFormat_Profile                   : OpenDML\n Filstorlek                      : 1,47 GiB\nDuration/String                  : 2 h 0 min\n Generell Bitrate                : 1 752 Kbps\n Skrivande applikation           : Lavf52.78.4\n\n Video\n ID                              : 0\n Format                          : MPEG-4 Visual\nFormat_Profile                   : Advanced Simple@L5\nFormat_Settings_BVOP/String      :  Ja\nFormat_Settings_QPel/String      :  Nej\nFormat_Settings_GMC/String       : 0 warppoint\nFormat_Settings_Matrix/String    : Default (H.263)\nCodecID                          : XVID\n/                                : XviD\nDuration/String                  : 2 h 0 min\n Bitrate                         : 1 292 Kbps\n Bredd                           : 720 pixlar\n HÃƒÂ¶jd                            : 304 pixlar\n BildfÃƒÂ¶rhÃƒÂ¥llande                 : 2,35:1\n Bildhastighet (Frame rate)      : 25,000 fps\nColorSpace                       : YUV\nChromaSubsampling                : 4:2:0\nBitDepth/String                  : 8 bits\n Bits/(Pixel*Frame)              : 0.236\nStreamSize/String                : 1,09 GiB (74%)\n Skrivande bibliotek             : XviD 1.2.1 (UTC 2008-12-04)\n\n Audio\n ID                              : 1\n Format                          : AC-3\n Format/                         : Audio Coding 3\nFormat_Settings_ModeExtension    : CM (complete main)\nCodecID                          : 2000\nDuration/String                  : 39 min\n Bitrate                         : 448 Kbps\n Kanal(er)                       : 6 kanaler\n Kanalplatser                    : Front: L C R, Side: L R, LFE\n Samplingstakt                   : 48,0 KHz\nBitDepth/String                  : 16 bits\nStreamSize/String                : 125 MiB (8%)\nInterleave_Duration/String       : 99  ms (2.47 video frames)\nInterleave_Preload/String        : 32 ms\n\n\n","torrent":{"xt":"urn:btih:99d9f1984115548f4ebea2686b785bb8d7517c76","amp;dn":"Ciderhus+reglene.DVDrip.AC3-5.1.Norsk+tekst.Rippet+av+Robban","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99d9f1984115548f4ebea2686b785bb8d7517c76","infoHashBuffer":{"type":"Buffer","data":[153,217,241,152,65,21,84,143,78,190,162,104,107,120,91,184,215,81,124,118]},"announce":[],"urlList":[]}}