{"title":"Xilisoft HD Video Converter 6.0.14.1104+crk","uid":5939183,"size":42957361,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9a3da3904bac7a95f00bfa3425011ebebc94b2df&amp;dn=Xilisoft+HD+Video+Converter+6.0.14.1104%2Bcrk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Slickinator","files":2,"time":1289076585,"description":"Xilisoft HD Video Converter\n &lt;a href=&quot;\nhttp://i71.photobucket.com/albums/i122/Slickinator2006/hd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i71.photobucket.com/albums/i122/Slickinator2006/hd.jpg&lt;/a&gt;\n\nHigh HD video converting speed and rich formats top\nExcellent quality, abundant formats and fast HD video conversion\nHD converter\n\n    * Support multi-core CPU\n      With auto detection of multi-core CPU, Xilisoft HD Video Converter will distribute tasks on multi-core automatically to get high video conversion speed.\n    * The widest range of formats support\n      Support HD videos like AVCHD (mts, m2ts), MKV, HD ASF, HD AVI, H.264/AVC, HD Quick Time, HD MPEG-4, and HD WMV, and general videos and audios like AVI, MPEG, WMV, MP4, 3GP, FLV, RM, MOV, MP3, WMA and AAC.\n\nAVI to HD converter\nConversion between picture and video top\nShare your treasure photo and video with friends and family\nHigh definition Video Convert\n\n    * Picture collection\n      Xilisoft HD Video Converter can easily convert batches of pictures like JPG, GIF, BMP and PNG to videos and play like a slide without more clicks and you can set the time that the frame delays.\n    * Video-to-picture conversion\n      To get wonderful Hollywood movie scenes, the HD converter can capture pictures from videos by setting duration and capture interval, and save them as JPG, GIF, BMP, PNG files.\n\nConvert HD video\nFlexible settings to simplify your HD video conversion top\nMore specific and professional parameters for settings\nHD convert\n\n    * Legible format system\n      All formats have been classified by device for quick search and the HD converter assembles HD video formats in a group for you to choose conveniently.\n    * Custom parameters of profile\n      Diverse parameters for video, audio and picture profiles are classied for easy navigation and can be easily and freely customized for both novices and advanced users. You can save the profile whose parameters have been customized for future use.\n    * Several formats for one file\n      With Xilisoft HD Video Converter, you can add many profiles in multiple formats to one source for simultaneous output. It's fast and convenient to get kinds of profiles at one time.\n    * Adjustable file size\n      Xilisoft HD Video Converter supports converting video with any file size you need by entering the value of the file size in the Bitrate Calculator.\n    * Convert any segment and split file\n      Any segment of one video can be converted by setting start time and duration. Or split file into several files by customizing file size or split time with Xilisoft HD Video Converter.\n\nHD video converter\nRun the HD converter in background top\nHave a wonderful experience on fast and effective conversion\nHD convert\n\n    * Run the HD converter in background\n      Xilisoft HD Video Converter supports running the HD converter in the background to save more time and space.\n    * After done actions\n      Automatically shutdown action among several after done actions: exit, hibernate and standby lets you just sit and have a cup of coffee.\n    * Multithreading and batch conversion\n      The MTS/M2TS/TS video converter supports multithreading and batch file conversion to convert multiple files at one time to cut back on the conversion time.\n    * Preview and snapshot\n      Offers you a built-in player (which is resizable and can be used as a stand-alone player with 4:3 and 16:9 zoom modes) to preview videos and take a snapshot of your desired movie scenes and save them as picture files.\n    * Power Management\n      Allows you to manage your system power in this HD video converter.\n    * Several languages\n      Support multiple languages: German, Chinese, English, Japanese, French and Spanish.\n &lt;a href=&quot;\nhttp://www.xilisoft.com/hd-video-converter.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.xilisoft.com/hd-video-converter.html&lt;/a&gt;\n\nInstallation Info:\n\nCopy the imfc0.dll file to the install folder \n\nC:\\Program Files\\Xilisoft\\HD Video Converter 6\n\nand copy over the other one in there.\n(make sure program is off )\n\n\nThen start the program\n\nand go to help and to enter licence code\n\nand enter any name and code (anything will work )\n\nEnjoy from Slickinator\n\n\n\n","torrent":{"xt":"urn:btih:9a3da3904bac7a95f00bfa3425011ebebc94b2df","amp;dn":"Xilisoft+HD+Video+Converter+6.0.14.1104%2Bcrk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a3da3904bac7a95f00bfa3425011ebebc94b2df","infoHashBuffer":{"type":"Buffer","data":[154,61,163,144,75,172,122,149,240,11,250,52,37,1,30,190,188,148,178,223]},"announce":[],"urlList":[]}}