{"title":"LOST Season 6 - DVD 5","uid":5943765,"size":7324270639,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9d3ae4f7f92cf1fb5dedaa832c062815df386c9d&amp;dn=LOST+Season+6+-+DVD+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"darth-malachi","files":2,"time":1289279476,"description":"Lost: The Complete Sixth Season: DVD 5 of 5\n\nThis is the last of the five DVD's in the complete collection of Sixth and Final Season of LOST, which includes the following content:\n#6.17: The End\n#The New Man in Charge - The Epilogue to the LOST Saga\nTHE END: Crafting A Final Season - A featurette detailing production of the final season\nA Hero's Journey - An analysis of LOST as a traditional journey of a mythological hero\nSee You In Another Life, Brotha - A featurette dedicated to the Flash-Sideways\nBlooper reel\nLOST on Location:\n*LA X\n*Recon\n*Ab Aeterno\n*The Candidate\n\nAs you might have noticed, this DVD does not include the deleted scenes. But don't blame me - that's because all physical Region 2 DVDs came that way! Also axed are the &quot;LOST on Location&quot; featurettes for &quot;The Substitute&quot; and &quot;Happily Ever After&quot; and one of the hidden Easter Eggs.\n\nIt looks like they needed more space for extra audio tracks, so somebody decided to remove the most interesting content behind &quot;The New Man in Charge&quot;, which sucks so hard. If anyone can upload the Region 1 or Region 4 DVD, I encourage you to do so, lots of people would that you, myself included. In the meantime the only way I'm afraid the only way I can provide you the Deleted scenes is through this Youtube video: http://www.youtube.com/watch?v=xlc047AJdg8.\n\nPLEASE SEED THE TORRENT AFTER YOU DOWNLOAD IT. THANK YOU.","torrent":{"xt":"urn:btih:9d3ae4f7f92cf1fb5dedaa832c062815df386c9d","amp;dn":"LOST+Season+6+-+DVD+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d3ae4f7f92cf1fb5dedaa832c062815df386c9d","infoHashBuffer":{"type":"Buffer","data":[157,58,228,247,249,44,241,251,93,237,170,131,44,6,40,21,223,56,108,157]},"announce":[],"urlList":[]}}