{"title":"ComputerIDEE Nr. 24 van 9 - 23 Nov (dutch) 2Lions-Team","uid":5942569,"size":17679369,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9dd89dccda34587e23392e4db633526a91801f9c&amp;dn=ComputerIDEE+Nr.+24+van+9+-+23+Nov+%28dutch%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1289230769,"description":"ComputerIDEE Nr. 24 van 9 - 23 Nov.       \n   \n \nNummer 24, jaargang 2010\n\nVeel mensen kiezen tegenwoordig voor een laptop voor in de kamer, een van de redenen daarvoor kan zijn dat de laptop minder lawaai maakt dan de doorsnee pc. In dit nummer vindt u in de koopwijzer precies welke fluisterstille voeding voor uw geschikt is en laten we u ien hoe u deze voeding in een bestaande pc inbouwt zodat ook deze prima dienst kan doen in de huiskamer. Hoort u dan nog steeds lawaai dan kunt u altijd nog de workshop volgen waarin we laten zie hoe u uw oude hifi-speakers een tweede leven kunt geven als pc-speakers. Volume iets omhoog en u hoort uw pc ook niet meer. In de rubriek software bespreken we de populaire Grand Theft Auto game-reeks waarvan ieder deel overigens een goede soundtrack heeft voor uw vers gebouwde pc-speakers. Is de muziek niet naar uw smaak dan kunt u natuurlijk gewoon uw eigen collectie muziek afspelen. Een handig programma om uw muziek te beheren is MediaMonkey, in de workshop in het blad leest u er alles over. Bent u niet zo'n audiofiel maar bent u meer visueel ingesteld dan is het artikel over de persoonlijke make-over van Windows 7 geschikt voor u. In dit artikel leest u precies hoe u het uiterlijk van Windows 7 naar uw eigen smaak inricht. Verder leren we u handige invulformulieren in Word en een microblog met Tumblr maken.\n\nComputer Idee 24/2010: vanaf dinsdag 9 november in de winkel!\nFormaat: PDF\nThanks:  Viking43\n \n \n\n\n\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live","torrent":{"xt":"urn:btih:9dd89dccda34587e23392e4db633526a91801f9c","amp;dn":"ComputerIDEE+Nr.+24+van+9+-+23+Nov+%28dutch%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dd89dccda34587e23392e4db633526a91801f9c","infoHashBuffer":{"type":"Buffer","data":[157,216,157,204,218,52,88,126,35,57,46,77,182,51,82,106,145,128,31,156]},"announce":[],"urlList":[]}}