{"title":"David Pawson _ Men For God","uid":6210863,"size":1973163199,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:9ebcedf0dbb19a495550632831ac996d57b5ce13&amp;dn=David+Pawson+_+Men+For+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mardu33","files":-1,"time":1298979171,"description":"David Pawson - Men For God:\n---------------------------\n\nSize: 1.83Gb\nLength: 5h 5min\n\n\n1. A Burden for Men\n2. Male and Female\n3. Hard at Work\n4. Making Disciples\n\nWhen God numbered Israel, He counted the men over twenty who were able to fight. When Jesus began to build his Church, He chose twelve men, most of whom worked with their hands. The New Testament letters are well addressed to 'brothers'...\n\nWhy is it easier to get women converted than men?\nWhat are the differences between men and women?\nIs a man's daily work a necessary evil or is his full-time Christian service?\nHow can we disciple men today?\n\nThese and many other questions about the roles and responsibilities of men are answered by David Pawson, who for some years has been leading seminars for men in this Country and overseas under the banner of 'Men for God'.\n\nThese two DVDs, have a total running time of five and a half hours, divided into four sections. They are designed for men to study and discuss together in groups or for personal use.\n\n\n\n\nDavid Pawson\n\nJ. David Pawson (born 1930) is a prominent contemporary Bible teacher based in Great Britain. He is known for his firm belief in the infallibility and inerrancy of the text of the Bible as the authoritative word of God, while explaining its meaning and context. He has a reputation of following the teaching of Scripture even when it clashes with church tradition, and also often deals with 'hot topics' about which Christians have a wide range of views. He is therefore frequently controversial, although he is generally respected by Christians of differing views for his human sensitivity and concern for truth.\n\nSince his ancestor John Pawson preached with John Wesley in the 18th century, the Pawsons have been farmers, (Methodist) preachers or both; his father, Professor Cecil Pawson, was involved with both. From his childhood in the north of England David Pawson had wanted to be a farmer, but by the time he had completed his studies for a BSc in Agriculture at Durham University, he was sure that God was calling him into fulltime Christian ministry.\n\nStudying by arrangement with the Methodist church for his M.A. degree in theology at Cambridge University, under the influence of liberal teaching and liberal lecturers, Pawson lost his trust in the Bible and very nearly his faith in God. After a short spell in ministry for the Methodist church, including evangelisation and the pastoring of churches in the Shetland Islands, he regained his trust in the infallibility and inerrancy of the Bible while a chaplain in the Royal Air Force of Great Britain. Pawson had been appointed chaplain for servicemen who did not designate themselves as Anglican or Roman Catholic. These included committed free-church Christians and servicemen who designated themselves atheist or agnostic.\n\nDuring this period he stopped delivering primarily thematic sermons, and decided instead to preach the Bible systematically from start to finish. The results among the servicemen surprised both him and them, and confirmed to him Scripture's inspiration. Since then, his preaching has either been Bible study or topical studies based on detailed contextual examination of what the Bible says.\n\nFrom his study of the Bible, Pawson had reached the conclusion that the New Testament acknowledged only one type of baptism, believer's baptism. On his return to Britain from air bases in Aden, he felt unable to continue to perform baby baptism (as practised in Methodism and many other denominations). After appearing before a doctrinal committee of the Methodist church, Pawson was expected to leave the denomination, and did so - facing the loss of his home and livelihood. Within 24 hours, however, he received an invitation from Gold Hill Baptist Church in Buckinghamshire to become their pastor, which he took up.\n\nLater, as pastor of Guildford Baptist Church (the Millmead Centre, which he designed), David Pawson established a reputation among both evangelicals and charismatics as an effective and balanced expositor of the Bible. From here his teaching tapes - originally made for the church's sick and elderly members - became popular worldwide.\n\nBehind the communist Iron Curtain these tapes struck a chord with the persecuted church. Missionaries and spiritual leaders in far-off corners of the world, without the opportunity to sit under a regular teaching ministry, also became a significant audience for Pawson's preaching.\n\nUnder Pawson's ministry, Millmead became the largest Baptist church in Britain. The church was unusual in that attendance was double the membership number; people regularly came from London to hear Pawson preach. Cliff Richard, who had been baptised by Pawson, was a regular worshipper.\n\nPawson left Millmead in 1979 and engaged in an itinerant worldwide Bible teaching ministry, which has been his main work to the present. During this time he has written a number of books (detailed below). He is a frequent speaker in the UK, and his speaking engagements have taken him to many other parts of the world, including Australia, New Zealand, South Africa, The Netherlands, Israel, Southeast Asia and the United States.\n\nDavid Pawson lives near Basingstoke, Hampshire in southern England with his wife Enid. In his 70s he remains busy with speaking engagements and has annual speaking appointments in Europe and at the Festival of Tabernacles in Israel, which he was a pioneer in encouraging Christians to attend.\n\nThe popularity of Pawson's books is outstripped by his video and audio teaching messages. He also appears regularly on various Christian radio and television broadcasting networks. In particular, his Unlocking The Bible DVD series is used among housegroups worldwide.","torrent":{"xt":"urn:btih:9ebcedf0dbb19a495550632831ac996d57b5ce13","amp;dn":"David+Pawson+_+Men+For+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ebcedf0dbb19a495550632831ac996d57b5ce13","infoHashBuffer":{"type":"Buffer","data":[158,188,237,240,219,177,154,73,85,80,99,40,49,172,153,109,87,181,206,19]},"announce":[],"urlList":[]}}