{"title":"The Dead Milkmen - Punk Rock Girl (2nafish)","uid":6012792,"size":94715908,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9f356d0f16a884089ac7ae68463baee43eafc2ad&amp;dn=The+Dead+Milkmen+-+Punk+Rock+Girl+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1291522561,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nBeelzebubba is the fourth full-length studio album by the punk band The Dead Milkmen, released in 1988. The album featured their best-known song &quot;Punk Rock Girl.&quot; The song's video won rotation on MTV. While their music was still lively, some saw this album as more musically sophisticated than previous work (using trumpets in &quot;RC's Mom&quot;, organ in &quot;Bad Party&quot;, accordion in &quot;Punk Rock Girl&quot;, violins in &quot;Born to Love Volcanos,&quot; etc.)\n\nIn 1989, the Dead Milkmen released the Smokin' Banana Peels EP, which contained several remixes of the song Smokin' Banana Peels, originally featured on Beelzebubba. It also featured several previously unreleased songs.\n\nFive tracks from this album (I Walk The Thinnest Line, Stuart, Punk Rock Girl, Smokin' Banana Peels, and Life Is Shit) were selected for their 1997 compilation album Death Rides a Pale Cow: The Ultimate Collection.\n\nThe album cover features Rodney Linderman's father, also Rodney.\n\nThe song &quot;Punk Rock Girl&quot; is featured in the video game Tony Hawk's Project 8 and is covered by MxPx in On the Cover II. It was also covered by Streetlight Manifesto in their cover-project 99 Songs of Revolution. The music video was shown on an episode of Beavis and Butt-head.\n\nThe song &quot;The Guitar Song&quot; is covered by the Christian rock band Ghoti Hook on the album Songs We Didn't Write.\n\nThe Dead Milkmen is an American satirical punk rock band formed in 1983 in Philadelphia, Pennsylvania. They initially consisted of vocalist and keyboardist Rodney Linderman (&quot;Rodney Anonymous&quot;), guitarist and vocalist Joe Genaro (&quot;Joe Jack Talcum&quot;), bassist Dave Schulthise (&quot;Dave Blood&quot;) and Dean Sabatino (&quot;Dean Clean&quot;).\n\nBeginning within the local underground hardcore scene of the early 1980s, the band established their jangly punk sound, which they coupled with prominent humor delivered in heavy Philadelphia accents. After garnering an underground following through extensive touring and college radio attention, they enjoyed international success on the strength of 1988's &quot;Punk Rock Girl&quot;, a single from their Beelzebubba album which entered into MTV rotation. Health problems and an ill-fated stint with the major label Hollywood Records in the wake of their success led to the group's 1995 breakup. In total, they issued eight studio albums, one live record, and numerous peripheral releases before disbanding.\n\nIn 2008, the group reunited and began working on new material, with new bassist Dan Stevens replacing the deceased Schulthise.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9f356d0f16a884089ac7ae68463baee43eafc2ad","amp;dn":"The+Dead+Milkmen+-+Punk+Rock+Girl+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f356d0f16a884089ac7ae68463baee43eafc2ad","infoHashBuffer":{"type":"Buffer","data":[159,53,109,15,22,168,132,8,154,199,174,104,70,59,174,228,62,175,194,173]},"announce":[],"urlList":[]}}