{"title":"Abandon All Ships - Megawacko 2.1 (2nafish)","uid":6007373,"size":161153028,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9f554cb3d5f0b80144bd9a1b5731e1da5a0f20fc&amp;dn=Abandon+All+Ships+-+Megawacko+2.1+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1291360838,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos.\n\n\nGeeving is the debut studio album by Canadian post-hardcore band Abandon All Ships. It was released through Universal Music Canada, Underground Operations, Rise Records, and Velocity Records on October 5, 2010. The album charted at number 16 on the Billboard Top Heatseekers chart, as well as number 27 on the Canadian Albums Chart.\n\nThey released their first single, &quot;Take One Last Breath&quot; formerly &quot;Pedestrians Is Another Word for Speedbumps&quot; on June 29, 2010; the music video was online the same day. They recently played at Bluesfest in Ottawa, Ontario. At the show they played some new songs, including &quot;Geeving&quot;, &quot;Guardian Angel&quot;, &quot;Megawacko 2.0&quot;, and &quot;Take One Last Breath&quot;, which are all expected to be on the album. Their latest single &quot;Megawacko 2.0&quot;, later to be renamed &quot;Megawacko 2.1&quot;, was released on iTunes on August 24, 2010, along with the music video which premiered on MuchMusic that same day. In September they released a never before heard song called &quot;Bro My God&quot; on their Myspace site and it is also on Geeving. Maria (I like it loud) is now available to download for free on twitter in order to promote Geeving.\n\nAbandon All Ships is a Canadian Metalcore band from Toronto, Ontario. Formed in 2006, the group is currently signed to Underground Operations, Universal Music Canada, Rise Records, and are the first band to be signed to Velocity Records. Together, they have one EP named Abandon All Ships and one studio album, Geeving.\n\nThey recently played at Bluesfest in Ottawa, Ontario. At the show they played some new songs, including &quot;Geeving&quot;, &quot;Guardian Angel&quot;, &quot;Maria (I Like It Loud)&quot; and their first single &quot;Take One Last Breath&quot;, which are all expected to be on the album Geeving coming out October 5th, 2010. They are right now touring across America and Canada with other bands, they played a show in Toronto, Ontario on August 25, 2010. This will be the only time they will be in Toronto, Ontario up until October, when the album comes out. The new single &quot;Megawacko 2.0&quot; was released on iTunes on August 24, 2010, along with the music video premiering on MuchMusic that same day. In September they released a never before heard song called &quot;Bro My God&quot; on their Myspace site. This album was leaked onto torrent websites as well as Youtube on October 3, 2010. They are currently on the Monument tour with Miss May I, Sleeping with Sirens, The Crimson Armada, and Bury Tomorrow.\n\nThe band's musical genre has been the topic of debate among fans of the band. Genre's that come into play are metalcore, post-hardcore, hardcore techno, screamo, nu metal alternative metal, electronica, melodic death metal, industrial rock and hardcore punk\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9f554cb3d5f0b80144bd9a1b5731e1da5a0f20fc","amp;dn":"Abandon+All+Ships+-+Megawacko+2.1+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f554cb3d5f0b80144bd9a1b5731e1da5a0f20fc","infoHashBuffer":{"type":"Buffer","data":[159,85,76,179,213,240,184,1,68,189,154,27,87,49,225,218,90,15,32,252]},"announce":[],"urlList":[]}}