{"title":"jackass 2 unrated","uid":6210021,"size":8253065628,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a00afa225aeab2515974b701cd7d951ffc60b866&amp;dn=jackass+2+unrated+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"druiddeath1","files":39,"time":1298949028,"description":"Jackass Number Two could be alternately titled &quot;From Bowties to Bunny Ears: What Will Chris Pontius Be Wearing Next?&quot; Like the first Jackass movie, Johnny, Bam, Chris, Steve-O, and the rest of the gang are all here. This &quot;sequel&quot; is full of stunts, pranks, and one-liners, and contains more male nudity, more scream-worthy moments, and of course more uncontrollable laughter. The film opens with a rather well-directed cinematic piece: the entire Jackass gang running from a stampede of bulls. From there it takes off into the hysterically exhausting world of Jackass. The bulls are in quite a few stunts, actually, one of which has &quot;leader&quot; Johnny Knoxville using himself as a red flag and getting speared by a charging bull. Ah, good times. Some of the stunts include: &quot;Beehive Limo,&quot; &quot;Fart Mask,&quot; &quot;Red Rocket,&quot; and a fake terrorist plot which boasts the improv line &quot;Where I'm going, I don't need luggage.&quot; Bam gets branded, they fish for sharks with Steve-O as bait, Johnny catches anacondas with his bare hands... the list goes on. The gem in this collection of antics has to be the offensive interactions with the innocent people on the street by Johnny Knoxville and director-actor Spike Jonez, while disguised as a very old man and woman. Celebrity guests partaking in stunts include extreme-sports legends Tony Hawk and Mat Hoffman. The movie culminates in a beautifully choreographed, fantastical, and dangerous musical number not to be missed. Throughout the movie, it is apparent that the Jackass gang is older and a little more worn, especially when Bam pleads, &quot;Please God, don't let there be a Jackass 3.&quot; For fans of the TV series and the films, a trilogy may be just what the doctor ordered. The DVD extras (deleted scenes, unrated material, and two pretty funny music videos) are more of the same and worth the watch, though some of it is not for the fainthearted.","torrent":{"xt":"urn:btih:a00afa225aeab2515974b701cd7d951ffc60b866","amp;dn":"jackass+2+unrated+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a00afa225aeab2515974b701cd7d951ffc60b866","infoHashBuffer":{"type":"Buffer","data":[160,10,250,34,90,234,178,81,89,116,183,1,205,125,149,31,252,96,184,102]},"announce":[],"urlList":[]}}