{"title":"The Neverhood (complete disk image)","uid":5947057,"size":748135920,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a017b047dd133566f61da74a40486c0ce102fe95&amp;dn=The+Neverhood+%28complete+disk+image%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dan_Locke","files":1,"time":1289407435,"description":"This is my favorite computer game ever.  It's a claymation adventure game from 1996 with strange scenery and a plot loosely based on the Book of Mormon (although the creator, Douglas TenNapel, was not a Mormon himself).  Being claymation, the graphics are very good (albeit in low resolution and only 256 colors - this IS a game from 1996, after all), but the music and cutscenes are also excellent, and there's a lot of atmosphere.\n\nThis is a disk image with ALL cutscenes and music intact, and not some low-grade rip.  Run it by either burning it to a CD (I use IMGBurn; it's freeware) or mounting it in a virtual drive (I use VirtualCloneDrive, which is also freeware).\n\nA word of warning: there's a bug that makes one of the game's puzzles unsolveable if you do one of the steps without the proper preparation.  Over by the Cannon Monument (the giant gun with a bird on top), there's a screen in the wall with a button underneath.  DO NOT PUSH THAT BUTTON, unless you are ready with a pencil and paper to write down what it displays.  When it's pushed, it displays a symbol, and pushing it repeatedly displays a sequence of symbols that's necessary later on in the game.  The problem is that it doesn't reset the sequence, so you can accidentally get it all out-of-sync (say, by pressing the button a few times and leaving) and screw up the game.  Again, I'm certain that it's a bug, but it could make your game unwinnable (unless you brute-force the puzzle later on by starting once on each symbol of the sequence, but that would take a very long time).  While writing down the sequence, make sure to note which symbol plays a synthesizer sample when displayed; it's important.\n\nHave fun!","torrent":{"xt":"urn:btih:a017b047dd133566f61da74a40486c0ce102fe95","amp;dn":"The+Neverhood+%28complete+disk+image%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a017b047dd133566f61da74a40486c0ce102fe95","infoHashBuffer":{"type":"Buffer","data":[160,23,176,71,221,19,53,102,246,29,167,74,64,72,108,12,225,2,254,149]},"announce":[],"urlList":[]}}