{"title":"A Vision of Hell: The Unspeakable Torment of Other Species","uid":6040918,"size":13777974,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a0deff810503aa0331d2c5dca0f67f349b0a9605&amp;dn=A+Vision+of+Hell%3A+The+Unspeakable+Torment+of+Other+Species&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Djofullinn","files":2,"time":1292384971,"description":"A Vision of Hell: The Unspeakable Torment of Other Species\n\n\nTaking Aim\nWith Ralph Schoenman and Mya Shone\n\n  A Vision of Hell: The Unspeakable Torment of Other Species\n\n  July 1, 2003\n\n  Imagine being hit on the head and finding yourself dazed but still fully conscious. A chain is attached to one of your legs and you're hoisted upside down. As you lash out in terror, gigantic clippers are used to snip off the lower parts of your legs and arms. Completely helpless, you feel cuts into your thighs, belly and sides as your skin is stripped from your legs to your neck. Even with the skin peeled back all the way up to your head, you are conscious enough to struggle.\n\n  Such atrocities would be condemned anywhere in the world, yet atrocities like these are happening to countless animals every day in U.S. slaughterhouses.\n\n  A meat packing plant is like nothing you've ever seen or could imagine, stated Eleanor Kennelly of the United Food and Commercial Workers Union. It's a vision of hell.\n\n  In 1996, over 9 billion animals were killed for food in the U.S. Among the victims were: 8 billion &quot;meat&quot; chickens, 407 million &quot;egg&quot; chickens, 409 million turkeys, 107 million pigs, 37 million cattle, 22 million ducks and 7 million calves for veal.  Today the number of animals slaughtered for food has risen to over 10 billion and these numbers do not include 300 million males chickens who are killed at birth, 300,000 horses slaughtered in the U.S. for export to Europe and Asia for human consumption and countless fish taken from the oceans.\n\n  A Vision of Hell: The Unspeakable Torment of Other Species is a meticulous examination of brutality towards animals, the exploitation of workers at industrial farms, slaughter and packinghouses, and the devastating impact on our health and environment.\n\nTwo mp3 files, two hours total. Not for the faint of heart.","torrent":{"xt":"urn:btih:a0deff810503aa0331d2c5dca0f67f349b0a9605","amp;dn":"A+Vision+of+Hell%3A+The+Unspeakable+Torment+of+Other+Species","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0deff810503aa0331d2c5dca0f67f349b0a9605","infoHashBuffer":{"type":"Buffer","data":[160,222,255,129,5,3,170,3,49,210,197,220,160,246,127,52,155,10,150,5]},"announce":[],"urlList":[]}}