{"title":"14.De.Abril.La.Republica.1X01.HDTV.Xvid.Spanish.By.Ainhdesi","uid":6129629,"size":771596400,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a0f05633ae573b53c93d7390b2b1feaa4248d3d8&amp;dn=14.De.Abril.La.Republica.1X01.HDTV.Xvid.Spanish.By.Ainhdesi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ainhdesi","files":-1,"time":1296074027,"description":"1X01 - En un cementerio de Madrid se procede a la exhumaciÃƒÂ³n del cuerpo de Ramiro Villaseca, el nombre del autÃƒÂ©ntico MarquÃƒÂ©s de Castro. A ella acude el prestigioso abogado de Madrid, AgustÃƒÂ­n de la Torre. El ataÃƒÂºd estÃƒÂ¡ vacÃƒÂ­o. La bÃƒÂºsqueda del marquÃƒÂ©s, que un misterioso cliente ha encargado al abogado, debe continuar.\n\nAgustÃƒÂ­n es el patriarca de la familia De la Torre, una familia de la alta sociedad madrileÃƒÂ±a emparentada con la aristocracia a travÃƒÂ©s de su mujer, Leocadia. A esa familia, recomendada por Isabel de Viana (prima de Leocadia), entra a servir Ludi el mismo dÃƒÂ­a en que los De la Torre celebran el cumpleaÃƒÂ±os de la hija menor, Beatriz, una joven enferma que recibe los mimos de toda la familia.\n\nA la fiesta acudirÃƒÂ¡n todos menos su hermano Fernando, amante de la noche y de las mujeres. EstÃƒÂ¡ en compaÃƒÂ±ÃƒÂ­a de su amigo de la infancia, JesÃƒÂºs, hijo del guardÃƒÂ©s de la gran finca de sus padres, en 'El AlemÃƒÂ¡n'. Este tipo de locales han surgido dando color a las noches de este nuevo Madrid republicano. Lo regenta Amparo, una enigmÃƒÂ¡tica mujer. Tras la proclamaciÃƒÂ³n de la RepÃƒÂºblica, Ventura y Encarna viven en Madrid.\n\nVentura ve necesario un fuerte golpe de timÃƒÂ³n que haga triunfar realmente la revoluciÃƒÂ³n. Encarna estÃƒÂ¡ completamente comprometida con las reformas que traerÃƒÂ¡n esa revoluciÃƒÂ³n paso a paso. Por su parte, Hugo de Viana, reciÃƒÂ©n ascendido, y gracias a las influencias de AgustÃƒÂ­n, ha sido trasladado a Madrid. Desde este nuevo emplazamiento darÃƒÂ¡ los primeros pasos para promover un alzamiento militar contra la RepÃƒÂºblica, en el que contarÃƒÂ¡ con el apoyo de AgustÃƒÂ­n.\n\nFernando inicia un viaje hacia la responsabilidad y el compromiso que le harÃƒÂ¡, por una parte enfrentarse a su padre y tratar de evitar el conflicto con los jornaleros que trabajan las tierras, y por otro, comprometerse con Mercedes. El mismo dÃƒÂ­a del compromiso llega Alejandra, la hermana de JesÃƒÂºs y protegida de Leocadia que le ha costeado sus estudios de seÃƒÂ±orita en ParÃƒÂ­s.","torrent":{"xt":"urn:btih:a0f05633ae573b53c93d7390b2b1feaa4248d3d8","amp;dn":"14.De.Abril.La.Republica.1X01.HDTV.Xvid.Spanish.By.Ainhdesi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0f05633ae573b53c93d7390b2b1feaa4248d3d8","infoHashBuffer":{"type":"Buffer","data":[160,240,86,51,174,87,59,83,201,61,115,144,178,177,254,170,66,72,211,216]},"announce":[],"urlList":[]}}