{"title":"TC Ultima Prime v5.2 + Key -TrT","uid":5990576,"size":147134053,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a2aa5f963893b9fe9d1cdd3fe71c710b7d7a615e&amp;dn=TC+Ultima+Prime+v5.2+%2B+Key+-TrT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigwimpie","files":1,"time":1290875503,"description":"Total Commander Ultima Prime 5.2\nReg. Key Included\n\nThis is an extended version of Total Commander 7 Copyright (c) 1993-2007 by Christian Ghisler. Total Commander Ultima Prime is a special distribution of Christian Ghisler's Total Commander with many useful third-party add-ons, plug-ins and customisations. It also contains extended main menu and toolbar, other programs, changed layout and other elements. \nThe newest version brings another installer's code changes. Since now it is possible to start TC UP with operating system. Because of false alerts provided by antivirus applications, TC UP is installed with safe mode, without any suspicious files. To install whole project's content users should choose &quot;full installation&quot; mode.\nThe project has gained WinContig application for deframenting files purpose. Advanced users should be satisfy with excellent log viewer called Tail for Win32. The way of providing additional informations in customized columns has been corrected.\n\n\nChanges in Version 5.2 (2010 08 31):\n- Added function to make Opera@USB as default system Browser.\n- Added function to autopin TC UP (and other programs) icon on Windows 7 Taskbar and Start Menu (based on Windows Script Host Script, experimental). Works only on systems with EN, PL and DE language (for now).\n- Designed new Windows 7 drive bar.\n- TC UP Turbo - General code optimization. New design of information window.\n- Function to read installation language for uninstaller and repair mode.\n- Updated VirtualDisk driver.\n- Updated NSIS plugins (EmbeddedLists.dll (v1.4 RC2), LockedList.dll (v2.0), by Stu).\n- Updated Installer pages graphics and design.\n- Updated Installer pages. General updates and code optimization.\n- Updated TC UP licenses (translation, moved here credits).\n- Removed Credits from Welcome Page.\n- Removed modification of %PATH% system variable.\n- Removed WINAMP support in Total Commander taskbar information (for now).\n- Updated Uninstaller Repair Mode.\n- Updated Uninstaller code rewritten (Code optimizations, updates and fixes).\n- Fixed %DISK_PERCENT_USED_SPACE% and %DISK_PERCENT_FREE_AVAILABLE% tags (inverted).\n- Fixed issue with not closing TC UP.exe process, if TC has enabled &quot;Run only one instance&quot; option.\n- Added posibility to donate project via Finish page of installer.\n- &quot;AIMP&quot; has been updated to the newest version (2.61.583).\n- &quot;Free Download Manager&quot; has been updated to the newest version (3.0 build 852).\n- &quot;InfraRecorder&quot; has been updated to the newest version (0.51).\n- &quot;Inkscape&quot; has been updated to the newest version (0.48).\n- &quot;Miranda IM&quot; has been updated to the newest version (0.9.2).\n- &quot;Notepad++&quot; has been updated to the newest version (5.7 Unicode).\n- &quot;Opera@USB&quot; has been updated to the newest version (10.61).\n- &quot;Recuva&quot; has been updated to the newest version (1.38.504).\n- &quot;System Info for Windows&quot; has been updated to the newest version 2010 (build 0714a).\n- &quot;Sumatra PDF&quot; has been updated to the newest version (1.1).\n- &quot;System Explorer&quot; has been updated to the newest version (2.3.2.3114).\n- &quot;Total Commander&quot; has been updated to the newest version (7.55a).\n- &quot;Unlocker&quot; has been updated to the newest version (1.9.0).\n- &quot;Ã‚ÂµTorrent&quot; has been updated to the newest version (2.0.3).\n- &quot;VirtualDub&quot; has been updated to the newest version (1.9.9 Build 32817).\n- &quot;XnView&quot; has been updated to the newest version (1.97.6).\n- Fixed ColSel. Also, it saves now default language.\n- Various plugins have been updated.\n- Known bugs have been fixed.\n\n*************************************************\n*\t\t\tInstall Notes\t\t\t\t\t\t*\n*************************************************\n* 1). Run Installer tcup52.exe\t\t\t\t\t*\n*\t  Follow Install Instructions\t\t\t\t*\n* 2). Don't start TC Ultima after installation\t*\n* 3). Copy wincmd.key (see Key folder)\t\t\t*\n*\t  Into Install directory.\t\t\t\t\t*\n* 4). Ready to launch the registered version of *\n*\t  TC Ultima Prime 5.2\t\t\t\t\t\t*\n*************************************************\nEnjoy, and please seed for a couple of hours\nTrT (TheRipTeam)\n\n","torrent":{"xt":"urn:btih:a2aa5f963893b9fe9d1cdd3fe71c710b7d7a615e","amp;dn":"TC+Ultima+Prime+v5.2+%2B+Key+-TrT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2aa5f963893b9fe9d1cdd3fe71c710b7d7a615e","infoHashBuffer":{"type":"Buffer","data":[162,170,95,150,56,147,185,254,157,28,221,63,231,28,113,11,125,122,97,94]},"announce":[],"urlList":[]}}