{"title":"(Blues) Blind Boy Fuller - Sweet Honey Hole","uid":6068314,"size":85695758,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a3661e5d1b4d7141d1280477f3abca4529dbd4ab&amp;dn=%28Blues%29+Blind+Boy+Fuller+-+Sweet+Honey+Hole&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":-1,"time":1293491997,"description":"mp3   320kbps\n\nStyles: Piedmont blues, Country blues\nReleased: 16 Feb 2009\nLabel: Platinum Records\n\n\n1. Sweet Honey Hole [2:47]\n2. My Brown Skin Sugar Plum [2:58]\n3. Somebody's Been Playing With T [3:12]\n4. Baby I Don't Have To Worry [3:02]\n5. I'm Climbin On Top Of The Hill [3:17]\n6. You Never Can Tell [2:54]\n7. Big Leg Woman Gets My Pay [2:42]\n8. Untrue Blues [2:48]\n9. Mamie [2:43]\n10. Step It Up And Go [2:55]\n11. Ain't It A Cryin' Shame [3:02]\n12. Baby You Gotta Change Your Min [3:12]\n\n\nUnlike blues artists like Big Bill or Memphis Minnie who recorded extensively over three or four decades, Blind Boy Fuller recorded his substantial body of work over a short, six-year span. Neverthless, he was one of the most recorded artists of his time and by far the most popular and influential Piedmont blues player of all time. Fuller could play in multiple styles: slide, ragtime, pop, and blues were all enhanced by his National steel guitar. Fuller worked with some fine sidemen, including Davis, Sonny Terry, and washboard player Bull City Red. Initially discovered and promoted by Carolina entrepreneur H. B. Long, Fuller recorded for ARC and Decca. He also served as a conduit to recording sessions, steering fellow blues musicians to the studio.\n\nIn spite of Fuller's recorded output, most of his musical life was spent as a street musician and house party favorite, and he possessed the skills to reinterpret and cover the hits of other artists as well. In this sense, he was a synthesizer of styles, parallel in many ways to Robert Johnson, his contemporary who died three years earlier. Like Johnson, Fuller lived fast and died young in 1942, only 33 years old. Fuller was a fine, expressive vocalist and a masterful guitar player best remembered for his uptempo ragtime hits &quot;Rag Mama Rag,&quot; &quot;Trucking My Blues Away,&quot; and &quot;Step It Up and Go.&quot; At the same time he was capable of deeper material, and his versions of &quot;Lost Lover Blues&quot; or &quot;Mamie&quot; are as deep as most Delta blues. Because of his popularity, he may have been overexposed on records, yet most of his songs remained close to tradition and much of his repertoire and style is kept alive by North Carolina and Virginia artists today.\n\n","torrent":{"xt":"urn:btih:a3661e5d1b4d7141d1280477f3abca4529dbd4ab","amp;dn":"%28Blues%29+Blind+Boy+Fuller+-+Sweet+Honey+Hole","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3661e5d1b4d7141d1280477f3abca4529dbd4ab","infoHashBuffer":{"type":"Buffer","data":[163,102,30,93,27,77,113,65,209,40,4,119,243,171,202,69,41,219,212,171]},"announce":[],"urlList":[]}}