{"title":"Democracy Now - 15 nov 2010","uid":5958632,"size":441337965,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a3ce3dd83517e6d448694ffc201f56e34e3f57c6&amp;dn=Democracy+Now+-+15+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1289838328,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 15, 2010\n\n- Cholera Toll Surpasses 900 in Haiti\n- Karzai Calls for Reduced U.S. Military Operations in Afghanistan\n- Aung San Suu Kyi Freed in Burma\n- U.S. Offers Israel Military Upgrade, Peace Veto for Limited Settlement Freeze\n- White House Drops Plans to Close Gitmo\n- Supreme Court Won't Intervene on &quot;Don't Ask, Don't Tell&quot;\n- Cindy McCain Criticizes DADT\n- Dems Reach House Leadership Deal\n- Admin Pledges $4B in Nuke Spending for START\n- Arizona Voters Approve Medical Marijuana\n- Study: Media Under-Reported Climate Science in Copenhagen Science\n\n\nSpecial reports\n\n- Burmese Pro-Democracy Leader Free Aung San Suu Kyi Freed After 15 of Past 21 Years in Detention\n\nIn Burma, pro-democracy leader Aung San Suu Kyi is free. The Nobel Peace Prize laureate has spent 15 of the past 21 years in detention. She was released on Saturday by the Burmese military junta after her latest period of house arrest expired. Hundreds of people rushed to her home after the authorities removed barbed-wire barricades in front of her compound. We speak with Burmese dissident and former political prisoner Aung Din and Jennifer Quigley of the US campaign for Burma.\n\n\n- Moroccan Forces Raid Protest Camp in Western Sahara , Thousands Demonstrate in Madrid Against Crackdown\n\nThousands of people demonstrated in Madrid on Saturday against Morocco's recent crackdown in Western Sahara. Moroccan security forces last week raided a camp where some 20,000 Sahrawis had been staging a massive protest against the Moroccan occupation. Morocco has announced that it will try in a military court over 100 Sahrawi activists who helped organize the camp. We go to Laayoune to speak with Peter Bouckaert of Human Rights Watch and we are joined by University of San Francisco professor Stephen Zunes, author of Western Sahara: War, Nationalism, and Conflict Irresolution.\n\n\n- Author and Activist Derrick Jensen: &quot;The Dominant Culture is Killing the Planet...It's Very Important For Us To Start to Build a Culture of Resistance&quot;\n\nDerrick Jensen has been called the poet-philosopher of the ecological movement. He has written some 15 books critiquing contemporary society and the destruction of the environment. His many books include A Language Older Than Words, Endgame, What We Left Behind, Resistance Against Empire and Deep Green Resistance. We play Part I of our conversation with him. &quot;I think a lot of us are increasingly recognizing that the dominant culture is killing the planet,&quot; Jensen says. &quot;I think it's very important for us to start to build a culture of resistance, because what we're doing isn't working, clearly.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a3ce3dd83517e6d448694ffc201f56e34e3f57c6","amp;dn":"Democracy+Now+-+15+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3ce3dd83517e6d448694ffc201f56e34e3f57c6","infoHashBuffer":{"type":"Buffer","data":[163,206,61,216,53,23,230,212,72,105,79,252,32,31,86,227,78,63,87,198]},"announce":[],"urlList":[]}}