{"title":"Black.Cock.Addiction.9.XXX.DVDRiP.XviD-VBT ","uid":6092712,"size":2201274068,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a43b7dc5e0b6ead8e5542bf7b50945ab0164d113&amp;dn=Black.Cock.Addiction.9.XXX.DVDRiP.XviD-VBT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kelvin09","files":4,"time":1294631794,"description":"Cover\n\n  &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/2966_1.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/2966_1.jpg.html&lt;/a&gt;\n\n\nScreens\n\n  &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/2965_2.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/2965_2.jpg.html&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/2964_3.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/2964_3.jpg.html&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/2963_4.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/2963_4.jpg.html&lt;/a&gt;\n\n\n\nAurora Snow, India Summer, Rayveness, Rico Strong, Jon Jon, Jaelyn Fox, Kelly Surfer, Julius Ceazher, Tone Capone, D-Snoop, Tori Lux, Mandy Sweet, Jacky Joy, Ruby Rayes, Sean Michaels\n\nIn Black Cock Addiction 9, director Joey Silvera serves up eight scalding-hot scenes of submissive white girls (plus one Latina) going down on dominant dark dicks. But this isn't just any blow job movie - Joey mines the interracial angle,the dom/sub dynamic and his own perverse sense of lust to deliver scenes of nasty imagination. In each scene Joey, from behind his camera, eggs on the action, but arguably does his best work when casting such dirty-minded, sexually uninhibited girls. Joey covers Tori Lux' eyes with a bandana, and it's time to play &quot;Blind Cocksucker's Bluff.&quot; She can't guess the prick even though she's had it before - when she's unmasked the busy slut realizes she'd serviced it as part of a blow bang. An upside-down face-fuck renders her a complete mess, with sloppy spit covering her face and running up her nose. She flashes a satisfied smile through a viscous mess of sperm, spit and mascara. Lovely Aurora Snow tells Joey, &quot;I love big black cock. I love it when it's shoved down my throat just thinking about it, my clit's getting huge.&quot; She manages to deep-throat muscular, hugely hung Rico Strong. Legendary cocksman Sean Michaels, who's had his big, black bone sucked innumerable times, calls the head he gets from raven-haired MILFs RayVeness and India Summer, &quot;amongst the best BJs I've ever had, honestly.&quot; Sean teabags RayVeness and fucks her big boobs; the ladies share a sloppy cum kiss, and RayVeness blows a cum bubble! Spunky blonde Jackie Joy sucks black cocks two-at-a-time - &quot;smack that against my tongue,&quot; she tells one dick-wielding dude, and they trade her mouth back-and-forth. She two-hand-strokes one cum wad onto her tongue; as jism drips from her chin, the dirty girl jerks a second load of juice into her mouth, then slobbers the two-man mess all over her titties. When pretty, sex-addled Jaelyn just can't keep it in her mouth, she rides cock, her pussy cream showing all over her stud's thick, black pole. She massages his balls as he jerks off on her face, then sucks his meat and her fingers clean, breathlessly masturbating. Stud Jon Jon gets to enjoy the mouths of white-skinned, blue-eyed Australian Kelly Surfer and tan Latina Ruby Rayes. When Ruby sucks cock, Kelly licks balls, and Ruby dick-slaps Kelly's face. Kelly goes deep, producing messy gag spit; Ruby kisses up the cum spilled on Kelly. Rough face-fucking and deep-throating strain slutty, submissive Lily LaBeau, conjuring tears and rivers of gag spit that flow down her tits. Lily spits his spunk into her spittoon, then rubs its collected cum and gag spit all over her body and licks the bowl clean. Wallowing in viscous spit and sperm, Lily says, &quot;I love being degraded, just made into a filthy, little whore.&quot; Hazel-eyed brunette Mandy Sweet is a thick chick who stuffs her big boobs, ass and thighs into a tight, iridescent purple outfit. Kneeling for a blow job, Mandy's boobs take a titty-fuck and a cock-slapping. Joey's interracial cocksuckers are like himself: irrepressible.\t","torrent":{"xt":"urn:btih:a43b7dc5e0b6ead8e5542bf7b50945ab0164d113","amp;dn":"Black.Cock.Addiction.9.XXX.DVDRiP.XviD-VBT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a43b7dc5e0b6ead8e5542bf7b50945ab0164d113","infoHashBuffer":{"type":"Buffer","data":[164,59,125,197,224,182,234,216,229,84,43,247,181,9,69,171,1,100,209,19]},"announce":[],"urlList":[]}}