{"title":"Democracy Now - 06 dec 2010","uid":6016609,"size":451274880,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a501775487c89ebd7382f177e445eeae84dfac2b&amp;dn=Democracy+Now+-+06+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1291652734,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 06, 2010\n\n- WikiLeaks' Online Presence Hindered Following U.S. Pressure\n- Leaked Cables Include Extensive Infrastructure List\n- Cables: Despite Doubts, E.U. in Afghanistan &quot;Out of Deference to U.S.&quot;\n- Attorney: Assange Offered to Meet with Prosecutors\n- McConnell: Assange a &quot;High-Tech Terrorist&quot;\n- Al Jazeera Denies Cable Claims of Diplomatic Use\n- GOP Nears Win on Preserving Tax Cut for Wealthiest\n- Unemployment Rate Hits 9.8%\n- Deficit Panel Fails to Back Recommendations\n- Military Leaders Oppose Immediate Repeal of &quot;Don't Ask, Don't Tell&quot;\n- Iran Nuclear Talks Begin in Geneva\n\n\nSpecial reports\n\n- Climate Talks in Jeopardy as Industrialized Nations Threaten Kyoto Protocol\n\nAfter one week, the fate of negotiations at the U.N. Climate Change Conference remains uncertain. At the center of the debate is the future of the Kyoto Protocol, the only treaty that binds almost 40 rich nations to cut their greenhouse gases until 2012. Last week, Japan said it would oppose extending Kyoto unless the U.S. and China also sign on. The United States has long been criticized for never having ratified Kyoto despite being historically the world's largest polluter. We speak to Venezuela's lead climate change negotiator, Claudia Salerno.\n\n\n- Pressing the Silence: At the U.N. Climate Change Conference, the Media Center is Oddly Quiet\n\nAmy Goodman reports from the U.N. Climate Change Conference in CancÃƒÂºn, Mexico, where the media center is eerily quiet. At last year's climate meeting in Copenhagen, the room was buzzing with thousands of reporters. However, today climate change seems to be a forgotten story. Democracy Now! reviewed the transcripts of last week's evening news broadcasts on ABC, CBS and NBC in the United States. The CancÃƒÂºn talks were not mentioned a single time.\n\n\n- Small Farmers Gather for Alternative Global Forum on Climate Change and Social Justice\n\nWhile climate negotiators, NGOs and delegates gather at the walled-off U.N. Climate Change Conference at the plush Moon Palace Hotel in CancÃƒÂºn, Mexico, those who were not invited have organized their own meetings. The international small farmers movement La Via Campesina and other grassroots organizations are holding the alternative Global Forum for Life and Environmental and Social Justice, with participants attending from across Latin America.\n\n\n- WikiLeaks Cables Expose How U.S. Secretly Manipulated Copenhagen Climate Talks, Targeted Bolivia and Venezuela\n\nSecret diplomatic cables released by WikiLeaks have revealed new details about how the United States manipulated last year's climate talks in Copenhagen. The cables show how the United States sought dirt on nations opposed to its approach to tackling global warming, how financial and other aid was used by countries to gain political backing, and how the United States mounted a secret global diplomatic offensive to overwhelm opposition to the &quot;Copenhagen Accord.&quot; We speak to Bolivia's ambassador to the United Nations, Pablo SolÃƒÂ³n. Several of the cables addressed Bolivia's opposition to the U.S.-backed accord.\n\n\n- Fmr. Irish President Mary Robinson Calls for Global Climate Justice Fund\n\nFormer Irish President Mary Robinson was in CancÃƒÂºn this weekend for the U.N. Climate Change Conference. Robinson talked about the need for a global climate fund that will help poor people protect themselves from the growing threats of global warming. Robinson is the honorary president of Oxfam International. She recently launched the Mary Robinson Foundation - Climate Justice.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a501775487c89ebd7382f177e445eeae84dfac2b","amp;dn":"Democracy+Now+-+06+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a501775487c89ebd7382f177e445eeae84dfac2b","infoHashBuffer":{"type":"Buffer","data":[165,1,119,84,135,200,158,189,115,130,241,119,228,69,238,174,132,223,172,43]},"announce":[],"urlList":[]}}