{"title":"Pokeporn v1.8 - Gary Oak !ArcHIvEpAQ","uid":6107444,"size":2024983695,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:a5285264944d19646a3af345c3c04dc105a914c3&amp;dn=Pokeporn+v1.8+-+Gary+Oak+%21ArcHIvEpAQ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GaryOakar","files":8173,"time":1295216867,"description":"Pokemon Porn archive v1.8\n\nOkay TPB and/or /vp/, v1.8 is up, and that means that v1.7 is no longer supported, and I am no longer seeding it. ZekuMusashi has said that his computer has crashed from the sheer number of files loaded (However, he does note this he has a shitty computer) so DDLs can be found here.\n\nPokemon\n\nPokegirls\n\nPLEASE SEED!\n\n---\nReadme\n\nAt the time of this finalized version, the Archive has been downloaded 7,021 times. (Lets shoot for 10,000! downloads before v1.9!)\n\nName: -------- Gary Oak !ArcHIvEpAQ\nEmail: ------- &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ca8dabb8b385aba19eb8a3baacabad8aada7aba3a6e4a9a5a7&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nTwitter: -----\n\n---\nDisclaimer\n\nI, Gary Oak !ArcHiVe/T2, am not responsible for how the contents of this Archive are used. I will STRONGLY suggest for personal use only and to never post new porn threads on /vp/ with this material or any porn in general. This was designed to lower the number of porn threads by finally giving everyone all the porn they would ever need or find. PLEASE. DO. NOT. POST. THREADS.\n\nYou may copy and paste links into threads to end them. There's no need to clog up the front page.\n\n---\nIntroduction\n\nHello! Its Gary here to thank you for dl'ing this archive, everything is named and sorted (mostly), but don't expect the sorting to be perfect. I'm only human! I haven't been able to sort EVERYTHING, so if something is in the wrong place, I'm sorry. There's a lot of stuff in here, so don't be daunted by it. There should be more than enough for your average anon. If you can fap to all of this in a month, then you are a legend.\n\nIf you want to help me distribute the archive. Copy and paste relevant links into a porn thread and sage. That IS the point of this, to reduce new porn threads by distributing porn to everyone so there is no need for new threads. You can find them on my twitter, or you can always copy the links from the thread into a text document.\n\n---\nFAQ\n\nQ: Why is there no gay?\nA: I am not gay. And I do not wish to save it. If you want to make one, I'll be happy to support\nit through seeding/uploading/whatever. But for now I'd rather not.\n\nIf you find any in the Archive, email me the folder and number of the picture, and It'll be gone \nfor the next version.\n\nQ: Something is in the wrong place!\nA: Sorry about that, I have tried to organize them, but the sheer number of them prevents me from\nactually going through all of them. I've tried to sort them a bit better, but you can't expect all\ntoo much when there's 8000+ pictures.\n\nQ: Why is there so much shit in this?\nA: I've made an attempt to get rid of all the REALLY bad art. You can have your own opinions on it but if you hate it so badly, why not just delete it yourself?\n\nQ: When do you make threads?\nA: Whenever I feel like it, I stopped posting on a schedule since the Janitor and bombers knew when the post times are. So I've decided to go rouge and make a thread when I feel like it, but \nit won't be daily.\n\nQ: Why is there a lot of X pokemon/character compared to Y pokemon/character?\nA: Some pokemon/characters just don't have that much porn. Sorry bro.\n\nQ: I keep posting but I sometimes accidentially forget to spoiler? wat do?\nA: First, don't panic. click the check mark next to your post and scroll down and press delete. You will have to wait a few seconds before you are allowed to delete your post, I believe the time is around 45-60 seconds.\n\nQ: Will there be a new thread after the first one hits image limit?\nA: Depends. If there's a lot of people who say yes, I'll go for it. If there happens to be a large amount of spam, then no. I'd rather not go through the trouble.\n\nQ: Why isn't there a new archive yet? It's already been a few weeks.\nA: Because I'm incredibly busy. And I don't want to stare at porn all day sometimes.\n\nQ: Why is there Renamon in the Archive?\nA: It's mostly a joke, but if you are a furfriend why do you care? \n\nQ: Can I have some of your real contact info?\nA: NOPE! Other than what I listed above, I'm not going to have random anons interfere with my personal life. If you want to find out more about me, don't bother. The emails, twitter, and anything else is unrelated to me. Besides, it's more than enough to contact me.\n\nQ: Gary? Posting porn?\nA: Yes, it's called irony.\n\nQ: OP is a fag.\nA: Sure.\n\nQ: What can I do to help?\nA: Spoiler all your porn, don't spam, be polite, and if there's a conversation, you \nare welcome to join.\n---\nUseful Tools\n\nVisipics: The most used tool in my arsenal, it finds and sorts similar pictures for deletion.\nLink: http://www.visipics.info/index.php?title=Download\n\nBulk Renamer: Renames files and folders en masse.\nLink: http://www.bulkrenameutility.co.uk/Main_Intro.php\n\n/b/rowser: A neat tool that allows you to browse a whole board. You can find updates on /rs/ by looking it up there.\nLink:\n\nZoomify 4chan: A nice Chrome extension that includes thread hiding, remove XXX, spoiler preview quick reply and more.\nLink: https://chrome.google.com/extensions/detail/pinelipedelckihohgdlpcclgocodhjj\n\n4chanX: The offical 4chan Addon for Firefox. Includes many of the same features in Zoomify. Requires Greasemonkey.\nLink: http://userscripts.org/scripts/show/51412\n---\nThanks To\n\nKeith, qnqnx, Trainer With a Mouth, Sofa, Pornodex Guy, +18 Pokegirls Anon, Poke_0X Anon, Dahmer, all bombers, all the various furfags and pokegirlfags who contributed to this project, and of course. You for downloading.\n\n\nEnjoy!\n\nAnd CATCH A RIIIIIIDE!","torrent":{"xt":"urn:btih:a5285264944d19646a3af345c3c04dc105a914c3","amp;dn":"Pokeporn+v1.8+-+Gary+Oak+%21ArcHIvEpAQ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5285264944d19646a3af345c3c04dc105a914c3","infoHashBuffer":{"type":"Buffer","data":[165,40,82,100,148,77,25,100,106,58,243,69,195,192,77,193,5,169,20,195]},"announce":[],"urlList":[]}}