{"title":"Cyber Update Des.2010--------DB-11227 SloaneSoleil","uid":6080577,"size":814564705,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a56977f23cb7c0cd8aeb0e560d75ab7e6df1c02c&amp;dn=Cyber+Update+Des.2010--------DB-11227+SloaneSoleil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":299,"time":1294099637,"description":"From Kink.com   ( Device Bondage )  + Pics\n\n\n\n\nI cram this object with a mouth and tits into a cage. She is bound in a single position using bars and straps with her hair tied back. Her smooth milky skin make for a sensitive surface to be tested with clips, especially the neck. I can her ass and tits just before bowing the cane as a bit gag keeping her mouth tight and opened. Before I'm done with her I shove my fingers in her wet cunt and steal her orgasms. \n\nNow that this toy is broken in, it's time to put it to the test. She is mounted to the wall. Head wrapped and left breathing through a tube. A little breath play and some pussy flogging before I rip out the hose exposing those cock thirsty lips. I thrust and lock a cock and vibe into her throbbing cunt. Then I unleash a lashing of hard floggings and canings on those vulnerable tits and that sensitive pussy. Then I leave her breathless with some heavy handed smacks to chest and abdomen to interrupt her vibrator destroying orgasms. \n\nFace down ass up, neck and hips locked, legs spread, this pussy is ready to be pulverized by the fiercest fucking machine that exists. But first, this toy needs to learn to process some hard foot caning. To distract her from the stress of the position I apply the clover clamps on her much abused nipples. This machine can only bring out the best of orgasms that combines the sincerity of screams with the vulgar outcries of involuntary orgasms. I love my job.\n\n\n\nScreens &lt;a href=&quot; http://www.devicebondage.com/site/shoot.jsp?shootId=11227&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.devicebondage.com/site/shoot.jsp?shootId=11227&lt;/a&gt;\n\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:a56977f23cb7c0cd8aeb0e560d75ab7e6df1c02c","amp;dn":"Cyber+Update+Des.2010--------DB-11227+SloaneSoleil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a56977f23cb7c0cd8aeb0e560d75ab7e6df1c02c","infoHashBuffer":{"type":"Buffer","data":[165,105,119,242,60,183,192,205,138,235,14,86,13,117,171,126,109,241,192,44]},"announce":[],"urlList":[]}}