{"title":"Anal Buffet 5 (2010) ","uid":6073280,"size":2932051968,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a57c2f73b44668f48e2981e4d80c08bfbc8856d3&amp;dn=Anal+Buffet+5+%282010%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":4,"time":1293716903,"description":"Anal Buffet 5 (2010) \n &lt;a href=&quot;\nhttp://www.excaliburfilms.com/AdultDVD/826538D5_Anal_Buffet_5_dvd.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.excaliburfilms.com/AdultDVD/826538D5_Anal_Buffet_5_dvd.htm&lt;/a&gt; &lt;a href=&quot;\nhttp://e.orgazmik.com/film/detail/7271584.htm?RID=ADT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://e.orgazmik.com/film/detail/7271584.htm?RID=ADT&lt;/a&gt; &lt;a href=&quot;\nhttp://www.sugardvd.com/browse/dvd/details/194585/?refaff=13335&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sugardvd.com/browse/dvd/details/194585/?refaff=13335&lt;/a&gt; &lt;a href=&quot;\nhttp://www.bargainadultdvd.com/action/product.asp?product=1556031&amp;partner_id=10008495&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bargainadultdvd.com/action/product.asp?product=1556031&amp;partner_id=10008495&lt;/a&gt;\n\nStudio \tEvil Angel\nRelease Date Dec 23, 2010\nCategory All Sex, Anal, Toy Play\nDirector Jay Sin\nStarring Alexis Texas, Tori Black, Roxy, Kid Jamaica, Omar Galanti, Alysa, Isabel Clark, Anita Hengher, Sexy, Lioness, Markus, Henessy, Cler, Wildassholeslut\n\nJay Sin's Anal Buffet 5 continues the Sin tradition of creative anal perversions, with plenty of girl-on-girl ass-licking and massive sex toys as well as big-dicked sodomy and anal gaping. We begin with the American beauties: brunette stunner ...    Full DescriptionTori Black and heroically proportioned blonde Alexis Texas, who go at each other with an escalating series of anal invasions, using toys and tongues to expand their backdoor horizons. Fans of Jay's anal-lesbian niche will find plenty to explore, watching Alexis get off while her huge, sumptuous ass is plowed with a big, red sex toy, then rimmed deeply by lovely Tori. In perhaps the most strangely compelling scene, lollipop-licking teen Henessy uses a massive, clear vacuum pump to suction her cunt three sizes larger. It even pulls a variety of sex toys out of her engorged pussy, and is put to even nastier use when Euro-stud Kid Jamaica primes her puffy asshole for his large black cock. A truly perverse session of boundary-testing butt play ends with a classic cum facial. Next, inventively twisted brunette Anita Hengher teases us with pussy and ass insertions before being joined by fishnet-wearing brunette Roxy. The girls enjoy the full-bodied flavor of female ass, then are joined by two well-hung butthole bangers who take this dirty foursome to the next level of hell (or heaven)! Anita gets double-penetrated and takes a load in the face from each stud. Not to worry - Roxy helps with the cleanup. When we meet sultry brunettes Lioness and Cler, they could almost be sisters, dressed in animal prints and greasing up their asses before they mouth-fuck each other's flowering bungholes and jam a large, black toy up Cler's backdoor. Bald beast Omar Galanti joins the oral jamboree and plows his fat cock up these sluts' rectums. The filthy brute dumps his load on their pretty faces. We see pale goth slut Isabel Clark in a flowing white dress, which she uses, as a sex toy by dousing it with baby oil. After enticing us with butt-flossing tricks and stuffing a yard of greasy dress fabric up her anus, she takes on a pair of big-dicked black invaders who actually fuck Isabel's yawning asshole at the same time! She even gets a second double-ass reaming by a second duo who take over after the black guys have splattered Isabel's face with spunk. This girl has an amazing capacity! Finally, the DVD includes a bonus scene with sexy Alysa, fast becoming a legend for her incredible anal acrobatics. Alysa partners with slim Romanian beauty Wildassholeslut, no slouch herself in the colonic (and naming) department. The girls are joined - literally - by a massive, double-headed rubber dildo the size of a komodo dragon, which invades and stretches their buttholes to new and exciting dimensions. \n","torrent":{"xt":"urn:btih:a57c2f73b44668f48e2981e4d80c08bfbc8856d3","amp;dn":"Anal+Buffet+5+%282010%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a57c2f73b44668f48e2981e4d80c08bfbc8856d3","infoHashBuffer":{"type":"Buffer","data":[165,124,47,115,180,70,104,244,142,41,129,228,216,12,8,191,188,136,86,211]},"announce":[],"urlList":[]}}