{"title":"The Cure - Other Voices (2nafish)","uid":6076319,"size":152678404,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a58d99e235d9771b1ae597c3a2d36a18a0947d03&amp;dn=The+Cure+-+Other+Voices+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1293879199,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nFaith is the third album by British band The Cure, released in April 1981.\n\nFaith is generally a brooding, atmospheric, and sombre album, although it has a flash of anger in the form of the song &quot;Doubt&quot;, and some edge in the driving single &quot;Primary&quot;. It is often seen as the mid-point in a 'Dark Trilogy' that begins with Seventeen Seconds and ends with Pornography. One of the songs on the album, &quot;The Drowning Man&quot;, is inspired by the Gormenghast novels of Mervyn Peake.\n\nIt is the first album by The Cure to feature baritone guitar/six-string bass. The front cover, designed by future member Porl Thompson, is a picture of Bolton Priory in the village of Bolton Abbey in the fog.\n\nFaith was reissued in the UK on 25 April 2005 (26th in the U.S.) as part of Universal Music's Deluxe Edition series. The new edition features a remastered version of the album and the &quot;Carnage Visors&quot; soundtrack on disc one, while disc two contains demo and live tracks, as well as the non-album single &quot;Charlotte Sometimes&quot;. It features a few never-before-heard tracks (in demo form, all instrumentals) while each song on the first disc (except &quot;Carnage Visors&quot;) has an alternate version on the second disc, whether it be a demo or live rendition.\n\nThere also exists a one-CD reissue. It was released on 5 September 2005 in the UK and 4 April 2006 in the US. The CD, released in the standard jewel case, rather than a digipak, features the original album, but does not contain the bonus disc. It also excludes the song &quot;Carnage Visors&quot;.\n\nThe Cure are an English rock band formed in Crawley, West Sussex in 1976. The band has experienced several line-up changes, with frontman, vocalist, guitarist and principal songwriter Robert Smith being the only constant member. The Cure first began releasing music in the late 1970s with their debut album Three Imaginary Boys (1979); this, along with several early singles, placed the band as part of the post-punk and new wave music that had sprung up in the wake of the punk revolution in the United Kingdom. During the early 1980s, the band's increasingly dark and tormented music helped form the gothic rock genre.\n\nAfter the release of Pornography (1982), the band's future was uncertain and Smith was keen to move past the gloomy reputation his band had acquired. With the 1982 single &quot;Let's Go to Bed&quot; Smith began to inject more of a pop sensibility into the band's music. The Cure's popularity increased as the decade wore on, especially in the United States where the songs &quot;Just Like Heaven&quot;, &quot;Lovesong&quot; and &quot;Friday I'm in Love&quot; entered the Billboard Hot 100 chart. By the start of the 1990s, The Cure were one of the most popular alternative rock bands in the world. The band is estimated to have sold 27 million albums as of 2004. The Cure have released thirteen studio albums and over thirty singles during the course of their career.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a58d99e235d9771b1ae597c3a2d36a18a0947d03","amp;dn":"The+Cure+-+Other+Voices+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a58d99e235d9771b1ae597c3a2d36a18a0947d03","infoHashBuffer":{"type":"Buffer","data":[165,141,153,226,53,217,119,27,26,229,151,195,162,211,106,24,160,148,125,3]},"announce":[],"urlList":[]}}