{"title":"Rakht charitra (2) 500mb x264 DVDScr-Rip ESuBs - Reaper","uid":6049392,"size":525112926,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a59a1b4eed039994b5148bee24f7a67a0ccbcbc8&amp;dn=Rakht+charitra+%282%29+500mb+x264+DVDScr-Rip+ESuBs+-+Reaper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TamilCreation","files":3,"time":1292670505,"description":"\n[img]http://www.shotpix.com/images/67869910393350118761.gif[/img]\n\nRakht charitra (2) 500mb x264 DVDScr-Rip ESuBs - Reaper\n\n[url=http://www.shotpix.com/][img]http://www.shotpix.com/images/42911132515461695950.jpg[/img][/url][url=http://www.shotpix.com/][img]http://www.shotpix.com/images/35228979152833589826.jpg[/img][/url][url=http://www.shotpix.com/][img]http://www.shotpix.com/images/11980375295306900037.jpg[/img][/url][url=http://www.shotpix.com/][img]http://www.shotpix.com/images/52806271565070643479.jpg[/img][/url][url=http://www.shotpix.com/][img]http://www.shotpix.com/images/20293347198711232511.jpg[/img][/url][url=http://www.shotpix.com/][img]http://www.shotpix.com/images/27467789202131451417.jpg[/img][/url][url=http://www.shotpix.com/][img]http://www.shotpix.com/images/14456529881642262893.jpg[/img][/url][url=http://www.shotpix.com/][img]http://www.shotpix.com/images/79044337846996126710.jpg[/img][/url][url=http://www.shotpix.com/][img]http://www.shotpix.com/images/93066849630711735839.jpg[/img][/url][url=http://www.shotpix.com/][img]http://www.shotpix.com/images/09179176149530293409.jpg[/img][/url]\n\nPLOT:\n\nThe first twenty minutes show a recap of part 1, such as the events of how Prathap Ravi(Vivek Oberoi) takes revenge on the murder of his father and brother as well as how he came to power. When no one in Andhra has the courage to stand up against Ravi, a man comes into light by seeking revenge on Prathap. Surya Narayanareddy (Suriya Sivakumar) is seen waiting in the woods near the main road waiting for Prathap Ravi and hurls a bomb in his convoy. Unfortunately for Surya, Prathap Ravi escapes from the bomb blast. Pratap Ravi's henchmen follow Surya to kill him but Surya escapes from them.\nSurya informs his wife that he missed the chance of killing Prathap Ravi. Meanwhile the media people ask Prathap whether this attempt is a revenge by Surya for the TV bomb placed in Surya's home by Prathap himself. Prathap Ravi denies the charge. Shivaji Rao questioned Prathap to stop this vengeance but Prathap insists on wanting to kill Surya. Prathap orders his action team to kill each and every one who is opposite him. DCP Mohan Prasad starts to investigate this case and he finds Bhavani(Priyamani), wife of Surya, and he demands Surya to surrender unless he will harm his wife and baby son Arya. Surya thinks that he has missed a great chance and another chance will not come so easily and decides to surrender for protection and make a plot to kill Prathap Ravi. DCP Mohan Prasad decide to produce Surya in court for legal conviction. Prathap Ravi send a henchmen to kill Surya in court itself, but Surya manages to fight against him and kills the henchman in front of judge. Surya is sent to prison.\nPrathap Ravi decides to kill Surya inside the jail, while planning carefully, he decides someone from outside their camp should do this, in order for the police to not suspect them. In prison Surya befriends Muddu Krishna by revealing his flashback. The flashback shows that after Prathap Ravi's attempt of killing Narasimha Reddy (Kitty), Surya's brother wants to revenge Ravi. Surya, on the other hand, doesn't want to take revenge straight away, and tells him to be patient and to leave the matter as it is, as he doesn't want to put his mother and sister in any danger. Within few months Surya total family is killed in the TV bomb blast. After hearing the flashback, Muddu Krishna decides to be with Surya in killing Ravi. The henchmen in prison try to kill surya but Surya assaults them back. After this failure Prathap Ravi is warned by Shivaji Rao. As a result, Prathap Ravi decides that he wants to stop this revenge and he meets Surya. In jail, Ravi tells Surya to stop this bloodshed, when Surya promptly replies &quot;I'll surely stop - after killing you&quot;. Prathap thinks he can't do anything because he is in jail, which makes him defenceless.\nEnters Krishnaswamy, the opposite Party leader, who decides to meet Surya. He says that to kill Ravi, Surya has to become a bigger name in Anantpur than Ravi. Krishnaswamy requests Surya to ask his wife to stand in election. Surya convinces Bhavani to stand in election. This made Ravi to fear for his life and also for his ministry post, consequently his henchmen want to eliminate Bhavani but Nandhini(Radhika Apte) pleads Ravi not to kill Bhavani, causing Ravi to cancel the plan. However, already one of Ravi's closest gang member, Umapathy, is sent to kill bavani. Muddu Krishna kills Umapathy and saves Bhavani. Krishnaswamy comes to prison to thank Surya, and Surya replies that he also needs to say thank you.\nA feared Prathap organises a meeting involving the leaders of all the states of India. Knowing this, Surya designs a plan to kill Prathap. He recalls that in the meeting, all the leaders will participate with their bodyguards. He orders Muddu Krishna to dress like a bodyguard since no one would be able to identify whose bodyguard belongs to whoever. Using this ambiguity Surya's henchmen can kill Ravi. After the meeting comes to end, Ravi plans to leave. As he was leaving, he saw a familiar face and was struck. He sees Surya, standing infront of him with his handgun. Surya fires at Prathap until he dies in a pool of blood. Surya's friends put teargas and creates panic and invisibility, and using this, Surya escapes from the scene and returns to the prison. Nandhini cries by hugging her dead husband Prathap Ravi.\nMuddu Krishna takes the blame for killing Prathap Ravi for Surya. DCP Mohan Prasad comes to meet Surya in jail and justifies why Ravi became a factionist. It was the circumstances that made Ravi as a factionist. He addes to Surya that the same circumstances will change him into a Ravi. Surya finally says &quot;Thank you, but I wont be change into another Ravi&quot;. The movie ends with the birth of Prathap Ravi's child. This shows at least the factionism must end in this generation else it will be an uncontrolled chain reaction.\nThe main message in Rakht Charitra is &quot;An Eye for an Eye and Tooth for a Tooth will make this world blind&quot;\n\nFile size                        : 501 MiB\nWidth                            : 688 pixels\nHeight                           : 320 pixels\nDisplay aspect ratio             : 2.2:1\n\nAudio Format                      : AAC\nChannel(s)                       : 2 channels\nChannel positions                :Front: L R\n\n\n\nRipper : Reaper\n\n &lt;a href=&quot;\nhttp://www.tamilcreation.com/forum/showthread.php?77009-Rakht-charitra-(2)-500mb-x264-DVDScr-Rip-ESuBs-Reaper&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tamilcreation.com/forum/showthread.php?77009-Rakht-charitra-(2)-500mb-x264-DVDScr-Rip-ESuBs-Reaper&lt;/a&gt;","torrent":{"xt":"urn:btih:a59a1b4eed039994b5148bee24f7a67a0ccbcbc8","amp;dn":"Rakht+charitra+%282%29+500mb+x264+DVDScr-Rip+ESuBs+-+Reaper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a59a1b4eed039994b5148bee24f7a67a0ccbcbc8","infoHashBuffer":{"type":"Buffer","data":[165,154,27,78,237,3,153,148,181,20,139,238,36,247,166,122,12,203,203,200]},"announce":[],"urlList":[]}}