{"title":"Shawn Colvin - Live '88 [FLAC]","uid":6209459,"size":228069313,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a5b7ec504cc9396b6dfd352744c94b64f053982b&amp;dn=Shawn+Colvin+-+Live+%5C%2788+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"calinet6","files":12,"time":1298927960,"description":"Recorded prior to her Columbia signing, Colvin once supported herself by selling copies of this superb acoustic collection of material that would emerge on the Steady On and Fat City albums. The stark setting naturally highlights both the artist's gorgeous voice and songs like &quot;Diamond In The Rough&quot; or &quot;I Don't Know Why&quot; in such a pure, heart-rending way that it can never be captured in the studio. A rare and unexpected treat for Colvin devotees. --Jeff Bateman\n\nThrough a special arrangement with Columbia Records we are able to bring to you Shawn's rare, classic solo live recording, previously available only at Shawn's early gigs. The original has become a genuine collector's item among her many fans. Includes brilliant performances of some of the best songs from her Columbia Records releases Steady On (A Grammy winner)and Fat City, in addition to several never-before-released tracks.\n\n---\n\nNotes from me: This has to be one of the most real, vibrant, and emotional live folk albums ever recorded. Recording and mastering quality is excellent and well worth the FLAC download. Enjoy!","torrent":{"xt":"urn:btih:a5b7ec504cc9396b6dfd352744c94b64f053982b","amp;dn":"Shawn+Colvin+-+Live+%5C%2788+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5b7ec504cc9396b6dfd352744c94b64f053982b","infoHashBuffer":{"type":"Buffer","data":[165,183,236,80,76,201,57,107,109,253,53,39,68,201,75,100,240,83,152,43]},"announce":[],"urlList":[]}}