{"title":"Adolph Eichman Secret memoires 2002 (TinkerBell) TBS","uid":6059439,"size":4439163428,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a5e14a43074fa3a2ff997a62f76d386b41fe34dc&amp;dn=Adolph+Eichman+Secret+memoires+2002+%28TinkerBell%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Mad_Parrot","files":-1,"time":1293050176,"description":"[IMG]http://i1215.photobucket.com/albums/cc514/JolieRouge1/Film%20posters/Adolf_Eichmann_DUTCH_R2-front-wwwFreeCoversnet.jpg[/IMG]\n\n\n\n\nAdolf Eichmann - Geheime Memoires  2002     \n \n \nHij was verantwoordelijk voor de moord op zes miljoen Joden, maar veertig jaar na zijn executie blijft hij nog steeds een mysterie. Hoe kwam deze middelmatige vertegenwoordiger aan zoveel macht binnen de SS? Wat dreef hem? Wat was het geheim voor zijn succes? Wie was de echte Adolf Eichmann?\n\nDe geheime memoires van Adolf Eichmann betreffen niet alleen een diepteprofiel van ÃƒÂ©ÃƒÂ©n man. Geschoten in heel Europa, is dit de eerste documentaire die Eichmanns omgeving openbaart en inzicht geeft in de tragedie van de 'Final Solution' vanuit de betrokkenen, de moordenaars zelf.\n\nDe geheime memoires zijn grotendeels gebaseerd op de recent verschenen geheime dagboeken en geven voor de eerste maal in de geschiedenis een uniek inzicht in zijn motieven en innerlijke gedachten. Eichmann zet uiteen hoe hij het 'Eichmann-systeem' perfectioneerde dat direct leidde naar de gaskamers.\n\nDe documentaire geeft tevens inzicht in de recent ontdekte materialen uit de Duitse Stasi-archieven en nooit eerder vertoonde beelden. Hij bevat interviews met mensen die Eichmann ontmoet hebben, zoals zijn Joodse kok die hem een kind zag vermoorden, Teddy Kollek die met hem onderhandelde in Wenen, Eli Wiesel die Eichmann de transporten naar de dood zag inspecteren en de gevangenisbewaker die hem heeft opgehangen.\n\nEngels:\n\nAlthough Eichmann was responsible for implementing the &quot;Final Solution&quot; which led to the deaths of over 5 million Jews, 40 years after his execution, he still remains an enigma. How did this simple and unsuccessful salesman rise to power in the SS and Nazi regime? What motivated him? What inspired him? This film looks at Eichmann the man, parallel to Eichmann the Nazi who invented the &quot;Eichmann System&quot;. \nThe &quot;Eichmann System&quot;, which was based on lies and deceit, led millions to their extermination in his gas chambers. For the first time, Eichmann's story is portrayed through his own eyes. He reveals how the system operated and how he felt implementing it. EICHMANN - THE SECRET MEMOIRS is not just an in - depth profile of one man\n\n\n\nSpotinformatie\n \nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nAudio         : Nederlands\nOndertitels   : Nederlands (instelbaar) Engels (instelbaar)\nCover         : Ja\nGenre         : Documentaire\n  &lt;a href=&quot;\nhttp://www.google.nl/search?hl=nl&amp;q=Adolf+Eichmann+-+Geheime+Memoires&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.nl/search?hl=nl&amp;q=Adolf+Eichmann+-+Geheime+Memoires&lt;/a&gt; \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1172948/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1172948/&lt;/a&gt;\n \n\nBrought to you by TinkerBell @ TBS\n \n","torrent":{"xt":"urn:btih:a5e14a43074fa3a2ff997a62f76d386b41fe34dc","amp;dn":"Adolph+Eichman+Secret+memoires+2002+%28TinkerBell%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5e14a43074fa3a2ff997a62f76d386b41fe34dc","infoHashBuffer":{"type":"Buffer","data":[165,225,74,67,7,79,163,162,255,153,122,98,247,109,56,107,65,254,52,220]},"announce":[],"urlList":[]}}