{"title":"DAZ.Productions.DAZ.Studio.Advanced.Edition.v3.1.2.19.x86.","uid":5966803,"size":131386877,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a60a7a2e57e2fd80c29b45fbcc3aa9cf57f58257&amp;dn=DAZ.Productions.DAZ.Studio.Advanced.Edition.v3.1.2.19.x86.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BLACKTROY","files":-1,"time":1290130649,"description":"DAZ Studio Advanced provides advanced hobbyists and professional artists with the features needed to bridge the gap between art and reality. This is accomplished with added render enhancements allowing the artist to control the how, what, and where of rendering. These enhancements in combination with new features will have you rendering like never before. New features include; Figure Mixer, Morph Follower, Shader Builder, Shader Mixer, Shader Baking, aniMate Lite, Map Transfer, and 64-Bit capabilities.\n\nWhat's Included &amp; Features\nDAZ Studio 3 Advanced\nAdvanced Shaders and Effects - DAZ Studio now includes HDRI, IBL, Ambient Occlusion, Area Lights, Volumetrics, Velvet, Indirect Lighting, Translucency, Layered Anisotropic Specularity, and Sub-Surface Scattering. Special thanks to omnifreaker. \nUberEnvironment 2 (by: omnifreaker) \nImage Based Lighting (IBL) \nHigh Dynamic Range Images (HDRI) \nGlobal Illumination (GI) \nIndirect Lighting \nColor Bleeding \nAmbient Occlusion\nUberSurface (by: omnifreaker) \nSub-Surface Scattering (SSS) \nVelvet \nSkin \nLayered Anisotropic Specularity (hair)\nUberArea Lights (by: omnifreaker) \nUberVolume [Fog/Smoke] (by: omnifreaker)\nScripted Renderer - Gain full control of the rendering process. If you're into scripting and are familiar with the RenderMan API, this is for you.\nShader Mixer (Advanced Material Editor) - Mix and match over 90 included shader bricks (or design your own) to create custom lights, cameras, and surfaces within a simple node network for amazing render effects.\nFigure Mixer - Now you can blend between different figures to create your own unique figures. This tool will not only blend two or more shapes together, but it will also provide a working joint rig and preserve the original morphs of the figure you started from. \nMorph Follower - This feature allows you to add support for new figures in old clothing by automatically creating new morphs to fit an unsupported shape. \n64-Bit for Windows - This functionality not only makes things go faster, it expands memory support, and allows large scenes to be arranged and rendered much easier.\nMap Transfer - This allows you to convert a texture from one figure's UV's so they can be used on another figure's UV's.\nShader Builder - Built for advanced artists who need a deeper level of control and want to create shaders from scratch. \nShader Baker - Bake surface shaders, bump maps, displacement maps, and textures into a single image-based texture for a final-render look straight out of the box. You can then share or sell to other users who may not have the same advanced shaders you use to make it look its best.\nAnimation Keyframe Editor - Now you can easily see where your keyframes are. Add, delete, copy, paste and/or move your keyframes around with great visual feedback. Special thanks to GoFigure!. \n","torrent":{"xt":"urn:btih:a60a7a2e57e2fd80c29b45fbcc3aa9cf57f58257","amp;dn":"DAZ.Productions.DAZ.Studio.Advanced.Edition.v3.1.2.19.x86.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a60a7a2e57e2fd80c29b45fbcc3aa9cf57f58257","infoHashBuffer":{"type":"Buffer","data":[166,10,122,46,87,226,253,128,194,155,69,251,204,58,169,207,87,245,130,87]},"announce":[],"urlList":[]}}