{"title":"Carancho[HDRip][Castellano]","uid":6054649,"size":1936875520,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a6e3422694b7b77cab4571d31b436bce8a2e8c7a&amp;dn=Carancho%5BHDRip%5D%5BCastellano%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"erato99","files":1,"time":1292857432,"description":"Titulo Original: Carancho \nCalidad de video: HD Rip\nPeso: 1800 mb\nIdioma del audio: EspaÃƒÂ±ol \n\nEn Argentina mueren al aÃƒÂ±o en accidentes de trÃƒÂ¡nsito mas de 8 mil personas, un promedio de veintidÃƒÂ³s por dÃƒÂ­a; mÃƒÂ¡s de ciento veinte mil resultan heridas. La ÃƒÂºltima dÃƒÂ©cada ha dejado 100 mil muertos. Los millones de pesos que necesitan las vÃƒÂ­ctimas y sus familiares para afrontar gastos mÃƒÂ©dicos y legales, producen un enorme mercado, sostenido por las indemnizaciones de las aseguradoras y la fragilidad de la ley. DetrÃƒÂ¡s de cada desgracia asoma la posibilidad de un negocio.\n\nSosa, es un abogado especialista en accidentes de trÃƒÂ¡nsito, a punto de recuperar su matrÃƒÂ­cula. Se mueve entre guardias de hospitales, servicios de emergencias y comisarÃƒÂ­as en busca de posibles clientes. Ahora trabaja para una fundaciÃƒÂ³n de ayuda a las vÃƒÂ­ctimas que en realidad es la pantalla de un turbio estudio jurÃƒÂ­dico. Sosa consigue los clientes, los testigos, las pericias; arregla con la policÃƒÂ­a, los jueces, las aseguradoras.\n\nLujÃƒÂ¡n es una joven mÃƒÂ©dica reciÃƒÂ©n llegada a la ciudad, que trabaja en mÃƒÂºltiples lugares: ambulancias, guardias de hospitales, servicios de emergencias. Sola, con un ritmo de trabajo que apenas le permite dormir, se enfrenta a un mundo que desconoce.\n\nEsta historia de amor comienza la noche en que LujÃƒÂ¡n y Sosa se conocen, en la calle. Ella tratando de salvar la vida de una accidentado, ÃƒÂ©l tratando de convertirlo en su cliente. Juntos, intentarÃƒÂ¡n modificar el rumbo de sus vidas, pero el pasado turbulento de Sosa se interpondrÃƒÂ¡.\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:a6e3422694b7b77cab4571d31b436bce8a2e8c7a","amp;dn":"Carancho%5BHDRip%5D%5BCastellano%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6e3422694b7b77cab4571d31b436bce8a2e8c7a","infoHashBuffer":{"type":"Buffer","data":[166,227,66,38,148,183,183,124,171,69,113,211,27,67,107,206,138,46,140,122]},"announce":[],"urlList":[]}}