{"title":"Charlie St. Cloud (2010) DVD (dutch subs)NLT-Release","uid":6007705,"size":4440064951,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a6f71cdaa6ecd0394fa8213e5601127f1300582a&amp;dn=Charlie+St.+Cloud+%282010%29+DVD+%28dutch+subs%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1291372314,"description":"Charlie St. Cloud (2010) DVD (dutch subs)NLT-Release\n\n[img]http://img839.imageshack.us/img839/8981/charliestcloud0.jpg[/img]\n\n[url=http://www.moviemeter.nl/film/62746]Moviemeter[/url]\nVerenigde Staten / Canada\nDrama\n99 minuten\ngeregisseerd door Burr Steers\nmet Zac Efron, Kim Basinger en Amanda Crew\nEen aangrijpende film onder geregisseerd door Burr Steers gebaseerd op het boek &quot;The Death and Life of Charlie St. Cloud&quot; van Ben Sherwood.\n\nWat gebeurt er na een ongeluk als twee broers gezworen hebben elkaar nooit te zullen verlaten, maar de paramedici slechts ÃƒÂ©ÃƒÂ©n van de twee kunnen redden? Het was deze vraag die schrijver Ben Sherwood zich stelde voordat hij The Death and Life of Charlie St. Cloud schreef. Het boek werd in vijftien talen vertaald en ontving positieve recensies. Dat er ooit een verfilming aan zat te komen, was dan ook geen al te grote verrassing: het emotionele verhaal over de sterke band tussen twee broers, leent zich uitermate goed voor het grote scherm. En zo ontstond de verfilming Charlie St. Cloud. \nPubliekstrekker in deze film is hoofdrolspeler Zac Efron, met wie Burr Steers eerder al samenwerkte. Wat leuk is aan de film, is dat er een verrassing in zit, iets waardoor de kijker op het verkeerde been wordt gezet. Dit maakt de film interessant en niet al te voorspelbaar. Al met al een vermakelijke film met prachtige beelden en een emotionele verhaal met hoogte en dieptepunten.\nEen studiebeurs voor Stanford, een enorm zeiltalent, een prachtige toekomst in het vooruitzicht, vrienden, familie, ooit was het in zijn bezit. Vijf jaar na het op miraculeuze wijze overleefde ongeluk leeft Charlie echter niet het leven waar hij voor het ongeluk van droomde: werkzaam op het kerkhof waar zijn broertje begraven is, terwijl zijn zeilboot in de opstal staat. En dan die ooit gemaakte belofte om elke dag met zijn broertje basebal te oefenen... Elke dag na zonsondergang verschijnt Sam om met Charlie, zoals deze hem ooit beloofde, basebal te spelen. De onverwachte terugkomst van medescholiere, en medezeilfanaat, Tess verscheurt Charlie in tweeÃƒÂ«n tussen zijn jaren geleden gemaakte belofte en de continuering van zijn leven met een nieuwe liefde. Een dilemma waarin Charlie snel een keuze moet zien te maken: Tess vertrekt binnen een week voor een lange buitenlandse zeilreis.\n************************************************************\n[url=http://www.imdb.com/title/tt1438254/]IMDB[/url]\nUSA / Canada\nDrama\n99 minutes\ndirected by Burr Steers\nwith Zac Efron, Kim Basinger, Amanda Crew\n\nCharlie St. Cloud is a young man who caused the death of his young brother, difficult to handle. He gets a job at the cemetery where his brother is buried. If he sees the spirit of his brother, Charlie decides to go out there every day to talk to him. Everything changes when a woman in Charlie's life gets.\n\nBron: Retail \nTaal: Engels\nAudio: DD 5.1\nOndertitels: Nederlands\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\n \nWeblink : http://www.film1.nl/films/35053-Charlie-St-Cloud.html \n\n\nEnjoy the movie\n\nXX-Men","torrent":{"xt":"urn:btih:a6f71cdaa6ecd0394fa8213e5601127f1300582a","amp;dn":"Charlie+St.+Cloud+%282010%29+DVD+%28dutch+subs%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6f71cdaa6ecd0394fa8213e5601127f1300582a","infoHashBuffer":{"type":"Buffer","data":[166,247,28,218,166,236,208,57,79,168,33,62,86,1,18,127,19,0,88,42]},"announce":[],"urlList":[]}}