{"title":"The Bounty Hunter DVDRIP ~PINKHONEY0269~","uid":5992008,"size":1111865350,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a749bbfd8516b0d41e1b163081bc40c8c5616f0d&amp;dn=The+Bounty+Hunter+DVDRIP+%7EPINKHONEY0269%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pinkhoney0269","files":1,"time":1290917368,"description":"Run time: 111 Minutes\n\nStarring:\n\nJennifer Aniston\nGerard Butler\n\n\nMilo Boyd (Gerard Butler) is a former NYPD detective who now works as a down-on-his-luck bail enforcement agent (bounty hunter). For instance, he accidentally causes a fire while apprehending his latest bounty through a Fourth of July parade, and is arrested as well.\n\nMilo's ex-wife, Nicole Hurley (Jennifer Aniston) is an investigative reporter who was arrested for assaulting a police officer (as she later clarifies, she grazed a patrol horse with her car in her rush to get to a press conference). When she receives a hot tip on a story she is working on - an apparent suicide that may actually have been a murder - she skips her bond hearing to meet with her informant, causing the judge to revoke her bail and issue a warrant for her arrest. Unfortunately, just before Nicole arrives, her informant, Jimmy (Adam Rose) is kidnapped.\n\nMilo is ecstatic when Nicole's bail bondsman, Sid (Jeff Garlin) offers him the job of tracking down Nicole and bringing her to jail, for a bounty of $5,000. After questioning Nicole's mother Kitty (Christine Baranski) (a cabaret singer in Atlantic City), and with his own intimate knowledge of Nicole's habits, Milo apprehends her at a race track in New Jersey, throws her into his car trunk and drives back towards Manhattan. Nicole tries to beg, threaten, or con her way of out Milo's clutches, but only manages to escape briefly before he catches up with her again.\n\nNeither is aware that they are being stalked: Milo by two thugs sent by a bookie named Irene (Cathy Moriarty), because of outstanding gambling debts; Nicole by criminal Earl Mahler (Peter Greene), who is connected with the story she is investigating; and both of them by Nicole's lovestruck coworker Stuart (Jason Sudeikis), bent on &quot;rescuing&quot; her.\n\n\n","torrent":{"xt":"urn:btih:a749bbfd8516b0d41e1b163081bc40c8c5616f0d","amp;dn":"The+Bounty+Hunter+DVDRIP+%7EPINKHONEY0269%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a749bbfd8516b0d41e1b163081bc40c8c5616f0d","infoHashBuffer":{"type":"Buffer","data":[167,73,187,253,133,22,176,212,30,27,22,48,129,188,64,200,197,97,111,13]},"announce":[],"urlList":[]}}