{"title":"John &amp; Audrey Wiggins - Has Anybody Seen Amy (Xvid-2nafish)","uid":6085451,"size":53508570,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a7f3139430d88a6c7d327a1a1026fe793f5daf3e&amp;dn=John+%26+Audrey+Wiggins+-+Has+Anybody+Seen+Amy+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1294307425,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:19\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2021 Kbps\nQuality Factor : 0.40 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\nJohn &amp; Audrey Wiggins was an American country music duo formerly signed to Mercury Records. The duo consisted of John Wiggins (born October 13, 1962 in Nashville, Tennessee) and his sister, Audrey (born December 26, 1967 in Asheville, North Carolina), both of whom alternated as lead vocalists. The duo recorded two studio albums for PolyGram/Mercury Records between 1994 and 1997, in addition to charting four singles on the Billboard Hot Country Songs charts. John has since become a Nashville songwriter, with cuts by Joe Nichols, Randy Houser and others.\n\nJohn Wiggins was born on October 13, 1962 in Nashville, Tennessee, and his sister, Audrey, was born December 26, 1967 in Asheville, North Carolina. They had been singers since childhood, and their father, Johnny Wiggins, was the &quot;Singing Bus Driver&quot; on Ernest Tubb's 1960s tours. John made his singing debut at age four, and for the next several years, he and Audrey performed in their father's band. In the 1980s, the Wiggins siblings and Clinton Gregory joined the house band at a North Carolina venue called The Stompin' Ground.\n\nThe duo signed to PolyGram/Mercury Records in 1994, shortly before their father died. Working with producers Jim Cotton and Joe Scaife, John &amp; Audrey Wiggins released its self-titled debut that year. The album produced three chart entries on the U.S. Billboard Hot Country Songs charts, including the number 22 &quot;Has Anybody Seen Amy.&quot; Bob Cannon of New Country magazine gave this debut album two-and-a-half stars out of five, saying that both siblings had strong voices that &quot;[set] off sparks&quot; on the songs with shared lead vocals, but that the rest of the songs were &quot;solo numbers in country pop arrangements.&quot; Neil Pond of Country America was more favorable, saying that the album was &quot;ever more versatile&quot; because of the alternating male and female vocals.\n\nIn 1995, 1996 and 1997, John &amp; Audrey Wiggins received Country Music Association nominations for Duo of the Year. A second album, The Dream, followed in 1997 under the production of Dann Huff. Country Standard Time reviewer John Johnson gave this album a mixed review, saying that it had mostly generic songwriting and production, but citing &quot;I Can Sleep When I'm Dead&quot; as a standout track. Allmusic critic Stephen Thomas Erlewine gave it three stars out of five, calling it a &quot;little slicker&quot; than the duo's first album, and that it was &quot;enjoyable&quot; but did not offer substantial songs. Geoffrey Himes of New Country gave it three stars out of five, calling the album's cover version of Poco's 1978 hit &quot;Crazy Love&quot; the best track on the album, and saying that the other strong songs were the ones that included shared lead vocals. The album's title track included a 1962 recording of Johnny Wiggins singing &quot;Honeymoon with the Blues,&quot; and the only release from it was &quot;Somewhere in Love&quot; which peaked at number 49 on the country charts.\n\nIn the 2000s, John found work as a songwriter in Nashville, Tennessee. Among his cuts are the singles &quot;Tequila Makes Her Clothes Fall Off&quot; by Joe Nichols, &quot;Anything Goes&quot; by Randy Houser and &quot;Who Are You When I'm Not Looking&quot; by Blake Shelton.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a7f3139430d88a6c7d327a1a1026fe793f5daf3e","amp;dn":"John+%26+Audrey+Wiggins+-+Has+Anybody+Seen+Amy+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7f3139430d88a6c7d327a1a1026fe793f5daf3e","infoHashBuffer":{"type":"Buffer","data":[167,243,19,148,48,216,138,108,125,50,122,26,16,38,254,121,63,93,175,62]},"announce":[],"urlList":[]}}