{"title":"FTV Girls - Alison &amp; Lia - Reunited","uid":6005578,"size":171102865,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a85f538a3d9227eca7b4ae2183433f92833af47a&amp;dn=FTV+Girls+-+Alison+%26+Lia+-+Reunited&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"phatwarez","files":-1,"time":1291312409,"description":"FTV Girls - Alison &amp; Lia - Reunited\n\nAlison\\\\\\'s Comments: Well there you go!  Its been over a year (believe it or not!) that I\\\\\\'ve even run into Lia, even though we live in the same city, and shoot with the same photographer, and assist the same shoots.  The photographer who is proud of his new FTV car the lamborghini murcielago decided that we should get together and do a shoot together.  I guess because both us wanted to be the first model to shoot with the car, he compromised this way.  The photos were hot for us both, and it was sort of cool that our dresses &amp; heels actually matched.  We even tongued each others\\\\\\' nipples which is a first time for us both.  So who is the sexier gal?  I\\\\\\'ll let you decide!\nWe met up at a cheesesteak restaurant, and sort of sat a few feet away from each other, with the photographer trying to get us closer hehe.  Well he pushed us to flash our breasts out in the busy parking lot, and then videotaped us getting changed into our dresses.  We set out to some fancy place on top of a hill, and that\\\\\\'s where we started stripping down, sometimes having drivers pass by and catch us in the act.  Fortunately we didn\\\\\\'t get into trouble, and the shoot was verrry hot!\nLia\\\\\\'s Comments: At first, meeting up with Alison was something I wasn\\\\\\'t too excited about, maybe I was more excited about the car hehe.  Our lives are so different from each other, even though we work for the same company and shoot with the same photographer, and have sites that are very similar.  This was shot for both of our sites, and a way to promote new members from FTV to our sites.  I had a sexy black dress planned for the shoot, it gives curves to my breasts but maybe it flattens them too much, what do you think?  Alison curled her hair, probably because I had it curled too.  Whatever the case, we both looked hot in this shoot, and the car complimented us together.  This sports car is a lot bigger than I thought, its a real monster in person.\nThis is the classic video of photoshoot type of fare, but you get two girls instead of one this time!  I think the same stuff is on Alison\\\\\\'s site too, or got shared between our sites.  Once again, we are in a public place, on top of some hill overlooking the city.  Its in a very fancy area of Phoenix called Paradise Valley, so us two &amp; the car seemed to fit just fine :)  People driving by (mostly men) would stop and make comments, and a few inadvertently caught us naked.  I think after the 2 hours of hanging out that day we sort of re-bonded like old times.  Maybe I\\\\\\'ll give her a phone call one of these days...\n\nScreens (also in torrent):\n &lt;a href=&quot;\nhttp://kopimg.com/images/kopi_694_Alison_Lia_preview.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kopimg.com/images/kopi_694_Alison_Lia_preview.jpg&lt;/a&gt;\n\nFile Size ------- 162mb\nLength ---------- 21:34\nResolution ------ 640x480\nContainer ------- mkv\nVideo Codec ----- x264\nAudio Codec ----- mp3\nFrame Rate ------ 30\n\np h a t w a r e z . t k\nThanks to (anonymous) for the generous seedbox donation.","torrent":{"xt":"urn:btih:a85f538a3d9227eca7b4ae2183433f92833af47a","amp;dn":"FTV+Girls+-+Alison+%26+Lia+-+Reunited","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a85f538a3d9227eca7b4ae2183433f92833af47a","infoHashBuffer":{"type":"Buffer","data":[168,95,83,138,61,146,39,236,167,180,174,33,131,67,63,146,131,58,244,122]},"announce":[],"urlList":[]}}