{"title":"J.River Media Center v15.0.159+patch","uid":5990320,"size":32626971,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a8ab529000ba2a04a79bd668f146a87eb4382142&amp;dn=J.River+Media+Center+v15.0.159%2Bpatch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Slickinator","files":2,"time":1290863723,"description":"J.River Media Center v15.0.159 &lt;a href=&quot;\nhttp://i71.photobucket.com/albums/i122/Slickinator2006/anything.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i71.photobucket.com/albums/i122/Slickinator2006/anything.jpg&lt;/a&gt;\n\nThis is a AIO loader just double click and use clickable buttons.\n\nJ.River Media Center - All-in-one media management app turns any Windows PC into an entertainment hub for complete control of your digital media. Audio, Video, Images, &amp; Television. It connects PC to stereo, TV, remote control devices, digital cameras, scanners, and portable MP3 players. It plays all media, rips, burns, and organizes all your music, images, and video. MC encodes and plays all popular media formats.\n\nPowerful utilities include Media Server for streaming music and images to remote PCs. Media Center is more than a world class player. It's also a Media Network, a whole house music, movie, TV, and photo solution. The leader in audiophile quality sound. The most powerful media database available; an essential tool for large collections. An endless source of satisfaction for tweakers and developers. Plays more file formats than any other player. Connected media from Netflix, Hulu, Last.fm, Youtube, Facebook, Twitter, Wikipedia. And it sends to Flickr, Facebook, and Twitter.\n\nSupports more cell phones, MP3 players, DLNA, and other devices. Powers an HTPC to entertain your family. Even different playback in multiple zones. And it can record high definition TV, and provide a replacement for cable TV. It has a Theater View interface, controllable by a Media Center Remote, an iPad, iPhone, Android, a Windows netbook or Touchscreen. MC is a DirectShow player. Obsessive taggers will be delighted with cover art and metadata options. And MC backs up your work so you can sleep at night.\n\nJ.River Media Center has a streamlined user interface designed to make it even easier to organize, find and play your digital files, and to connect to hardware devices. Make a CD of music for your car. Record your favorite shows and watch them on your TV. More than one soundcard? Play different music simultaneously in different rooms. MC's Media Server can even stream your music to your PC at work!\n\nJ. River Media Center 15.0 Features:\n\nAudio\n* Native support of DirectShow DSP filters\n* Audiophile -- WASAPI exclusive output using high-end USB DACs\n* Audiophile -- Added ability to play files from memory instead of disk\n* Audiophile -- Support for high end USB DAC's with WASAPI\n* Headphone DSP makes listening more natural and comfortable.\n* /SoundcardSwitch command for the launcher (MC14.exe), allows soundcard selection on Vista and W7\n* 3D album view adjusts text size to display more tracks when necessary\n* 3D album view allows playing, adding, shuffling, and adding as next to play\n* Improved tagging and tag compatibility\n\nImages\n* Image Preview allows zoom from a thumbnail to rotate, delete, compare, edit, and more\n* Image thumbnail frames (optional)\n* Photoshop PSD file support\n* Single command copy / send to an editor like Photoshop, and stack new image with original\n\nVideo\n* Video tagging using sidecar files\n* Chapter Support for MKV and MP4\n* Chapters added to On Screen Display\n* Info Panel displays metadata\n\nTelevision\n* Added new &quot;watched&quot; column to metadata\n* EPG can automatically retrieve XMLTV data\n* Automatic correlation of XML channel names and MC channel names\n* Info Panel displays metadata, including TV program art\n* TV program art from YADB\n\nTheater View\n* Watch Hulu and YouTube from Theater View\n* Customizable nested views in Theater View\n* Customizable File Info panel to display metadata\n* Speed and quality enhancements\n* Custom backgrounds\n* Touch screen support\n* On screen clock\n\nRemotes and Servers\n* Wiki articles: Remotes and Servers\n* Remote Relay using IR transceivers for controlling a set top box or receiver\n* Remote Setup Wizard\n* Media Center Remote learning and blasting\n* Media Center can connect to another Media Center to act as a remote (TRemote)\n* New HID remote control plug-in -- supports shortcuts with keyboard, mouse, &amp; gamepad\n* Remote control with REST based Web Service Interface in Library Server\n* Library Server supports read and write to allow for shared, multi-user database access\n* DLNA added to the UPnP Server\n* Library Server clients can write changes back to server\n* Library Server connections allow playback on server as Playing Now zones\n\nOptimization\n* Faster file import on multi-core systems\n* Faster drawing on multi-core systems\n* Faster image rendering\n* Faster MP3 ID3v2 tag reading\n\nGeneral\n* New import wizard finds and suggests folders to import\n* Animated scrolling in lists and trees\n* Improved search box suggestion\n* New Media Center 15 Service runs when the player is running to allow talking to hardware (for remotes, portable devices, etc.) when UAC is enabled.\n\nCompatible with Windows 2000, XP, Vista, Windows 7, &amp; Home Server.\n\nChanges in J.River Media Center 15.0.159 (11/24/2010):\n1. SDK: Added 'FriendlyName' to the MCWS/v1/Alive response so a client can show a friendly name for a server.\n2. SDK: Added the ability for MCWS/v1/Browse/Children to skip levels with only one choice.\n3. Changed: Changing the volume doesn't put the on screen display into a mode where left / right change the volume until the display goes away.\n4. Changed: The position on screen display is part of the regular on screen display rotation (so pressing up / down will can show it).\n5. Fixed: The search editing dialog could popup as modeless in some cases, leading to a crash if a dialog behind the search was closed before closing the search.\n\nInstallation Info:\n1)install setup and then close.\n2)make sure program is off and then open patch and click in the middle and wait for the OK in box on bottom left\n3)if ur using windows 7 put the patch in the install folder\nC:\\Program Files\\J River\\Media Center 15\\patch and right click on the patch and RUN as administrator and click in the middle and wait for the OK in box on bottom left.\n4)enjoy from Slickinator\nnote: i zipped up the patch incase a antivirus might delete it,just disable AV or exclude allow","torrent":{"xt":"urn:btih:a8ab529000ba2a04a79bd668f146a87eb4382142","amp;dn":"J.River+Media+Center+v15.0.159%2Bpatch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8ab529000ba2a04a79bd668f146a87eb4382142","infoHashBuffer":{"type":"Buffer","data":[168,171,82,144,0,186,42,4,167,155,214,104,241,70,168,126,180,56,33,66]},"announce":[],"urlList":[]}}