{"title":"Oorlog van de eeuw dvd 6(Dutch)(TinkerBell) TBS","uid":6026032,"size":4683877576,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a8ad5d0afaa084795b22d42848f3a3919746634f&amp;dn=Oorlog+van+de+eeuw+dvd+6%28Dutch%29%28TinkerBell%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mad_Parrot","files":49,"time":1291934138,"description":"\nDe Oorlog Van De Eeuw 6/10       \n  \n \nIn alle documentatie tot nu toe is deze oorlog gewoonlijk gepresenteerd vanuit het nationale gezichtspunt. \nOngeveer 60 jaar na het einde van de oorlog is de tijd rijp om, nu de overlevenden nog steeds onder ons zijn, voormalige vijanden elkaar de hand te laten schudden en te laten zien wat voor een oorlog dit was. \nHierbij is gebruikgemaakt van authentiek filmmateriaal, veel er van in kleur en de verhalen van ooggetuigen van beide zijden. Vooraanstaande internationale historici namen tevens deel aan dit project. \nDeze geschiedenis presenteert naties die eens bittere vijanden waren in bijna gelijke beelden en televisiecommentaren gerelateerd aan het meest pijnlijke hoofdstuk uit de twintigste eeuw.\nGebeurtenissen, beschreven door de overlevenden: Duitsers en Amerikanen, Britten en Russen, Polen en Fransen. Voordat het te laat is...\n\nDe slag om Monte Cassino\n15 februari 1944: Meer dan 200 Amerikaanse bommenwerpers werpen hun dodelijke lading af over de 'heilige berg' met de uit het jaar 529 gebouwde klooster. \n435 ton explosieven veranderen Monte Cassino in een inferno. \nDe Geallieerden dachten dat het klooster een sleutelpositie innam in de Duitse verdediging, de Gustav Linie. \nDe Duisters hadden echter een veiligheidszone van 300 meter rondom het unieke, culturele monument in acht genomen, omwille van het behoud ervan. \nNadat het klooster totaal vernietigd was door het Geallieerde bombardement installeerden de Duitsers alsnog een militaire basis op de berg. \nVervolgens werd de Slag om Monte Cassino een uitputtingsstrijd tussen de restanten van het klooster, waarbij duizenden soldaten aan beide zijden het leven lieten.\n\nDe langste dag\nD-Day: 6 juni 1944: Op deze dag landde een invasiemacht van 200.000 soldaten op de kust van NormandiÃƒÂ« om het Derde Rijk definitief te verslaan. \nDuizenden parachutisten worden gedropt achter de vijandelijke linies en tegelijkertijd worden de verdedigingslinies gebombardeerd. \nDe Duitse verdediging blijft echter grotendeels intact en wanneer om half zeven 's ochtends de eerste landingsvaartuigen hun laadkleppen op het strand open laten, worden duizenden Geallieerde soldaten aan stukken gereten door de Duitse kogels en granaten. \nAan het einde van de dag heeft de Geallieerde overmacht echter een doorgang in de Duitse verdediging geforceerd en is de bevrijding van Europa begonnen.\n\n \n \n\n\nNEDERLANDS GESPROKEN\n\nSpotinformatie\n \nCategorie    : Beeld \nFormaat      : DVD5 \nBron         : Retail\nOndertitels  : Nederlands (instelbaar)\nGenre        : Documentaire\n\n\n &lt;a href=&quot;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+5/10&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+5/10&lt;/a&gt; \n\n\n \n \n \n\n*****************************************\n\nBrought to you by TinkerBell TBS\n\n\n","torrent":{"xt":"urn:btih:a8ad5d0afaa084795b22d42848f3a3919746634f","amp;dn":"Oorlog+van+de+eeuw+dvd+6%28Dutch%29%28TinkerBell%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8ad5d0afaa084795b22d42848f3a3919746634f","infoHashBuffer":{"type":"Buffer","data":[168,173,93,10,250,160,132,121,91,34,212,40,72,243,163,145,151,70,99,79]},"announce":[],"urlList":[]}}