{"title":"Aiden - Moment (2nafish)","uid":6079659,"size":133998596,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a8b13487a2214b8130babfe873f333733f265da6&amp;dn=Aiden+-+Moment+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1294012824,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nConviction is the name of Aiden's third studio album which was released August 21st, 2007. It is the first of their releases to carry a Parental Advisory sticker although it is not the first to contain profanity. Best Buy editions of the album contain the 2 exclusive bonus tracks &quot;Here Lies the Waste&quot; and &quot;So Far Away&quot;. The album has marked a completely different musical direction for the band, as it bears little resemblance to their previous Nightmare Anatomy.\n\nThe first single from the album, &quot;One Love&quot;, was released on their MySpace page on July 23, 2007.\n\nThe band finished recording after their brief UK arena tour supporting Lostprophets and returned to the UK again to play the Download Festival before doing a more complete tour in support of the album.\n\nAiden is an American rock band from Seattle, Washington that formed in the spring of 2003. The members are WiL Francis (vocals, guitar, piano, lyrics), Jake Davison (drums), Nick Wiggins (bass), and Angel Ibarra (lead guitar). wiL originally played bass but took over lead vocals when the original singer left.\n\nTheir first full-length album Our Gang's Dark Oath was released on Dead Teenager Records in 2004. It was recorded while Jake Davison and Angel Ibarra were still in high school, being released shortly after they had left.\n\nLater in 2005, the band were signed to Victory Records. Their second album and debut for Victory Records titled Nightmare Anatomy was released October 4, 2005.\n\nAiden contributed a cover of Nirvana's &quot;Drain You&quot; to Higher Voltage, a CD given away free with Kerrang! magazine.\n\nIn March 2006, Aiden played an arena tour of the US supporting 30 Seconds to Mars without Emanuel and Keating.\n\nIn May and June 2006, they toured the U.S., supporting the Finnish band HIM, supporting them in their Dark Light tour.\n\nIn April 2007, they played an arena tour of the UK supporting Lostprophets with Taking Back Sunday. They also played the 2007 Taste of Chaos North American Tour alongside The Used, 30 Seconds to Mars, Senses Fail, Saosin, Chiodos, and Evaline. They played a West Coast tour, followed by a national tour, Confessions in the Dark Tour, with Drop Dead, Gorgeous, Still Remains, and 1997. They have completed the International Taste of Chaos tour.\n\nAiden's song &quot;One Love&quot; appears in Resident Evil: Extinction, and their song &quot;We Sleep Forever&quot; is featured in the motion picture Dead Silence.\n\nThe band's third studio album entitled Conviction was released August 21, 2007. It marks a complete change of style in the band's musical direction.\n\nOn the 9th of October, 2007, through a MySpace bulletin the band announced that they were filming their next music video, for the song &quot;Moment,&quot; thus confirming it as the next single.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a8b13487a2214b8130babfe873f333733f265da6","amp;dn":"Aiden+-+Moment+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8b13487a2214b8130babfe873f333733f265da6","infoHashBuffer":{"type":"Buffer","data":[168,177,52,135,162,33,75,129,48,186,191,232,115,243,51,115,63,38,93,166]},"announce":[],"urlList":[]}}