{"title":"Harry.Potter.7.Parte.1.VHS.Castellano.avi","uid":6109024,"size":1648707584,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a91455da5e0466cebf726d46034746464918e7b7&amp;dn=Harry.Potter.7.Parte.1.VHS.Castellano.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1295276869,"description":"Calidad de video: VHS\nPeso: 1500 mb\nIdioma del audio: Espanol\n\nLa primera parte comienza cuando Harry, Ron y Hermione se disponen a emprender la peligrosa mision de localizar y destruir el secreto de la inmortalidad y de la capacidad de destruccion de Voldemort: los Horcruxes. Solos, sin la ayuda de sus profesores ni la proteccion de Dumbledore, los tres amigos deben confiar los unos en los otros mas que nunca. Sin embargo, entre ellos se interponen fuerzas oscuras que amenazan con separarlos.\n\nMientras tanto, el mundo de la magia se ha convertido en un lugar peligroso para los enemigos del Senor Oscuro. La tan temida guerra ha comenzado y los mortifagos de Voldemort han tomado el control del Ministerio de Magia e incluso de Hogwarts, donde aterrorizan y arrestan a cualquiera que se oponga a ellos. Sin embargo, el trofeo que buscan es el mas valioso para Voldemort: Harry Potter. El Elegido se ha convertido en el perseguido y los mortifagos buscan a Harry con ordenes precisas de llevarlo ante Voldemort%u2026 vivo.\n\nLa unica esperanza de Harry es encontrar los Horcruxes antes de que Voldemort lo encuentre a el. Mientras busca pistas, destapa una vieja y casi olvidada historia: la leyenda de las reliquias de la muerte. Y si esta resultara ser cierta, podria dar a Voldemort el poder definitivo que el ansia.\n\nPoco puede imaginar Harry que su futuro ya fue decidido por su pasado cuando, aquel fatidico dia, se convirtio en %u201Cel nino que vivio%u201D. Harry Potter, que ya no es solo un nino, se acerca cada vez mas a la tarea para la que se ha estado preparando desde el dia en que piso Hogwarts por primera vez: la batalla final contra Voldemort. \n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:a91455da5e0466cebf726d46034746464918e7b7","amp;dn":"Harry.Potter.7.Parte.1.VHS.Castellano.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a91455da5e0466cebf726d46034746464918e7b7","infoHashBuffer":{"type":"Buffer","data":[169,20,85,218,94,4,102,206,191,114,109,70,3,71,70,70,73,24,231,183]},"announce":[],"urlList":[]}}