{"title":"HISTORY OF POP AND ROCK MUSIC - part 279","uid":6055559,"size":904394521,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a9dbeac3b91b538a63213b877722c45c4a377e5b&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+279&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1292899759,"description":"                        PART  279\n\n\n\n          JANIS JOPLIN  -  Ball and Chain  (1967)   \n          JANIS JOPLIN  - Move over  (1970)\n          HOT TUNA  -  Uncle Sam Blues (1971)\n          QUICKSILVER MESSENGER SERVICE  -  Fresh Air (1971)   \n          QUICKSILVER MESSENGER SERVICE  -  Mojo  (1971)\n          BOZ SCAGGS  - Make my light  shine (1971)     \n\n\n\n          \n     &quot;Ball 'n' Chain&quot; is a song by Big Mama Thornton. The song, best known as a co ver by Janis Joplin, was featured in Big Brother and the Holding Company's &quot;Cheap Thrills&quot; album; this was their last album with Janis Joplin as primary lead vocalist. Janis' 1967 rendition of Ball 'n' Chain at the Monterey Pop Festival is widely considered to be one of her best performances. The song also became one of her more popular pieces to sing in concert. She sang the song twice at Woodstock after fans cheered for an encore.\n     &quot;Move Over&quot; is a song by Janis Joplin from her album &quot;Pearl&quot; . It  is the fourth and final album by Janis, released on February 1, 1971  - four months after her death from a heroin overdose. It is her first album recorded with Full Tilt Boogie Band. &quot;Pearl&quot; features the hits &quot;Me and Bobby McGee,&quot; (commercially released with &quot;Half Moon&quot;, another album cut, on the flipside) written by Kris Kristofferson and Fred Foster, and &quot;Move Over,&quot; which she penned herself. Joplin sings on all of the tracks except for &quot;Buried Alive in the Blues&quot;, which remained an instrumental because Janis died before being able to add her vocals.In 2003, the album was ranked number 122 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n     Hot Tuna is an American blues-rock band formed by bassist Jack Casady and guitarist Jorma Kaukonen as a spin-off of Jefferson Airplane. It plays acoustic and electric versions of original and traditional blues songs.\n     Quicksilver Messenger Service is an American psychedelic rock band, formed in 1965 in San Francisco and is considered one of the leading acts on the city's psychedelic scene in the mid-to-late 1960s.\n     Boz Scaggs is an American singer, songwriter and guitarist. After learning guitar at the age of 12, he met Steve Miller at St. Mark's. In 1959, he became the vocalist for Miller's band, The Marksmen.Leaving school, Scaggs briefly joined the burgeoning rhythm and blues scene in London. After singing in bands such as The Wigs and Mother Earth, he traveled to Sweden as a solo performer, and in 1965 recorded his solo debut album, Boz, which was not a commercial success. He gained fame in the 1970s with several Top 20 hit singles in the United States, along with the #2 album, &quot;Silk Degrees&quot;\n\n\n\nFrom Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:a9dbeac3b91b538a63213b877722c45c4a377e5b","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+279","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9dbeac3b91b538a63213b877722c45c4a377e5b","infoHashBuffer":{"type":"Buffer","data":[169,219,234,195,185,27,83,138,99,33,59,135,119,34,196,92,74,55,126,91]},"announce":[],"urlList":[]}}