{"title":"MX.vs.ATV.Reflex.DVD5RIP-Unleashed","uid":5992736,"size":3362085385,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ab5b22460ded9138bd76f246195ec0219516c359&amp;dn=MX.vs.ATV.Reflex.DVD5RIP-Unleashed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rlf-rls","files":70,"time":1290905322,"description":"P R E P A R E T O B E U N L E A S H E D ! !\n\nMX vs ATV Reflex DVD5RIP (C) THQ\n\nRelease Date: 11-27-2010 Protection: Steam\nRelease Type: DVDRIP Game Genre: Racing\n\nRelease Notes:\n\nThink fast and hang on to your ride as you take independent control of\nthe rider and take the ultimate test of mettle. Dual controls let you\ntear it up with death-defying tricks and high-flying freestyle action\nFight for traction and dig up the track to leave your mark. Hone in your\nskills through havoc-laden environments that come alive, creating\never-changing conditions\n\nRush through raging rivers, slash though swampy everglades, and blaze\nthrough desert dunes as the terrain gets altered with every turn. Gain\non your opponents lap after lap as you force the competition to carve\nnew race lines, but beware, they can do the same to you\n\nTest Your Reflexes\n\nDual controls allow you to control your rider as you power your vehicle\nindependently. Lean in to take tighter turns and higher jumps. Think\nfast and wrestle your ride back from the verge of catastrophe\n\nLeave Your Mark\n\nReal-time deformation continuously changes the track beneath you with\nevery lap. Dig up the track and force the competition to carve a new\nrace line. Rush through raging rivers, slash though swampy everglades\nand blaze through desert dunes as the terrain gets altered with every\nturn. New terrain engine provides unprecedented driving surface detail\nnever achieved in any other racing game\n\nPull Off The Sickest Tricks\n\nDual controls let you tear it up with death-defying tricks and\nhigh-flying freestyle action. Intuitive gestures in the Reflex Trick\nSystem let you push the limits to pull off the most extreme stunts\never. Impress the judges. Increase your score. Emerge victorious in\nMotoX Freestyle\n\nVehicles\n\nCustomize and tune the fiercest MX bikes and ATVs. Choose from a\nvariety of vehicles including Sport Buggies, Sport Trucks and UTV's\nFlaunt your latest battle scars as truck body panels shatter and break\naway\n\nMultiplayer\n\nOnline play for up to 12 racers. Streamlined multiplayer interface lets\nyou challenge your friends and brings players of all skill levels\ntogether\n\nRipped = Nothing\n\nInstall Notes:\n\n1. Unpack the release with WinRAR or equivalent\n2. Burn the Iso with Nero Burning ROM or equivalent\nalternative option is mounting the image with Daemon-Tools\n3. Install\n4. Play\n\nAdditional Notes:\n\nThis setup requires at least 20GB of space to unpack properly. Also keep\nin mind that the setup will go way pass the 100% mark. Don't worry it's\nunpacking the compressed data\n\nUnleashed salutes all friends of the family, contacts and competition!","torrent":{"xt":"urn:btih:ab5b22460ded9138bd76f246195ec0219516c359","amp;dn":"MX.vs.ATV.Reflex.DVD5RIP-Unleashed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab5b22460ded9138bd76f246195ec0219516c359","infoHashBuffer":{"type":"Buffer","data":[171,91,34,70,13,237,145,56,189,118,242,70,25,94,192,33,149,22,195,89]},"announce":[],"urlList":[]}}