{"title":"Helmet - Milquetoast (2nafish)","uid":6041714,"size":149385220,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:aba9f8af39fa72bb95de15a0b9141beff9c4f73b&amp;dn=Helmet+-+Milquetoast+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292407761,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Milquetoast&quot; is the first single by alternative metal band Helmet from their 1994 album, Betty. It is the album's fourth track and only charting single, reaching #39 on Billboard's Mainstream Rock Tracks chart.\n\nA music video was made for &quot;Milquetoast&quot; and was in regular rotation on MTV. Prior to Betty's release, the song appeared in alternate form on The Crow soundtrack as &quot;Milktoast&quot;.\n\nBetty is the third album by Helmet, released in 1994 on Interscope. The album was highly anticipated by both music critics and fans as a result of the band's success with the previous album, Meantime.\n\nThis album coincided with Helmet's first personnel change, with Rob Echeverria (guitarist of NYC Hardcore band, Rest In Pieces) replacing the departed Peter Mengede on guitar. Despite being Helmet's highest charting album in the U.S., Betty was not as successful as Meantime and received almost unanimously-favorable reviews from critics. After recording and touring in support of the album, Echeverria left Helmet in 1995 to join Biohazard; however, his departure was much more amicable than Mengede's.\n\nPrior to Betty's release in June 1994, the album's biggest hit, &quot;Milquetoast&quot;, originally appeared in alternate form on The Crow soundtrack as &quot;Milktoast&quot;. Its video was in regular rotation on MTV, and videos for &quot;Wilma's Rainbow&quot; and &quot;Biscuits For Smut&quot; were also released.\n\nHelmet is an alternative metal band from New York formed in 1989. Founded by vocalist/guitarist Page Hamilton, Helmet has had numerous lineup changes, and Hamilton has been the only constant member.\n\nHelmet has released seven studio albums and two compilations. The band found mainstream success with their 1992 major label debut Meantime, which debuted at number 68 on the Billboard 200 and spawned the hits &quot;Unsung&quot; and &quot;In the Meantime&quot;. After releasing two more albums, Helmet broke up in 1998, but reformed in 2004. The band released their first post-reunion album, Size Matters, later that year and it was their last release on their longtime label Interscope Records. They were briefly signed with Warcon Records, who released their next album, Monochrome, on July 18, 2006. Currently, Helmet are signed to Work Song, who released their seventh album Seeing Eye Dog.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:aba9f8af39fa72bb95de15a0b9141beff9c4f73b","amp;dn":"Helmet+-+Milquetoast+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aba9f8af39fa72bb95de15a0b9141beff9c4f73b","infoHashBuffer":{"type":"Buffer","data":[171,169,248,175,57,250,114,187,149,222,21,160,185,20,27,239,249,196,247,59]},"announce":[],"urlList":[]}}