{"title":"ConvertXtoDVD v4.1.7.343 + Serials [ChattChitto RG]","uid":5967567,"size":23149850,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ac358d891a0a29de35f1a2e4fa6ce06d92bfccbd&amp;dn=ConvertXtoDVD+v4.1.7.343+%2B+Serials+%5BChattChitto+RG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ChattChitto","files":-1,"time":1290161675,"description":"ConvertXtoDVD v4.1.7.343 + Serials\n\n.exe File Format (Setup File - Serials - Instructions)\n\n***********************************************************************************\n\nConvertXtoDVD v4.1.7.343\n\nHomePage: http://www.vso-software.fr/products/convert_x_to_dvd/\n\nConvertXtoDVD video converter, burn DVD\n\nConvertXtoDVD - top-choice video conversion software - convert and burn any videos such as Avi to DVD, WMV to DVD, MKV to DVD, YouTube, ogm, mpeg, quicktime mov!\nThis award-winning divx to dvd video converter software burn video and audio formats to DVD, video conversion supports avi, divx, wmv, mkv, xvid, vcd, vob, dvd...\nAll in one video conversion and burning software\n\nBackup and transfer your movies to DVD and enjoy watching them on any home DVD player.\n\nConvertXtoDVD supports the most popular formats, such Xvid, MOV, VOB, Mpeg, Mpeg4, MP4, AVI, WMV, DV and stream formats. It converts your files into a compliant DVD Video set of files and burns it on a DVD media.\n\nThe aspect ratio can be automatically selected or forced to a specific format. The program works for NTSC and PAL video formats and creates chapters automatically. Multiple audio tracks are supported. Version 2 uses a completely rewritten interface with subtitles support and a lot of new settings\n\nFeatures of ConvertXtoDVD 4.1.7:\n=================================\n- Supported video formats: avi, divx, xvid, mov, mkv, flv , mpeg1, mpeg2, mpeg-, nsv, dvr-ms, tivo, ts, ifo, vob, asf, wmv, realmedia, rm, rmvb, ogm, existing files from digital camcorders, TV/Sat, capture cards, etc. No external codecs needed!\n- Supported audio formats: AC3, DTS, PCM, OGG, MP3, WMA and more...\n- Able to create DVD menus with different templates available, possibility to add background video, image or audio, have chapter and audio/subtitle menus.\n- Conversion advisor wizard, control of the conversion speed vs. quality.\n- Fast and quality encoder, typically less than 1 hour for converting 1 movie, and supports Multi-Core processors!\n- Included burning engine with burn speed control choice of SAO or packet writing methods, supports all DVD formats\n- Custom and or automatic chapter creation with markers and preview window\n- Advanced file merging possibilities\n- Handles subtitles files, internal and external: SRT, .SUB/IDX, .SSA with color and font selection, and supports tags like italic, bold, turn on/off with DVD player remote control\n- Video output for video standard (NTSC, PAL), TV Screen (Widescreen 16:9, Fullscreen 4:3) and DVD Resolution (Full D1, Broadcast D1, Half D1, SIF), or choose automatic for all choices listed above. Also convert video from NTSC to PAL or PAL to NTSC\n- Video post processing settings like video resize-pad/cropping and de-interlacing options\n- Multilingual support\n- Works with 32 and 64bits edition of Windows XP, Vista, 7\n\n\nChanges In v4.1.7.343:\n=======================\n- minor bugfixes + locale update, czech, English, German\n- 0004013: [Bug] regression, doesnt get past menu creation (wesson) - resolved.\n- 0004016: [Feature Request] wording: change wording in settings under the burning tab (wesson) - resolved.\n- Norsk translation update\n- French and Italian EULA modified for compliance with LGPL licensing (remove interdiction to decompile, disassemble, reverse-engineer, ...)\n- Delphi XE compilation + Menu snaps regression fix\n- 0003987: [Bug] no thumbnails generated in menus (wesson) - resolved.\n- fix issues of rare occurence\n- fix burning engine crash condition on random case\n- fix crashes on some files\n- restore support for dvr-ms file\n- 0003959: [Bug] Problem with DTS-HD audio stream in Delicatessen main file (00006.M2TS) (wesson) - resolved.\n- 0003949: [Bug] regression - audio messed up in 4.1.4.338 and not in 4.0.10.324 (wesson) - resolved.\n- 0003951: [Bug] half of screen is green (wesson) - resolved.\n\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something &quot;Un-Clean&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\n[Please Leave A Comment Confirming This Pack]","torrent":{"xt":"urn:btih:ac358d891a0a29de35f1a2e4fa6ce06d92bfccbd","amp;dn":"ConvertXtoDVD+v4.1.7.343+%2B+Serials+%5BChattChitto+RG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac358d891a0a29de35f1a2e4fa6ce06d92bfccbd","infoHashBuffer":{"type":"Buffer","data":[172,53,141,137,26,10,41,222,53,241,162,228,250,108,224,109,146,191,204,189]},"announce":[],"urlList":[]}}