{"title":"Photodex ProShow Gold v4.1.2737 [Portable] ","uid":6117785,"size":24577738,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:acc48c568e04ec615769f6b6ee689098121e65e0&amp;dn=Photodex+ProShow+Gold+v4.1.2737+%5BPortable%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chusca","files":3,"time":1295631189,"description":"Una de las formas mas originales y comodas de disfrutar de tu coleccion de fotos digitales es crear con ellas una presentacion que luego podras grabar en un CD y ver en el DVD de casa, felizmente sentado en el sofa, compartiendolas con familiares y amigos.\nProShow Gold es una herramienta con la que crear una de esas presentaciones te parecera un juego. Incorpora una intuitiva interfaz en la que seleccionar la carpeta con las fotos que quieres poner a tu presentacion, elegir los efectos de transicion que quieres entre ellas, el tiempo que ha de estar cada foto en pantalla y, por ultimo, la musica que quieres poner de fondo.\nEl funcionamiento no puede ser mas facil: elige los elementos con los que quieres componer tu presentacion y arrastralos con el raton sobre la interfaz de ProShow Gold. El programa tiene soporte para imagenes en JPG, GIF y BMP, musica en MP3 a la que puedes poner efectos de fundido (fade), y mas de 150 efectos de transicion diferentes.\nUna vez creada tu presentacion, puedes previsualizarla para asegurarte de que queda perfecta, antes de proceder a su grabacion. Las puedes guardar como fichero EXE auto-ejecutables, como video en diversos formatos (MPEG, VCD, SVCD) o en un CD que se reproduce automaticamente desde el lector.\n-Idioma: InglÃƒÂ©s\n\n","torrent":{"xt":"urn:btih:acc48c568e04ec615769f6b6ee689098121e65e0","amp;dn":"Photodex+ProShow+Gold+v4.1.2737+%5BPortable%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acc48c568e04ec615769f6b6ee689098121e65e0","infoHashBuffer":{"type":"Buffer","data":[172,196,140,86,142,4,236,97,87,105,246,182,238,104,144,152,18,30,101,224]},"announce":[],"urlList":[]}}