{"title":"The Carpenters - Superstar (Xvid-2nafish)","uid":5944643,"size":24330618,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ae2e26b48a0f569084c64b9071f338ff71393245&amp;dn=The+Carpenters+-+Superstar+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1289300744,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:47\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 727 Kbps\nQuality Factor : 0.14 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Superstar&quot; is a 1969 song written by Bonnie Bramlett and Leon Russell that has been a hit for many artists in different genres and interpretations in the years, most notably by The Carpenters in 1971 and Luther Vandross in 1983.\n\n&quot;Superstar&quot; became its biggest hit version for the Carpenters. Richard Carpenter was unaware of the Bramlett or Mad Dogs originals, but as he later wrote in a compilation album's liner notes: &quot;I came home from the studio one night and heard a then relatively unknown Bette Midler performing this song on the Tonight Show. I could barely wait to arrange and record it. (It remains one of my favorites).&quot; Somewhat ironically, Karen Carpenter had heard the Coolidge rendition on a promotional copy of the Mad Dogs album, but did not think that much of it.\n\nRichard's arrangement featured an oboe line at the start, followed by Karen's clear contralto voice set against a quiet bass line in the verses, which then built up to up-tempo choruses with a quasi-orchestral use of horns and strings. Produced by Richard with Jack Daugherty, it was recorded with members of the famed Los Angeles session musicians The Wrecking Crew. Karen Carpenter recorded her vocal in just one take (which in fact was the &quot;work lead&quot; normally used to guide the other musicians), using lyrics scribbled by Richard on a paper napkin. Since the song's subject was more risquÃƒÂ© than usual for the clean-cut image of the Carpenters, Richard changed a lyric in the second verse from:\n\n    And I can hardly wait\n    To sleep with you again\n\nTo the somewhat less suggestive:\n\n    And I can hardly wait\n    To be with you again.\n\nWhether he knew of the similar previous lyric change or did it independently is unclear. The song's publisher was delighted with Richard's lyric change, saying the previous wording had kept many other artists from recording it. (The timing of The Carpenters' first recording of the song is unclear; it is possible that Richard submitted the change to the publisher well in advance of their ultimate release of the recording, and that this influenced the other early versions.) In any case, upon hearing the final recording, Karen Carpenter finally recognized the power of the song.\n\nThe duo's rendition was included on the May 1971 album Carpenters, and then released as a single in September 1971. It rose to number 2 on the Billboard Hot 100 pop singles chart (held out of the top spot by Rod Stewart's &quot;Maggie May&quot;) and spent two weeks at number one on the Easy Listening chart that autumn and earned gold record status. It also reached number 18 on the UK pop singles chart and did well in Australia and New Zealand as well.\n\nRichard would be nominated for a Grammy Award for Best Arrangement Accompanying Vocalist for his efforts. &quot;Superstar&quot; would go on to appear on two mid-1970s Carpenters live albums as well as innumerable compilation albums. For instance, it appeared on the Carpenters' 2004 SACD compilation, The Singles: 1969-1981 (not to be confused with the regular CD, The Singles: 1969-1981), as a remix of the original 1973 mix on the similarly titled compilation The Singles: 1969-1973.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ae2e26b48a0f569084c64b9071f338ff71393245","amp;dn":"The+Carpenters+-+Superstar+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae2e26b48a0f569084c64b9071f338ff71393245","infoHashBuffer":{"type":"Buffer","data":[174,46,38,180,138,15,86,144,132,198,75,144,113,243,56,255,113,57,50,69]},"announce":[],"urlList":[]}}