{"title":"Democracy Now - 17 nov 2010","uid":5962779,"size":453489802,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ae872bcbcbffefbd343880f24fd83497cb2f583b&amp;dn=Democracy+Now+-+17+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1290011305,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 17, 2010\n\n- Report: Lenders, States Discuss Foreclosure Compensation Fund\n- Canada to End Afghan Combat Mission\n- Protests Continue in Haiti over Cholera Outbreak\n- New U.N. Torture Expert Urges U.S. Torture Probe\n- U.N. Security Council Rejects Probe of Western Sahara Crackdown\n- GOP Sen. Seeks Delay to START Vote\n- Panel Convicts Rangel on Ethics Charges\n- Experts Fault BP, Gov't Agency for Oil Spill\n- Dozens Protest U.S. Fundraiser for West Bank Settlement\n- Private Mississippi Youth Jail Sued for &quot;Barbaric&quot; Conditions\n- Pittsburgh City Council Approves Ban on Natural Gas Drilling\n\n\nSpecial reports\n\n- Jury Appears Deadlocked in Landmark Civilian Trial of Gitmo Prisoner\n\nA federal jury in New York is deliberating in a landmark trial of the first former Guantanamo detainee to be tried in the civilian court system. On Monday, the jury appeared deadlocked after a juror asked to be excused saying she was being attacked for her conclusions about the defendant, Ahmed Khalfan Ghailani. A Tanzanian national, Ghailani faces conspiracy and murder charges related to the 1998 U.S. embassy bombings in Kenya and Tanzania that killed 224 people and wounded thousands. We speak to Karen Greenberg of the Center on Law and Security at the New York University Law School.\n\n\n- 45 Years Later, Former Alabama State Trooper Pleads Guilty to Killing Black Civil Rights Worker Jimmie Lee Jackson\n\nA white former Alabama state trooper has pleaded guilty to killing a black civil rights worker 45 years ago at the height of the civil rights movement. Seventy-seven-year old James Bonard Fowler was sentenced to six months in prison for the 1965 shooting of 26 year-old Jimmie Lee Jackson during a melee in a restaurant in Marion, Alabama. We speak to John Fleming, the reporter to whom Fowler first confessed; and Democratic Congressmember John Lewis of Georgia, a leading figure of the civil rights movement.\n\n\n- Rep. John Lewis on Congress After GOP Victory, Closing Gitmo, Afghan War and Ethics Conviction of Charles Rangel\n\nCongressmember John Lewis (D-Georgia) joins us to talk about the shifting political landscape following the Republican gains in the mid-term elections, the Obama administration's abandonment of its pledge to close Guantanamo Bay, the Afghan war, and the conviction of Rep. Charles Rangel on congressional ethics charges.\n\n\n- &quot;Push Michael Moore Off A Cliff&quot;: Health Insurance Whistleblower Wendell Potter Details How the Industry Attacked Michael Moore's Film &quot;Sicko&quot;\n\nWhen Academy Award-winning film director Michael Moore announced he would be making a documentary about the American healthcare system in 2004, it put the health insurance industry on high alert. One person who immediately went on the offensive was Wendell Potter, who at the time was the chief spokesperson for insurance giant CIGNA. Last year, Potter became the industry's most prominent whistleblower. We speak to Potter about his role in attacking Michael Moore's film Sicko and the movement for a single-payer healthcare system.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ae872bcbcbffefbd343880f24fd83497cb2f583b","amp;dn":"Democracy+Now+-+17+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae872bcbcbffefbd343880f24fd83497cb2f583b","infoHashBuffer":{"type":"Buffer","data":[174,135,43,203,203,255,239,189,52,56,128,242,79,216,52,151,203,47,88,59]},"announce":[],"urlList":[]}}