{"title":"Football.Manager.2011.MULTi3-PROPHET","uid":5955718,"size":2890964581,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b0fa85dd75a33d1140bf6a4fbcdba6de79152835&amp;dn=Football.Manager.2011.MULTi3-PROPHET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rlf-rls","files":60,"time":1289707370,"description":"Football Manager 2011 (c) SEGA\n\nrelease date: November 2763\nprotection: DVD-Check\n# of discs: 1\nlanguages: EN/PL/CZ\n\nFootball Manager 2011 is the latest iteration of the award-winning Football Manager series. Selling in excess of 6 Million copies worldwide, Football\nManager has been topping the UK PC charts for the last five years. For the first time ever, aspiring managers can now negotiate contracts with players\nin real time. And by working with a multitude of real-life football agents, Sports Interactive gained an insight as to how these negotiations can\nbe made as realistic as possible in-game. Prepare to meet different types of agents in your contract talks; each with their own personality so will\ntherefore need a different approach. With the implementation of the most intuitive training system in the series history, there is a new &quot;match\npreparation&quot; area of training so that managers can give their team specific areas to focus on in the lead up to a match. There are also more basic\ntraining schedules for players, and 14 different individual skill areas that you can focus your players on. Interaction with players, staff and the\nboard have gone to a whole new level, with a host of new boardroom and backroom requests, a new player interaction module that allows the manager to have private conversations with players, as well as public conversations regarding players at other clubs. Two years after the launch of the 3D Match Engine, players will see a number of improvements\nimplemented for this year's release. With over 100 new animations added, as well as more player emotions, new player models, new stadiums, pitch\ntextures, improved lighting, floodlit night matches, more goal celebrations and lots of other extras which improve what was already the best match simulation on the market. The other new features include a revamped media module, which will keep the managers better up to date with\nevents going on in their football world, as well as being more customisable than ever before, and the most requested feature that the Sports Interactive community have asked for in the last few years dynamic league reputation, which makes for an even more realistic model of the footballing world\n\n1- Unpack, burn or mount\n2- Install game\n3- Install the 11.1.0 update from PROPHET dir\n4- Copy the crack from PROPHET dir\n5- Go To Hell!\n\n* currently we are looking for:\n\n&gt; talented cracker\n&gt; experienced movie ripper\n&gt; supply games ENGLiSH / MULTi / POLiSH\n&gt; supply any stuff\n(movies, apps, even spycam porn of your sister)\n&gt; supply hardware (box , ftps, etc.)\n\n* you match the description? maybe you can join us!\n\n*** WE'RE AFTER AFFILIATE PRE SITES IN EURO AND ASIA ***\n\n\nViTALiTY + BACKLASH + RiTUEL + BAZOOKA + GENESiS\nCRD + ROGUE + OUTLAWS + rG + VGN\n\no3.2oo9\n\nascii: korma[67]","torrent":{"xt":"urn:btih:b0fa85dd75a33d1140bf6a4fbcdba6de79152835","amp;dn":"Football.Manager.2011.MULTi3-PROPHET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0fa85dd75a33d1140bf6a4fbcdba6de79152835","infoHashBuffer":{"type":"Buffer","data":[176,250,133,221,117,163,61,17,64,191,106,79,188,219,166,222,121,21,40,53]},"announce":[],"urlList":[]}}