{"title":"Imogen Heap - Everything In Between, The Story of Ellipse MKV","uid":6012744,"size":927880527,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b10dc92fe1d4b07e78c9ec3fb8e02e0ccf54b97a&amp;dn=Imogen+Heap+-+Everything+In+Between%2C+The+Story+of+Ellipse+MKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"extreemlittlepimp","files":1,"time":1291519948,"description":"Filmed over three years and compiled from 371 hours of footage, Everything In-Between: The Story Of Ellipse follows one of music s most creative and inventive artists as she brings to life her most creative and inventive album.\n\nFollowing the success of 2005 s Grammy nominated album Speak For Yourself, British musical phenomenon Imogen Heap decamped to Maui, Hawaii in spring 2007 to start writing her third solo album. With only a video camera for company, she began recording her adventures, thoughts and song ideas, and when she returned to the UK nine weeks later found that she had not only the start of an album, but the beginnings of a captivating film about its making. She invited friend and film maker Justine Pearsall to continue documenting everything that followed: from her return to live in the house where she grew up; building a state of the art studio in her childhood playroom; the evolution of the songs; the excitement of recording a myriad of bizarre sounds and noises, to the tears, frustration and late nights trying to piece them together into the magical songs she hears in her head, and from the isolation of her studio to the frantic activity of video shoots and rehearsing for the accompanying tour, every inch of Ellipse is here.\n\nIncluding interviews with the people who know her best and a disarmingly candid running commentary from Imogen herself, Everything In-Between is part making of, part intimate diary confessional. A rare, inspiring and intimate insight into the life and times of a breathtaking album and a truly unique and exceptional artist.","torrent":{"xt":"urn:btih:b10dc92fe1d4b07e78c9ec3fb8e02e0ccf54b97a","amp;dn":"Imogen+Heap+-+Everything+In+Between%2C+The+Story+of+Ellipse+MKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b10dc92fe1d4b07e78c9ec3fb8e02e0ccf54b97a","infoHashBuffer":{"type":"Buffer","data":[177,13,201,47,225,212,176,126,120,201,236,63,184,224,46,12,207,84,185,122]},"announce":[],"urlList":[]}}