{"title":"De mooiste sprookjes DVD5 (dutch spoken)NLT-Release","uid":6056535,"size":3584521259,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b1d9ee13c55ad9c013ce9ab5a4870351273a67fc&amp;dn=De+mooiste+sprookjes+DVD5+%28dutch+spoken%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1292890200,"description":"De mooiste sprookjes DVD5 (dutch spoken)NLT-Release\nLegende Van Mulan/Hercules\n\n[img]http://img600.imageshack.us/img600/2161/mulanhercules.jpg[/img]\n\nBeschrijving\nMu-lan is een meisje uit een familie van dappere krijgers. Op het moment dat de verradelijke Ge-Hunt heel china wil veroveren, helpt ze haar machteloze vader die de generaal is van de keizer. Ze verkleedt zich als krijger en vertrekt om te gaan vechten in het leger. Onderweg raakt ze bevriend met Lu-Gan, de dapperste jongen die ze ooit heeft gezien. Samen sluiten ze zich aan bij het keizerlijke leger. In een bitter strijd tegen de mannen van Ge-Hunt wordt Lu-Gan gevangen genomen. Je begrijpt dat Mu-Lan er alles voor over heeft om haar vriend te bevrijden. Maar terwijl ze dat probeert, hoort ze dat Ge-Hunt het paleis van de keizer wil aanvallen. Lukt het onze moedige Mu-Lan om Lu-Gan te bevrijden? En kan ze het paleis redden uit de handen van die valse Ge-Hunt? Kijk snel! \nHercules In het godenrijk boven het oude Griekenland wonen vele goden, waaronder de oppergod Zeus. Herkules, een dappere vechter uit het Griekse rijk, wil Zeus bewijzen dat hij moedig genoeg is om onsterfelijk te worden. Hiervoor moet Hercules zware beproevingen doorstaan! Vol goede moed begint hij aan de uitdagingen die de goden hem stellen. Zal hij het halen en onsterfelijk worden? Hercules is een prachtig verhaal vol spanning en avontuur.\n\nNederlands gesproken en gezongen!\nCover zit erbij!\n***********************************************\nDescription\n Mu-lan was a girl from a family of brave warriors. At the moment the treacherous Ge-Hunt really wants to conquer China, powerless to help her father who was general of the emperor. She dresses up as a warrior and leaves to fight in the army. Along the way she is befriended by Lu-Gan, the bravest boy she has ever seen. Together, they connect themselves with the imperial army. In a bitter struggle against the men of Ge Gan-Lu-Hunt is captured. You understand that Mu-Lan will do anything in order to free her friend. But while she tries, she learns that Ge-Hunt the palace of the emperor will attack. Can our brave Mu-Lan Lu-Gan order to liberate? And can they save the palace from the hands of the false Ge-Hunt? Take a look! \nHercules The Ancient Greek Gods kingdom over live many gods, including Zeus. Hercules, a brave fighter from the Greeks, Zeus would prove he was brave enough to become immortal. Requires Hercules through severe trials! Good spirits, he begins to address the challenges make him the gods. Will he make it and become immortal? Hercules is a beautiful story full of excitement and adventure.\n\nDutch spoken and sung!\nThere is cover!\n\nHave fun!\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Geen\n \nGenre : Animatie - Kinderfilm\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de \n\nNederlands Ondertitelde Torrents: &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\nEnjoy the movie\n\nBy XX-Men\n","torrent":{"xt":"urn:btih:b1d9ee13c55ad9c013ce9ab5a4870351273a67fc","amp;dn":"De+mooiste+sprookjes+DVD5+%28dutch+spoken%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1d9ee13c55ad9c013ce9ab5a4870351273a67fc","infoHashBuffer":{"type":"Buffer","data":[177,217,238,19,197,90,217,192,19,206,154,181,164,135,3,81,39,58,103,252]},"announce":[],"urlList":[]}}