{"title":"Billy Gilman - Classic Christmas","uid":6044875,"size":239181133,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b2982880f79330f15c0febf48f97839d23a4e2df&amp;dn=Billy+Gilman+-+Classic+Christmas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ddawg","files":-1,"time":1292517255,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51kr1iazUUL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51kr1iazUUL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Classic Christmas\nArtist: Billy Gilman\nAudio CD (August 29, 2005) \nOriginal Release Date: 2005 \nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. White Christmas \n02. Warm &amp; Fuzzy\n03. Winter Wonderland\n04. The Christmas Song\n05. There's A New Kid In Town\n06. Jingle Bell Rock\n07. Rockin' Around The Christmas Tree\n08. Angels We Have Heard On High\n09. Silent Night\n10. Away In A Manger\n11. Sleigh Ride (Duet with Charlotte Church)\n12. O Holy Night \n\n\nAmazon Review:\nThe prepubescent country-singing wonder did his homework for his first Christmas CD. Covering a handful of classics from &quot;White Christmas&quot; and &quot;The Christmas Song&quot; to &quot;Rockin' Around the Christmas Tree&quot; and &quot;Jingle Bell Rock,&quot; young Mr. Gilman also sets out to make &quot;Warm &amp; Fuzzy&quot; and &quot;There's a New Kid in Town&quot; holiday standards, too. The former is as muslin-soft and sugarcane-sweet as Christmas sentiment can get, while the latter is one of the better-written country Christmas songs of late, and Billy does them up with all the emotion and emoting he can. Producers Don Cook and Blake Chancey manage to keep the big-production sound toned down a bit in order to showcase the kid's pipes, and when he joins classical soul mate Charlotte Church for a go at &quot;Sleigh Ride,&quot; you get to hear two prodigies whose voices are as crisp, clear, and clean as a chilly night far north of Nashville.\n\nAllmusic Review:\nStriking while the iron was hot and before the 12-year-old singer's voice changed, Epic Records rushed back into the marketplace with the second Billy Gilman album to be released within six months, this one a holiday collection. The title suggests that standards will make up the fare, which turns out to be true, mostly, though co-producers Don Cook and David Malloy were not able to resist the temptation to throw in a couple of little-known songs with their names in the songwriter credits. But they did resist the temptation to make Gilman sing anything specifically child-oriented, such as &quot;Nuttin' for Christmas&quot; or &quot;All I Want for Christmas Is My Two Front Teeth.&quot; No, what you get here are Christmas classics like &quot;White Christmas&quot; (complete with introductory verse), &quot;The Christmas Song,&quot; and &quot;Silent Night.&quot; Gilman acquits himself well, still possessed of his pure, elastic tenor and brassy, unabashed style. He even stands toe to toe with fellow child prodigy Charlotte Church, probably because they have been assigned &quot;Sleigh Ride&quot; rather than something on which the classical singer might have been expected to snatch away the spotlight, such as &quot;O Holy Night.&quot; There is little to suggest that Gilman's appeal will last beyond its pre-puberty novelty value, but this is a pleasant effort, even given the overly familiar material.","torrent":{"xt":"urn:btih:b2982880f79330f15c0febf48f97839d23a4e2df","amp;dn":"Billy+Gilman+-+Classic+Christmas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2982880f79330f15c0febf48f97839d23a4e2df","infoHashBuffer":{"type":"Buffer","data":[178,152,40,128,247,147,48,241,92,15,235,244,143,151,131,157,35,164,226,223]},"announce":[],"urlList":[]}}