{"title":"HISTORY OF POP AND ROCK MUSIC - part 277","uid":6006444,"size":736032655,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b39109e02771d45449ad158bc4265a6a9c0f2a5b&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+277&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1291335678,"description":"                        PART  277\n\n\n                Rock and roll &amp; Rockabilly\n\n\n           1. CHUCK BERRY  -  Oh Baby Doll  (1957)\n           2. CHUCK BERRY  -  You Can't Catch Me  (1957)\n           3. CHUCK BERRY  -  Memphis, Tennessee (1957)\n           4. LITTLE RICHARD -  Lucille  (1957) \n           5. GENE VINCENT  -  Be-Bop-A-Lula  (1957)\n           6. GENE VINCENT  -  Roll Over Beethoven  (1959)\n           7. THE BEATLES   -   Roll Over Beethoven  (1964)\n           8. THE BEATLES   -   Long Tall Sally  (1964) \n           9. THE BEATLES   -   Rock And Roll Music  (1964)\n\n\n\n         Chuck Berry (1926) is one of the pioneers of rock and roll music. With songs such as &quot;Maybellene&quot; (1955), &quot;Roll Over Beethoven&quot; (1956), &quot;Rock and Roll Music&quot; (1957) and &quot;Johnny B. Goode&quot; (1958), Chuck Berry refined and developed rhythm and blues into the major elements that made rock and roll distinctive, with lyrics focusing on teen life and consumerism and utilizing guitar solos and showmanship that would be a major influence on subsequent rock music\n         In May 1955, Berry traveled to Chicago where he met Muddy Waters, who suggested he contact Leonard Chess of Chess Records. Berry thought his blues material would be of most interest to Chess, but to his surprise it was an old country and western recording by Bob Wills, entitled &quot;Ida Red&quot; that got Chess's attention. Chess had seen the rhythm and blues market shrink and was looking to move beyond it, and he thought Berry might be the artist for that purpose. So on May 21, 1955 Berry recorded an adaptation of &quot;Ida Red&quot; - &quot;Maybellene&quot; - which featured Johnnie Johnson on piano, Jerome Green (from Bo Diddley's band) on the maracas, Jasper Thomas on the drums and Willie Dixon on the bass. &quot;Maybellene&quot; sold over a million copies, reaching #1 on Billboard's Rhythm and Blues chart and #5 on the 10 September 1955 Billboard Best Sellers in Stores chart.At the end of June 1956, his song &quot;Roll Over Beethoven&quot; reached #29 on the Billboard Top 100 chart, and Berry toured as one of the &quot;Top Acts of '56&quot;. In late 1957 Berry took part in Alan Freed's &quot;Biggest Show of Stars for 1957&quot; United States tour with the Everly Brothers, Buddy Holly, and others.The hits continued from 1957 to 1959, with Berry scoring over a dozen chart singles during this period, including the top 10 U.S. hits &quot;School Days&quot;, &quot;Rock and Roll Music&quot;, &quot;Sweet Little Sixteen&quot;, and &quot;Johnny B. Goode&quot;. He appeared in two early rock and roll movies. The first was 'Rock Rock Rock&quot;, released in 1956. He is shown singing &quot;You Can't Catch Me.&quot; He had a speaking role as himself in the 1959 film &quot;Go, Johnny, Go!&quot; along with Alan Freed, and was also shown performing his songs &quot;Johnny B. Goode,&quot; &quot;Memphis, Tennessee,&quot; and &quot;Little Queenie.&quot; His performance of &quot;Sweet Little Sixteen&quot; at the Newport Jazz Festival in 1958 is captured in the motion picture &quot;Jazz on a Summer's Day&quot;.\n\n         &quot;Lucille&quot; is a 1957 rock and roll song which was one of Little Richard's international hits.Released on Specialty Records in February 1957, Little Richard's single made number 21 on the US pop chart, and number 10 on the UK chart. It was composed by Albert Collins and Little Richard.As a rock standard, it has been covered live and/or recorded by thousands of artists including AC/DC, Status Quo, Wings, The Beatles, The Hollies, The Animals, Paul McCartney, Van Halen, Johnny Winter, The Flying Burrito Brothers, Peter &amp; Gordon, Queen, Deep Purple, the Ian Gillan Band, The Everly Brothers, Waylon Jennings, Kenny Rogers, Bill Haley &amp; His Comets, Otis Redding, The Sonics, John Entwistle of The Who, and the Detroit band The Rockets. The song is ranked 670th on Dave Marsh's list of The 1001 Greatest Singles Ever Made\n\n         Gene Vincent, was an American musician who pioneered the styles of rock and roll and rockabilly.  In 1956 he wrote &quot;Be-Bop-A-Lula&quot;, No. 102 on Rolling Stone magazine's &quot;500 Greatest Rock and Roll Songs of All Time&quot; list .This top ten hit with his Blue Caps is considered a significant early example of rockabilly.   He is a member of the Rock and Roll and Rockabilly Halls of Fame. After &quot;Be-Bop-A-Lula&quot; became a hit, Gene Vincent and His Blue Caps were unable to follow it up with the same level of commercial success, but released critically-acclaimed songs like &quot;Race With The Devil&quot; (No. 96 in Billboard) and &quot;Bluejean Bop&quot; (No. 49). That year, Vincent was reportedly convicted of public obscenity and fined $10,000 by the state of Virginia for his live performance of the erotic song, &quot;Woman Love&quot;, although this is now believed to have been a rumor, possibly started by his manager.He was the first inductee into the Rockabilly Hall of Fame upon its formation in 1997. The following year he was inducted into the Rock and Roll Hall of Fame.\n\n\n From Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:b39109e02771d45449ad158bc4265a6a9c0f2a5b","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+277","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39109e02771d45449ad158bc4265a6a9c0f2a5b","infoHashBuffer":{"type":"Buffer","data":[179,145,9,224,39,113,212,84,73,173,21,139,196,38,90,106,156,15,42,91]},"announce":[],"urlList":[]}}