{"title":"Democracy Now - 20 dec 2010","uid":6054763,"size":448105675,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b3ebbcf901ccb0e94bdd33261226c57f0559f842&amp;dn=Democracy+Now+-+20+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1292862438,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 20, 2010\n\n- S. Korea Conducts Live-Fire Military Drill\n- Senate Strikes Down Don't Ask, Don't Tell Policy\n- Senate GOP Blocks DREAM Act\n- Local Community Radio Act Passes in Senate\n- VP Biden: Assange is a &quot;High-Tech Terrorist&quot;\n- Assange: Chief Concern is Threat of Extradition to U.S.\n- 50 Killed in Post-Election Violence in Ivory Coast\n- Anti-crime Crusader Killed in Mexico\n- Human Rights Watch Criticizes Israel's Policy in Occupied West Bank\n- Study: Supreme Court Increasingly Siding With Big Business\n- Arizona and Nevada Sue Bank of America For Fraud\n- NAACP Protests in South Carolina Over Events Celebrating Secession\n\n\nSpecial reports\n\n- In Historic Move, Senate Votes to Repeal &quot;Don't Ask, Don't Tell&quot;\n\nThe Senate voted 63 to 31 on Thursday to repeal the military's &quot;Don't Ask Don't Tell&quot; policy. Eight Republicans joined with Democrats to approve the repeal and send the measure to President Obama for his signature. The bill passed in the House last week. We speak with former Navy commander Zoe Dunning. Until her retirement three years ago, she was thought to be the only openly gay person serving in the U.S. military.\n\n\n- Chris Hedges: Obama is a &quot;Poster Child for the Death of the Liberal Class&quot;\n\nThe compromise tax-cut deal that President Obama signed into law on Friday has angered many of his supporters. In his new book, Death of the Liberal Class, Pulitzer prize-winning journalist and author Chris Hedges argues that the failure of President Obama to represent the interests of his supporters is just another example of a quickly-dying liberal class. In the book, Hedges explains how the five pillars of the liberal class: the press, universities, unions, liberal churches and the Democratic Party have become corrupt.\n\n\n- Naomi Wolf vs. Jaclyn Friedman: A Feminist Debate on the Sexual Allegations Against Julian Assange\n\nAs more details emerge about the sex crimes allegations against WikiLeaks founder Julian Assange, we host a debate between two feminists: Jaclyn Friedman argues the sexual-assault allegations shouldn't be dismissed just because they're politically motivated while Naomi Wolf says, by going after Assange, the state is not embracing feminism, it's &quot;pimping&quot; it.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b3ebbcf901ccb0e94bdd33261226c57f0559f842","amp;dn":"Democracy+Now+-+20+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3ebbcf901ccb0e94bdd33261226c57f0559f842","infoHashBuffer":{"type":"Buffer","data":[179,235,188,249,1,204,176,233,75,221,51,38,18,38,197,127,5,89,248,66]},"announce":[],"urlList":[]}}