{"title":"(Blues) Crying Sam Collins - Jailhouse Blues","uid":6046879,"size":105935104,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b413d5bebe25a6048bad19a5c6c0f47d6322b8f1&amp;dn=%28Blues%29+Crying+Sam+Collins+-+Jailhouse+Blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":-1,"time":1292545992,"description":"mp3   320kbps\n\n\nAlbum: Jailhouse Blues\nStyles: Country blues, Delta blues\nReleased: 1990\nLabel: Yazoo\n\n\n1. Devil in The Lion's Den [2:43]\n2. Slow Mama Slow [3:05]\n3. The Jailhouse Blues [2:32]\n4. Riverside Blues [2:37]\n5. New Salty Dog [2:58]\n6. Yellow Dog Blues [2:31]\n7. Pork Chop Blues [2:39]\n8. Dark Cloudy Blues [2:48]\n9. Hesitation Blues [2:40]\n10. It Won't Be Long [2:40]\n11. Do That Thing [2:33]\n12. I Want To Be Like Jesus In My Heart [2:48]\n13. Loving Lady Blues [2:42]\n14. Midnight Special Blues [2:40]\n15. Lead Me All The Way [2:42]\n16. Graveyard Digger's Blues [3:18]\n\n\nKnown as &quot;Crying&quot; Sam Collins, after the eerie, falsetto quality of his voice, the artist in fact had many nicknames. A rather prolific recording artist, less than half of the 50 sides he cut saw release. Often the same tune would crop up on different labels necessitating a variety of pseudonyms (including &quot;Bunny Carter,&quot; &quot;Big Boy Woods,&quot; and &quot;Salty Dog Sam&quot;). Jailhouse Blues collects the bulk of the guitarist's commercially released output. Perhaps not as expressive or emotionally exhilarating as the &quot;hard&quot; Mississippi Delta singers, Collins' voice has an accessible, undeniable beauty. His guitar accompaniment proves a mastery of the basic slide and fingerpicking skills, delivered with a rough but pleasant style. These elements were combined with a compelling set of influences (intentional or otherwise) that came together in his music. For one, Collins probably picked up a lot from listening to recordings and performers from the area. His songs are filled with common, stock blues phrases delivered without a great degree of personal reconfiguring. &quot;Hesitation Blues,&quot; a popular song from the period, is given a raw, swift rendition. The guitar line follows his singing, but he ends his phrases with deep, hard chords that contrast his high vocal. Other songs are approached in a similar manner. On &quot;Midnight Special,&quot; the pace is almost rushed. Collins' vocal on both songs bears a striking resemblance to Skip James (at times, Collins actually sounds strikingly like a woman). The connection is made stronger by the fact that Collins' &quot;Lead Me All the Way&quot; has been performed by James as &quot;Jesus Is a Mighty Good Leader.&quot; More unusual, however, are the strains of white music that run through Collins' style of Mississippi blues. On &quot;It Won't Be Long,&quot; for instance, his characteristic vibrato and natural blues phrasing are less prominent, creating a bizarre mix of white and black delivery. \n\n","torrent":{"xt":"urn:btih:b413d5bebe25a6048bad19a5c6c0f47d6322b8f1","amp;dn":"%28Blues%29+Crying+Sam+Collins+-+Jailhouse+Blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b413d5bebe25a6048bad19a5c6c0f47d6322b8f1","infoHashBuffer":{"type":"Buffer","data":[180,19,213,190,190,37,166,4,139,173,25,165,198,192,244,125,99,34,184,241]},"announce":[],"urlList":[]}}