{"title":"Coast to Coast AM - 10 - 24 - 10 - Ancient UFOs &amp; Disclosure","uid":5957713,"size":57334672,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b4f6dcba028cf4def85e937dccff5e54ca96c117&amp;dn=Coast+to+Coast+AM+-+10+-+24+-+10+-+Ancient+UFOs+%26+Disclosure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":4,"time":1289800898,"description":"Ancient UFOs &amp; Disclosure\n\nDate: 10-24-10\nHost: George Knapp\nGuests: Jacques F. Vallee, Richard Dolan, Bryce Zabel\n\nIn the first half of the program, George Knapp was joined by legendary Ufologist Jacques Vallee for a discussion on UFO sightings from biblical-era antiquity through the year 1879. Contrary to the opinions of skeptics who discount such sightings as mere folklore, Vallee contended that the longevity of the tales merits more serious examination. &quot;For them to have been recorded, the way they were recorded, they had to be felt to be very important to that civilization,&quot; he said. Additionally, Vallee noted that most of the material in the book comes from accounts recorded by officials like kings and bishops, since, often, they were the only people capable of actually documenting and preserving their sightings. Over the course of the conversation, Vallee also talked about his research into remote viewing and provided his take on topics like the Extraterrestrial Hypothesis (ETH), crash retrievals and disclosure.\n\nDetailing one of the cases profiled in the book, Vallee described a sighting from 1277 in China. In this case, the witness described a very bright star that appeared to have a dome above it, moved &quot;in a zigzag, like a dead leaf,&quot; interacted with other flying objects, and disappeared. An amused Vallee noted that &quot;I get letters like this from readers of my books today, with almost the same words.&quot; Having examined over 500 cases for his new book, the esteemed researcher confessed that &quot;one of the secret pleasures of working with this material is to look at how people explained it.&quot; To that end, he observed that even during these classic cases, &quot;there was always some wise guy in the crowd who had an explanation,&quot; often ascribing the event to a political or religious meaning. &quot;They had all these explanations, just like the Air Force today,&quot; observed Vallee.\n\n-----------------------------------\n\nIn the latter half of the show, authors Richard Dolan and Bryce Zabel talked their new book After Disclosure, which examines what life will be like after UFO and alien disclosure. They contended that the revelation of UFO truth is an inevitability. &quot;There's going to be a time, a day, a moment, an event,&quot; Dolan said, &quot;something in which the powers that be are forced to make the decision to disclose.&quot; From there, Zabel surmised, &quot;when they do decide they have to give it up, because events are spinning out of their own control, they'll try to manage it, even as it goes public.&quot; Having looked at the various possible scenarios where UFO disclosure becomes a necessity, the authors determined that a mass UFO sighting recorded by modern technology would be the most likely event.\n\nDetailing how they think UFO disclosure would unfold, the authors boldly speculated that the announcement would occur on a Friday afternoon. They theorized that this timing would be used to off-set potential stock market instability and also allow for the general public to use the weekend to digest the stunning news. The duo traced the disclosure announcement from the first day, which they foresee as a moment of confusion and potential fear, to the first week, when people would begin asking questions about why and how this news remained secret for so long. Ultimately, they contend that, while the first year will be &quot;a bumpy ride,&quot; society will eventually stabilize as it becomes acclimated to the new world that has emerged from the veil of secrecy. However, the duo acknowledged that the entire disclosure process would be predicated on a delicate balance between the agendas the secret keepers, the visitors, and the general public.","torrent":{"xt":"urn:btih:b4f6dcba028cf4def85e937dccff5e54ca96c117","amp;dn":"Coast+to+Coast+AM+-+10+-+24+-+10+-+Ancient+UFOs+%26+Disclosure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4f6dcba028cf4def85e937dccff5e54ca96c117","infoHashBuffer":{"type":"Buffer","data":[180,246,220,186,2,140,244,222,248,94,147,125,204,255,94,84,202,150,193,23]},"announce":[],"urlList":[]}}