{"title":"Travie McCoy - Need You (2nafish)","uid":5998418,"size":131975172,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b63b597369bcafcff88d0ee3d2ca4cef7c5d9dbc&amp;dn=Travie+McCoy+-+Need+You+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1291110044,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos.\n\n\n&quot;Need You&quot; is the second US single by Travie McCoy from his album Lazarus. The song was produced by Lucas Secon and written by Travie McCoy himself, Lucas Secon, Wayne Hector and Cartsen Mortensen.\n\nThe music video for &quot;Need You&quot; was released on October 20, 2010 and was shot in Los Angeles.\n\nThe plot is about McCoy wandering in Chinatown looking for his girlfriend.\n\nLazarus is the debut album by Travie McCoy, better known as the frontman and vocalist of Gym Class Heroes. It was released on July 8, 2010. The artwork cover was designed by Brent Rollins. The album's title is taken from Travie's middle name, which is of Hebrew origin meaning &quot;God is my help.&quot;\n\nThe first single titled &quot;Billionaire&quot; was released at March 9 on iTunes featuring Bruno Mars. The Smeezingtons produced the song and it debuted on the Billboard Hot 100 at 92. It has since reached a peak of 4 on the chart. The next single, Need You, was released to Mainstream Radio on September 14, 2010. The song maintained a peak of 6 in the Bubbling Under Hot 100 Singles. Producer Chad Beatz (Tastemaker Music) produced a song titled &quot;Don't Pretend&quot; which features Colin Munroe. &quot;We'll Be Alright&quot; was also released to the public via Pete Wentz on May 17, 2010 on his blog. The aforementioned single is produced by The Smeezingtons and The Stereotypes and samples the Supergrass song &quot;Alright&quot;.\n\nTravis Lazarus &quot;Travie&quot; McCoy (born August 5, 1981) is the lead vocalist of the alternative hip-hop band Gym Class Heroes. He released his first solo album, Lazarus, on June 8, 2010. The lead single from the album, &quot;Billionaire&quot;, peaked at #4 on the Billboard Hot 100 and #3 on the UK Singles Chart. The single was certified double platinum by the Recording Industry Association of America.\n\nMcCoy was born and raised in Geneva, New York. His father is Haitian, and his mother is of Irish and Native American ancestry. In high school, he met future bandmate Matt McGinley in his gym class and the two bonded over a common interest in music, mostly punk rock, indie rock and hip hop. They decided to start a band and played with other musicians until Gym Class Heroes was formed in 2001.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b63b597369bcafcff88d0ee3d2ca4cef7c5d9dbc","amp;dn":"Travie+McCoy+-+Need+You+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b63b597369bcafcff88d0ee3d2ca4cef7c5d9dbc","infoHashBuffer":{"type":"Buffer","data":[182,59,89,115,105,188,175,207,248,141,14,227,210,202,76,239,124,93,157,188]},"announce":[],"urlList":[]}}