{"title":"Democracy Now - 05 nov 2010","uid":5936192,"size":455019138,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b648b7f75f4047c65ae2c86e4d54da3f53b1d69d&amp;dn=Democracy+Now+-+05+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1288970550,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 05, 2010\n\n- Tropical Storm Brings Heavy Rains to Haiti\n- UN Troops May Have Carried Cholera Strain\n- Sen. Murray Re-Elected in Washington\n- Obama to Host Congressional Leaders, Leaves for Asia Trip\n- Wall Street Moguls Funded Pro-GOP Rove Group\n- Quinn Projected to Win Illinois Gov. Race\n- JPMorgan Chase Resumes Foreclosures\n- US War Contractor Settles Overbilling Case\n- WikiLeaks Renews Call for US Probe\n- Sahrawis Stage Protest Camp against Moroccan Occupation\n- Bush Admits Authorizing Waterboarding of Alleged 9/11 Mastermind\n- Nation's First Transgender Judge Elected in California\n\n\n\nSpecial reports\n\n- New $600B Fed Stimulus Fuels Fears of U.S. Currency War\n\nThe Federal Reserve will pump $600 billion more into the U.S. economy and keep interest rates at historical low levels. The short-term impact of the Fed's move-known as quantitative easing-has been a jump in stock prices across the globe. Many nations, however, have accused the United States of waging a currency war by devaluing the dollar. We speak to former Wall Street economist and University of Missouri Professor Michael Hudson. &quot;The object of warfare is a takeover a country's land, raw materials, and assets and grab them,&quot; Hudson says. &quot;In the past, this used to be done militarily by invading them. Today, you can do it financially simply by creating credit, which is what the Federal Reserve has done.&quot;\n\n\n- Justice for Sale? Right-Wing Groups Fund Successful Campaign to Oust Iowa Judges Who Legalized Same-Sex Marriage\n\nThe unprecedented ouster of three Supreme Court justices in Iowa who ruled in favor of same-sex marriage is raising fresh concerns over the politicization of judicial elections and the influence of special interest groups on the courts. Opponents of same-sex marriage targeted the judges in an intense campaign to boot them off the bench. We speak to attorney Adam Skaggs of the Brennan Center for Justice at New York University School of Law and Carolyn Jenison of One Iowa, the state's largest LGBT advocacy organization.\n\n\n- Rep. Alan Grayson: &quot;Bi-Partisanship Has Become Code Word for Appeasement&quot;\n\nIn the wake of the Democrats' mid-term losses, President Obama has said the way forward lies in finding common ground between Democrats and Republicans. But Democratic Rep. Alan Grayson, who lost his seat in Florida's 8th district, says that the losses suffered by incumbent Democrats are an outcome of the party's &quot;strategy of appeasement.&quot;\n\n\n- Justice Dept. Renews Enforcement of Subpoenas for Anti-War Activists Targeted in FBI Raids\n\nWe get an update on the fallout from the FBI raids in late September that targeted antiwar activists in Minneapolis and Chicago. Subpoenas to appear before a grand jury were served on 13 people, but later withdrawn when the activists asserted their right to remain silent. But this week the Department of Justice said it intends to enforce the subpoenas for some of them and require them to appear before a grand jury.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b648b7f75f4047c65ae2c86e4d54da3f53b1d69d","amp;dn":"Democracy+Now+-+05+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b648b7f75f4047c65ae2c86e4d54da3f53b1d69d","infoHashBuffer":{"type":"Buffer","data":[182,72,183,247,95,64,71,198,90,226,200,110,77,84,218,63,83,177,214,157]},"announce":[],"urlList":[]}}