{"title":"Michael W. Smith - There She Stands (Xvid-2nafish)","uid":5999030,"size":53630222,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b65e3a680e2fe23a8cf787990207e7adb38e97b2&amp;dn=Michael+W.+Smith+-+There+She+Stands+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1291077917,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:59\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1661 Kbps\nQuality Factor : 0.33 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\nMichael W. Smith was born on October 7, 1957. Smith is a Grammy Award-winning American singer-songwriter, composer, and actor. He is one of the best-selling and most influential artists in Contemporary Christian music. Smith also has achieved a considerable amount of success in the mainstream music industry. Smith is a three-time Grammy Award winner, and has earned 40 Dove Awards. Over the course of his career, Michael W. Smith has sold more than 13 million albums and recorded 29 #1 Hit songs, fourteen gold albums, and five platinum albums. Smith is an American Music Award recipient; he was also named one of People magazine's &quot;Most Beautiful People&quot;.\n\nIn 1981, Smith was signed as a writer to Meadowgreen Music, where he racked up a number of highly successful gospel hits penned for artists like Sandi Patty, Kathy Troccoli, Bill Gaither, and Amy Grant. Some of these worship songs can be found in church hymnals. The following year, Smith began touring as a keyboardist for Grant on her Age to Age tour. He would eventually become Grant's opening act and recorded his first Grammy nominated solo album: The Michael W. Smith Project (which he also produced), in 1983, on the Reunion Records label; a label started by Grant's brother-in-law, Dan Harrell, along with Michael Blanton. This album contained the first recording of his hit &quot;Friends&quot;, which he co-wrote with his wife Deborah. They wrote it one afternoon for a friend who was moving away.\n\nBy the time Smith's second pop album was released in 1984, he was headlining his own tours. In 1986, Smith released the critically acclaimed rock album The Big Picture, with well known record producer Johnny Potoker (Brian Eno, Genesis, Madonna, No Doubt, Talking Heads, etc.). On a track titled &quot;Tearing Down The Walls&quot; from The Big Picture, Smith intros with an Amy Grant recording of &quot;Emmanuel&quot; played backwards via the CD search button. He has explained that he and Potoker were trying to come up with a different way to go into the song.\n\nAfter the release of his 1988 effort, i 2 (EYE), Smith once again teamed up with Grant for her &quot;Lead Me On World Tour&quot;. The following year, Smith recorded his first Christmas album.\n\nIn 1996, Smith opened his own record label, Rocketown Records, named for a song on The Big Picture. He does not personally record on it. He states the label is driven by the artists, and the first artist signed was Chris Rice, who had written &quot;Go Light Your World&quot;, a #1 hit song by Kathy Troccoli, in 1995. In 1999, Smith collaborated with Jim Brickman on &quot;Love of My Life&quot; from the album Destiny, which went to #9 on the Hot Adult Contemporary Tracks.\n\nNearly all of Smith's albums contain at least one instrumental track, and in 2000, Smith recorded his first all instrumental album, Freedom. The following year, Smith released an all Christian music album, Worship, on September 11. This album was followed by a sequel, Worship Again in 2002, recorded live at Southeast Christian Church in Louisville, KY. Both albums were recorded live in concert. (Both are also the only two albums to be composed almost entirely of songs he did not write himself). A Worship DVD, which comprised a selection of songs from both albums, was recorded live in Edmonton, Alberta at YC Alberta and released in 2002. It immediately topped the Billboard video charts and went gold in both the U.S. and Canada.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b65e3a680e2fe23a8cf787990207e7adb38e97b2","amp;dn":"Michael+W.+Smith+-+There+She+Stands+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b65e3a680e2fe23a8cf787990207e7adb38e97b2","infoHashBuffer":{"type":"Buffer","data":[182,94,58,104,14,47,226,58,140,247,135,153,2,7,231,173,179,142,151,178]},"announce":[],"urlList":[]}}