{"title":"Papa Roach - Burn (2nafish)","uid":6072952,"size":132560900,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b691b55696b3335d6ee0350c75051ef937fa0c74&amp;dn=Papa+Roach+-+Burn+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1293705047,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nTime for Annihilation...On the Record and On the Road is the seventh studio album and first live album by California rock band Papa Roach. It was released on August 31, 2010. Jerry Horton said in a blog on the band's official website that they recorded it on the last run of the tour with Shinedown. Later, Jacoby Shaddix reported on the site that five entirely new tracks had been written and would be studio recorded and released with the Time for Annihilation album. The first single, &quot;Kick In the Teeth&quot;, was released on June 22, 2010. The album's name is a lyric quote from the song &quot;Crash&quot; from the band's 2006 album, The Paramour Sessions.\n\nOn April 17, the band played a new song called &quot;Burn&quot; at the Chili Cook Off. On April 30, the band played another new song called &quot;Kick In the Teeth&quot;. The band announced that &quot;Kick In the Teeth&quot; would be the new single.\n\nAmazon.com confirmed that &quot;Kick In the Teeth&quot; would be released as a single on June 22. On June 30, the official video for &quot;Kick In the Teeth&quot; was released on Vevo and YouTube. &quot;Kick In the Teeth&quot; was used on SportsCenter on August 17. The song debuted at number 15 on the UK Rock chart.\n\nOn August 31, the band confirmed that the next singles would be &quot;Burn&quot; and &quot;No Matter What&quot;. On September 2, Jacoby tweeted that the band had wrapped up filming the video for &quot;No Matter What&quot;, saying that it was possibly the best video the band had ever made. Filming for the video of &quot;Burn&quot; took place on September 5. The music video for &quot;Burn&quot; was released on October 28, and is now the current single.\n\nIn January 2010, the band also said on their website that they would release 'Big News' soon. In February, Jerry Horton confirmed that the 'Big News' was the announcement of a live album, which they recorded during five shows of their 2009 co-headlining tour with Shinedown. They were also recording five new songs for it, making it a combination of a studio and a live album.\n\nIn March, Jacoby said he was recording vocals for songs called &quot;Nemesis&quot; and &quot;No Matter What&quot;. That month, the band also released the teaser for the live album, confirming the release date to be in the summer of 2010. In June, on Nikki Sixx's radio show, Sixx Sense, Jacoby confirmed that one of the new songs was called &quot;One Track Mind&quot;. The song was previously titled &quot;Nemesis&quot; but was changed to &quot;One Track Mind&quot; after Jacoby changed the chorus of the song.\n\nOn June 29, the band's former label, Geffen Records, released a greatest hits compilation of the band's biggest hits, titled ...To Be Loved: The Best of Papa Roach. The band, however, told fans not to buy it.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b691b55696b3335d6ee0350c75051ef937fa0c74","amp;dn":"Papa+Roach+-+Burn+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b691b55696b3335d6ee0350c75051ef937fa0c74","infoHashBuffer":{"type":"Buffer","data":[182,145,181,86,150,179,51,93,110,224,53,12,117,5,30,249,55,250,12,116]},"announce":[],"urlList":[]}}