{"title":"Imparable (2010) [TS-Screener][Spanish]","uid":5956192,"size":750575616,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b6cfed585ab5493244818f845a32a9cc6a2044d8&amp;dn=Imparable+%282010%29+%5BTS-Screener%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":-1,"time":1289730469,"description":"Imparable (2010) [TS-Screener][Spanish]\n &lt;a href=&quot;\nhttp://www.imparablelapelicula.es/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imparablelapelicula.es/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0477080/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0477080/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.elseptimoarte.net/peliculas/unstoppable-342.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elseptimoarte.net/peliculas/unstoppable-342.html&lt;/a&gt;\n\nIdioma: Castellano\nCalidad: TS-Screener\nTÃƒÂ­tulo: Imparable\nTÃƒÂ­tulo original: Unstoppable\nPaÃƒÂ­s: USA \nEstreno en USA: 12/11/2010 \nEstreno en EspaÃƒÂ±a: 12/11/2010\nGenero: Accion, Drama, Thriller\nDuracion: 100 Min. \nProductora: 20th Century Fox \nDirector: Tony Scott \nGuiÃƒÂ³n: Mark Bomback \nReparto: Denzel Washington, Chris Pine, Rosario Dawson, Kevin Chapman, Ethan Suplee, Jessy Schram, Kevin Dunn, Elizabeth Mathis, David Warshofsky, Meagan Tandy, Jeff Wincott, Andy Umberger, Lew Temple, T.J. Miller\nCalificaciÃƒÂ³n: No recomedada para menores de 7 aÃƒÂ±os\n\n\nSinopsis:\nUn veterano mecÃƒÂ¡nico ferroviario (Denzel Washington) y un joven conductor (Chris Pine) luchan en una carrera contra reloj para detener un tren incontrolado sin conductor, como si fuera un misil del tamaÃƒÂ±o de un edificio, y asÃƒÂ­ evitar que se produzca el desastre en una zona densamente poblada. \n\nEl 12 de octubre despierta con las habituales prisas de la madrugada en la EstaciÃƒÂ³n Fuller de Wilkins, Pensilvania. El turno de noche estÃƒÂ¡ ansioso por irse a casa y los miembros de la plantilla del turno de maÃƒÂ±ana se aprestan a entrar a trabajar, todavÃƒÂ­a con el cafÃƒÂ© en la mano. Cuando dos operarios se toman un descanso para engullir su desayuno, se ven interrumpidos y se les pide que pasen uno de los mÃƒÂ¡s modernos trenes de la lÃƒÂ­nea a una vÃƒÂ­a diferente. Parece que la EstaciÃƒÂ³n Fuller va a recibir a un grupo de chicos de escuela primaria de visita de campo que proviene de Olean, Nueva York. Disgustados pero sin inquietarse, los operarios de la estaciÃƒÂ³n se disponen a la tarea de mover el 777, una completa bestia de tren, cuando uno de ellos toma la desgraciada decisiÃƒÂ³n de coger un atajo con la intenciÃƒÂ³n de realizar el trabajo mÃƒÂ¡s aprisa. Pero mÃƒÂ¡s aprisa no siempre es lo mÃƒÂ¡s seguro, por lo que la nueva locomotora equipada con lo ÃƒÂºltimo en sistemas informÃƒÂ¡ticos y que arrastra treinta y nueve vagones, se transforma en un monstruo en un abrir y cerrar de ojos. \n\nA trescientos kilÃƒÂ³metros por la vÃƒÂ­a, en la EstaciÃƒÂ³n de Migo en Brewster, el dÃƒÂ­a comienza con la misma rutina. Mientras se disponen a dejar su puesto, la vieja guardia de ferroviarios comparte la ÃƒÂºltima taza de cafÃƒÂ© mientras se ocupa del papeleo. Mientras intercambian historias de guerra sobre sosas actuaciones de inspectores y ayudantes novatos, Frank Barnes descubre que su inspector es Will Colson, una nueva incorporaciÃƒÂ³n polÃƒÂ­tica. Frank no estÃƒÂ¡ para nada contento con la situaciÃƒÂ³n, pero se guarda para sÃƒÂ­ su opiniÃƒÂ³n al respecto. Una vez a bordo de la 1206, una vieja y dura locomotora de seis ejes, con muchos kilÃƒÂ³metros encima, Frank se dedica a su trabajo al cien por cien, dejando muy claro a Will que sus veintiocho aÃƒÂ±os de servicio siempre le ganarÃƒÂ¡n a los cuatro meses de trabajo de Will en cualquier ocasiÃƒÂ³n. \n\nA pesar de las pequeÃƒÂ±as circunstancias del dÃƒÂ­a, nadie en las dos estaciones de maniobras podÃƒÂ­a sospechar que la tarde pudiera convertirse en la aterradora y dura prueba que se les iba a venir encima, una situaciÃƒÂ³n que pondrÃƒÂ­a a prueba el coraje de dos hombres que se convertirÃƒÂ¡n en hÃƒÂ©roes extraordinarios.\n","torrent":{"xt":"urn:btih:b6cfed585ab5493244818f845a32a9cc6a2044d8","amp;dn":"Imparable+%282010%29+%5BTS-Screener%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6cfed585ab5493244818f845a32a9cc6a2044d8","infoHashBuffer":{"type":"Buffer","data":[182,207,237,88,90,181,73,50,68,129,143,132,90,50,169,204,106,32,68,216]},"announce":[],"urlList":[]}}