{"title":"Dantes Inferno [R.Free][Spanish][Xbox360][www.consolasatope.com]","uid":6072160,"size":6931476342,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:b6fbc9ea2095ebe51da0970ce8c308f9aecf0311&amp;dn=Dantes+Inferno+%5BR.Free%5D%5BSpanish%5D%5BXbox360%5D%5Bwww.consolasatope.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":74,"time":1293671822,"description":"Dante's Inferno, transportarÃƒÂ¡ a los jugadores al MÃƒÂ¡s AllÃƒÂ¡ recreado por el poeta italiano Dante Alighieri en el S.XIII en la primera parte del clÃƒÂ¡sico, &quot;La Divina Comedia&quot;.\nDante's Inferno cuenta la historia de Alighieri y su representaciÃƒÂ³n del infierno en este juego de acciÃƒÂ³n en 3Ã‚Âª persona. Los jugadores se pondrÃƒÂ¡n en la piel de Dante, que desciende al infierno despuÃƒÂ©s de encontrar el cadÃƒÂ¡ver de su amada Beatrice. Dante se pondrÃƒÂ¡ manos a la obra para rescatar a Beatrice, pero pronto se da cuenta de que en el infierno tendrÃƒÂ¡ que enfrentarse a sus propios demonios y en definitiva, salvarse a sÃƒÂ­ mismo.\nLos jugadores llevarÃƒÂ¡n a Dante a travÃƒÂ©s de los Nueve CÃƒÂ­culos del infierno, tal y cÃƒÂ³mo los describiÃƒÂ³ Alighieri: limbo, lujuria, gula, codicia, ira, herejÃƒÂ­a, violencia, fraude y traiciÃƒÂ³n. Cada cÃƒÂ­rculo tiene una caracterizaciÃƒÂ³n diferente, con demonios, monstruos y toda una geografÃƒÂ­a sacada directamente de las geniales descripciones del poema original. Con el fin de derrotar a los demonios del infierno, Dante lleva consigo dos armas: la GuadaÃƒÂ±a que coge de la muerte y la Santa Cruz, regalo de Beatrice, y con poderes espirituales que ayudarÃƒÂ¡n a Dante a recopilar almas y a romper los maleficios de las criaturas que intentan derrotarle. El juego tambiÃƒÂ©n se caracteriza por la posibilidad de personalizar las habilidades de Dante en su lucha contra las bestias del infierno. Si Dante logra domarlas, podrÃƒÂ¡ ir modificando su destino. Desarrollado con la misma tecnologÃƒÂ­a con la que fue creado Dead Space, el viodeojuego Dante's Inferno proporciona una experiencia de combate muy fluida a 60 frames por segundo, un tÃƒÂ­tulo obligado para los amantes del gÃƒÂ©nero de acciÃƒÂ³n y aventura.\n\n","torrent":{"xt":"urn:btih:b6fbc9ea2095ebe51da0970ce8c308f9aecf0311","amp;dn":"Dantes+Inferno+%5BR.Free%5D%5BSpanish%5D%5BXbox360%5D%5Bwww.consolasatope.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6fbc9ea2095ebe51da0970ce8c308f9aecf0311","infoHashBuffer":{"type":"Buffer","data":[182,251,201,234,32,149,235,229,29,160,151,12,232,195,8,249,174,207,3,17]},"announce":[],"urlList":[]}}