{"title":"Excavadores De Huesos.(Docu.Spanish).","uid":6082439,"size":577654784,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:b721a797bb5a1b2643df3048fd5cb2defe898eba&amp;dn=Excavadores+De+Huesos.%28Docu.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cholo24","files":1,"time":1294172221,"description":"Excavadores de huesos\n\nEn mayo de 2002, un intrepido grupo de espeleologos descubrio varias cuevas inexploradas en la Planicie de Nullarbor, una zona arida y hostil de Australia. La entrada de una de ellas, con una anchura verdaderamente reducida, dio paso a una cueva de inmensas dimensiones donde descubrieron unos huesos, en muy buen estado, de un animal aproximadamente dos veces el tamano de un leopardo.\n\nEste documental que Odisea presenta dara a conocer al depredador prehistorico mas fiero de los que se han hallado en todo el continente australiano: el Thylacoleo, cuyos restos han perdurado durante miles de siglos. Investigaciones cientificas llevadas a cabo durante todos estos anos, han revelado que el esqueleto de este leon marsupial puede tener hasta 500.000 anos, lo que supone que la magnifica resistencia de los huesos es casi milagrosa.\n\nSe ha descubierto tambien que sus caracteristicas no eran las propias de otros marsupiales y que se trataba de un formidable depredador con enormes dientes y un impresionante conjunto de garras.\n\nEl trabajo recrea, ademas, su cerebro, realiza analisis morfologicos y permite que la bestia Thylacoleo tome forma miles de anos despues de su muerte.\n","torrent":{"xt":"urn:btih:b721a797bb5a1b2643df3048fd5cb2defe898eba","amp;dn":"Excavadores+De+Huesos.%28Docu.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b721a797bb5a1b2643df3048fd5cb2defe898eba","infoHashBuffer":{"type":"Buffer","data":[183,33,167,151,187,90,27,38,67,223,48,72,253,92,178,222,254,137,142,186]},"announce":[],"urlList":[]}}