{"title":"Shank.Update.1-SKIDROW","uid":6005105,"size":7180823,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b87b63a29f0d3da61f5d609ca6d683da8992ecab&amp;dn=Shank.Update.1-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rlf-rls","files":-1,"time":1291296937,"description":"RELEASE DATE : 02-12-2010           PROTECTION : Steam                  \nGAME TYPE    : Action               DISKS      : CRACKED UPDATE \n\nRelease Notes: \n\nThe Skid Rowdies are looking new blood to fill up the ranks. \nWe're a professional team of dedicated sceners with big mark \nunder sceners. We believe on the ground idealism of the root \nof the real old school scene. We do all this for fun and \nnothing else. We don't earn anything on our hobby, as we do \nthis for the competition and the heart of what got the scene \nstarted in the mid eighties. \n\nIf you think you got something to offer, then don't hold back \nn contacting us as soon as possible. \n\n\n\ntwice the fun / double the trouble\n\n\nOn with the update release information:                       \n\nShank Update 1                                          \n\nFixed:                                                         \n\n1. Shank runs at double speed                               \n\nThis was caused by refresh rates that we didn't support. A fix \nas been made to add support for arbitrary refresh rates, and  \nthe game should run fine now.                               \n                                                                   \n2. Achievements not unlocking                                 \n\nThere were some instances where a disconnect from Steam would  \ncause users not to unlock a trophy. We put in a check so that \non level start it will award any trophies that you earned but  \nhaven't been awarded yet.                                   \n\nPlease note that we were unable to reproduce this issue in    \nhouse, so we have no way of knowing if this fix resolves the  \nissue. If it doesn't, honestly we're not sure how we would go \nabout resolving the problem.                                 \n\n3. Game does not load your save game                                                           \n\nSo far, we've been unable to reproduce this issue, but we made\nan educated guess and put in a possible fix.                                                            \n\nAdditionally, it's been reported that a workaround is to enter \na co-op game, then return to the main menu. This then resolves \nyour save/load issue.                                        \n\n4. Shank needs to activate every time we launch the game       \n\nWe've fixed this issue - in this update, activation will no    \nlonger be necessary.                                           \n\nAlso: After the update, a file related to activation may       \nremain on your machine. If this file is present on your       \nmachine and you wish to delete it, you will find it in your   \nshankbin folder. The file is named &quot;activation.x64.dll.&quot;   \n\n5. Game displays a black screen instead of gameplay           \n\nThis has been narrowed down to graphics cards that don't     \nsupport pixel shaded 3.0. Unfortunately, our game requires    \nps3.0 to run.                                                  \n\n6. Game loads, then shuts down immediately                  \n\nThe libraries that Shank uses requires SSE2 instructions. If   \nhis happens to you, then most likely your CPU does not       \nsupport SSE2. We now adding a warning so the game lets you    \nknow the reason it is shutting down. The most frequent example\nof this is the Athlon XP CPU.\n\nGreetings: \n\nSalutes to our old Amiga friends from: \n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX \nDCS - CRYSTAL - ZENITH - ACCESSSION - ALPHA FLIGHT - PRODIGY \nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC \n\nSalutes to our new friends in: \n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK \nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS","torrent":{"xt":"urn:btih:b87b63a29f0d3da61f5d609ca6d683da8992ecab","amp;dn":"Shank.Update.1-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b87b63a29f0d3da61f5d609ca6d683da8992ecab","infoHashBuffer":{"type":"Buffer","data":[184,123,99,162,159,13,61,166,31,93,96,156,166,214,131,218,137,146,236,171]},"announce":[],"urlList":[]}}