{"title":"Coast to Coast AM - 10 - 19 - 10 - Alternative Health &amp; Healing","uid":5955959,"size":55641422,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b9058bf41c7de227220bc579a490fba6b4316004&amp;dn=Coast+to+Coast+AM+-+10+-+19+-+10+-+Alternative+Health+%26+Healing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":4,"time":1289722569,"description":"Alternative Health &amp; Healing\n\nDate: 10-19-10\nHost: George Noory\nGuests: Dr. Leonard Horowitz, Fiona Horne\n\nAuthority on public health and consumer protection, Dr. Len Horowitz touched on a variety of topics including the dangers of vaccines, methods of natural healing, and how a spiritual renaissance is changing medicine. He also discussed the &quot;Illuminati&quot; agenda to reduce the world population, and the Denver Airport murals, which he said symbolically depict the New World Order agenda.\n\nHororwitz suggested that 528 hertz is a healing frequency that can help people relax and breathe better. &quot;In musicology, it's actually called ecstatic listening...and all of nature is celebrating that frequency of 528 hertz...It is the heart of the universe,&quot; he commented.\n\nRegarding natural remedies, he advocated a five-step process to combat disease: detoxification, alkalinization, boosting the immune system, oxygenation, and bio-energizing. The last step can be accomplished through prayer, sound, color, frequency, resonance, or music-- &quot;this creates an energy of spirituality that is impregnable...against infectious diseases,&quot; he stated. He also recommended OxySilver for eliminating infections, and hydrosonics-- water resonating at a certain frequency, for healing.\n\nHalloween &amp; Witchcraft\nFirst hour guest, witchcraft expert Fiona Horne talked about Halloween's connection to the ancient Celtic festival of Samhain, which is a time to contemplate the dead, and look at the seeds you are sowing in your life. She also shared tips on how to create a do-it-yourself seance, which involved placing nine candles in a circle, then an item of a deceased loved one inside the circle. Horne will be appearing at Halloween event in North Hollywood on the 31st.","torrent":{"xt":"urn:btih:b9058bf41c7de227220bc579a490fba6b4316004","amp;dn":"Coast+to+Coast+AM+-+10+-+19+-+10+-+Alternative+Health+%26+Healing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9058bf41c7de227220bc579a490fba6b4316004","infoHashBuffer":{"type":"Buffer","data":[185,5,139,244,28,125,226,39,34,11,197,121,164,144,251,166,180,49,96,4]},"announce":[],"urlList":[]}}