{"title":"Paul McCartney - Get Back (Version 3) (2nafish)","uid":5961292,"size":142977028,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b90bd72ceec86a6023afb8bcd7b5e06afde02826&amp;dn=Paul+McCartney+-+Get+Back+%28Version+3%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1289962217,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Get Back&quot; is a song by The Beatles, written primarily by Paul McCartney and formally attributed to Lennon/McCartney. The song was originally released as a single on 11 April 1969, and credited to &quot;The Beatles with Billy Preston.&quot; A different mix of the song later became the closing track of Let It Be (1970), which was the Beatles' last album released just after the group split. The single version was later issued on CD on the second disc of the Past Masters compilation.\n\nThe single reached number one in the United Kingdom, the United States, Canada, New Zealand, Australia, France, West Germany, and Mexico. It was the Beatles' only single that credited another artist at their request. &quot;Get Back&quot; was the Beatles' first single release in true stereo in the US. In the UK, The Beatles' singles remained monaural until the following release, &quot;The Ballad of John and Yoko&quot;.\n\n&quot;Get Back&quot; is unusual in the Beatles' canon in that almost every moment of the song's evolution has been extensively documented, from its beginning as an offhand riff to its final mixing in several versions. Much of this documentation is in the form of illegal (but widely available) bootleg recordings, and is recounted in the book Get Back: The Unauthorized Chronicle of the Beatles' Let It Be Disaster by Doug Sulpy and Ray Schweighardt.\n\nThe song's melody grew out of some unstructured jamming on 7 January 1969 during rehearsal sessions on the sound stage at Twickenham Studios. Over the next few minutes McCartney introduced some of the lyrics, reworking &quot;Get back to the place you should be&quot; from fellow Beatle George Harrison's &quot;Sour Milk Sea&quot; into &quot;Get back to where you once belonged&quot;. (McCartney had played bass on Jackie Lomax's recording of the song a few months earlier.) On 9 January McCartney brought a more developed version of &quot;Get Back&quot; to the group, with the &quot;Sweet Loretta&quot; verse close to its finished version. For the press release to promote the &quot;Get Back&quot; single McCartney wrote, &quot;We were sitting in the studio and we made it up out of thin air... we started to write words there and then...when we finished it, we recorded it at Apple Studios and made it into a song to roller-coast by.&quot;\n\nThe released version of the song is composed of two verses, with an intro, outro, and several refrains. The first verse tells the story of a man named Jojo, who leaves his home in Tucson, Arizona, for some 'California grass'. (Paul's soon-to-be wife Linda had attended the University of Arizona in Tucson, where the couple later owned a spacious ranch.) The second verse is about a sexually ambiguous character &quot;Loretta Martin&quot; who &quot;thought she was a woman, but she was another man.&quot; The single version includes a coda urging Loretta to &quot;get back&quot; where she belongs.\n\nThe Beatles often played around with their lyrics during recording sessions, as evidenced by Lennon's introduction on the Let It Be album: &quot;Sweet Loretta Fart, she thought she was a cleaner, but she was a frying pan&quot;. The album version of the song famously ends with John Lennon quipping &quot;I'd like to say thank you on behalf of the group and ourselves, and I hope we passed the audition&quot;. (Originally John said that at the end of the rooftop concert, but Phil Spector edited it into the &quot;Get Back&quot; song on the Let It Be album.)\n\nJohn Lennon in 1980 claimed that &quot;there's some underlying thing about Yoko in there&quot;, claiming that McCartney looked at Yoko Ono in the studio every time he sang &quot;Get back to where you once belonged.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b90bd72ceec86a6023afb8bcd7b5e06afde02826","amp;dn":"Paul+McCartney+-+Get+Back+%28Version+3%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b90bd72ceec86a6023afb8bcd7b5e06afde02826","infoHashBuffer":{"type":"Buffer","data":[185,11,215,44,238,200,106,96,35,175,184,188,215,181,224,106,253,224,40,38]},"announce":[],"urlList":[]}}