{"title":"La BrÃƒÂºjula Dorada_BDrip_m-720p","uid":6100144,"size":2736603551,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b9ff379bec5b38000e3b0ee96de237737c9ead85&amp;dn=La+Br%C3%83%C2%BAjula+Dorada_BDrip_m-720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1294934083,"description":"Calidad de video: HdRIP\nPeso: 2610 mb\nIdioma del audio: Espanol\n\nHistoria de una nina de 12 anos que hara un largo viaje para intentar salvar a un amigo. En el camino se encontrara con todo tipo de extranas criaturas, brujas y otros personajes de un universo paralelo... En este singular mundo, donde las almas humanas toman la forma de companeros del genero animal, esta nina se coloca entre el fin de la libre voluntad y el inicio de una nueva era. Lyra Belacqua solo tiene 12 anos, pero incluso ella sabe que hacer lo que te dicen en lugar de hacer lo sientes esta bien puede tener resultados muy diferentes. Una huerfana rebelde que vive como una reclusa en Jordan College en la ciudad de Oxford, Lyra pertenece a un mundo que es uno de muchos mundos paralelos: mundos no vistos, dimensiones intangibles donde la humanidad se desarrolla con sutiles diferencias. Pero Lyra nunca esta sola en el suyo. Ella va a todas partes con su daimonion, un pequeno animal, siempre cambiante llamado Pantalaimon. En otros mundos, el alma reside dentro del cuerpo de las personas, oculta y en silencio. En el suyo, el daimonion es un companero de por vida. Pero el mundo de Lyra esta cambiando. El supremo cuerpo de gobierno llamado el Magisterium esta apretando sus garras contra la poblacion. Su oscura maniobra ha dado lugar a una erupcion de secuestros de ninos por una fuerza misteriosa llamada los Gobblers (Zampones). \n\nNos vemos por torrentspain","torrent":{"xt":"urn:btih:b9ff379bec5b38000e3b0ee96de237737c9ead85","amp;dn":"La+Br%C3%83%C2%BAjula+Dorada_BDrip_m-720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9ff379bec5b38000e3b0ee96de237737c9ead85","infoHashBuffer":{"type":"Buffer","data":[185,255,55,155,236,91,56,0,14,59,14,233,109,226,55,115,124,158,173,133]},"announce":[],"urlList":[]}}