{"title":"Oido Canibal 1x01 HDTV DVB Spanish","uid":6069956,"size":404763222,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bb56d82e748e4810b09e6066845209adfc03fe79&amp;dn=Oido+Canibal+1x01+HDTV+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"acer2010","files":1,"time":1293570055,"description":"Creado al margen de la industria audiovisual, OÃƒÂ­do CanÃƒÂ­bal es un proyecto experimental inquietante, incÃƒÂ³modo y trasgresor que apuesta por nuevos talentos y no deja indiferente a nadie. EstÃƒÂ¡ dirigido por David Navarro, quien debuta como director y productor, ensayando en la manera de rodar y en las formas narrativas.\nOscar, Marta, Alicia y SofÃƒÂ­a parecen cuatro personas normales, pero tras su aparente normalidad esconden una insaciable fascinaciÃƒÂ³n por entrar en la vida de los demÃƒÂ¡s a travÃƒÂ©s de sus correos electrÃƒÂ³nicos, cuentas bancarias, tarjetas de crÃƒÂ©dito, blogs o encuentros casuales. La terapia colectiva a la que asisten mÃƒÂ¡s que ayudarles pondrÃƒÂ¡ en contacto lo peor de cada una de sus psicopatÃƒÂ­as.\nDavid Navarro\nDavid Navarro es un nativo de Internet, autodidacta que a los 15 aÃƒÂ±os fundÃƒÂ³ su primer proyecto en la red y en 1999 desarrollÃƒÂ³ la primera versiÃƒÂ³n del portal Ya.com. Ha recibido diferentes reconocimientos: Premio Nacional JÃƒÂ³venes Investigadores (MCU), premio Nacional Sociedad de la InformaciÃƒÂ³n. Especialista en estrategia de comunicaciÃƒÂ³n digital que ha trabajado como consultor en grandes organizaciones, incluida La Moncloa, con OÃƒÂ­do CanÃƒÂ­bal David reflexiona sobre nuestra sociedad, en la que las redes sociales pueden determinar nuestra manera de relacionarnos y nuestro &quot;ser digital&quot; puede ser la puerta hacia la pÃƒÂ©rdida de intimidad.","torrent":{"xt":"urn:btih:bb56d82e748e4810b09e6066845209adfc03fe79","amp;dn":"Oido+Canibal+1x01+HDTV+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb56d82e748e4810b09e6066845209adfc03fe79","infoHashBuffer":{"type":"Buffer","data":[187,86,216,46,116,142,72,16,176,158,96,102,132,82,9,173,252,3,254,121]},"announce":[],"urlList":[]}}