{"title":"Ke$ha - We R Who We R (PSP, iPod, Zune)","uid":6021544,"size":13828245,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:bb5aeac8e80eb262c749d11bd7a5d737c5661e37&amp;dn=Ke%24ha+-+We+R+Who+We+R+%28PSP%2C+iPod%2C+Zune%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"qwersd","files":1,"time":1291768289,"description":"&quot;We R Who We R&quot; is a song by American recording artist and songwriter Kesha, from her first extended play (EP), Cannibal. The song was released as the EP's lead single on October 22, 2010. It was written by Kesha, with Dr. Luke, Benny Blanco and Ammo who also produced the song. Kesha was inspired to write the song in the wake of news that bullying had led to multiple suicides of gay youth. Hence the message of the song is to inspire people to be themselves, a celebration of anyone deemed quirky or eccentric.\nCritical reception of &quot;We R Who We R&quot; has been generally positive. Although it was criticized for not being particularly different from Kesha's previous work, critics still felt that the song was a strong dance-pop number, that combined strong beats with an inspiring message filled with genuine humor. &quot;We R Who We R&quot; debuted at number one on the Billboard Hot 100, making it the seventeenth song in the chart's history to do so. &quot;We R Who We R&quot; also reached the top five in Canada and New Zealand as well as number one in Australia. The charting of the song gave Kesha her fifth consecutive top ten hit in the United States, Canada and Australia.\n\nThe music video for &quot;We R Who We R&quot; was directed by Hype Williams. The video was filmed in downtown Los Angeles. Kesha explained the idea behind the video as well as the experience during an interview with MTV News, She explained that the video was different from her other videos noting that it was going to show a sexier side of herself, she elaborated, &quot;This video is a little bit 'sexy time&quot;. &quot;[For] this video, I kinda thought, 'I should be blowing things up, So we closed down downtown Los Angeles and, I mean, I'm not going to give away all of it, but I do blow some stuff up.\n\nEncoded using Handbrake..\n\nSource - 720p\n\nPlease seed atleast 1:1..","torrent":{"xt":"urn:btih:bb5aeac8e80eb262c749d11bd7a5d737c5661e37","amp;dn":"Ke%24ha+-+We+R+Who+We+R+%28PSP%2C+iPod%2C+Zune%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb5aeac8e80eb262c749d11bd7a5d737c5661e37","infoHashBuffer":{"type":"Buffer","data":[187,90,234,200,232,14,178,98,199,73,209,27,215,165,215,55,197,102,30,55]},"announce":[],"urlList":[]}}