{"title":"Dragonaut Part 1","uid":5962959,"size":4682055680,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bba32e7386f04529813e980bc1466e1dcec47724&amp;dn=Dragonaut+Part+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pablouno","files":1,"time":1290016814,"description":"Twenty years prior to the story's beginning, an asteroid headed for Earth destroys Pluto. Due to Pluto's destruction, the asteroid, which is dubbed Thanatos, becomes temporarily stagnant in Pluto's orbit. Now, in order to avoid Earth's impending destruction, the International Solarsystem Development Agency (ISDA) works on the &quot;D-Project&quot;, and secretly creates weapons called &quot;Dragons&quot; after finding a dragon egg under the ocean. However, they soon find out that the asteroid is not their only threat, as powerful, destructive dragons from Thanatos appear on Earth.\n\nAfter witnessing what looks like a murder by a strange creature, Jin Kamishina, a lonely 18-year-old boy who lost his family in a shuttle accident two years ago, gets involved with the ISDA and their efforts to battle the dragons from Thanatos. Helping him is Toa, a mysterious girl who saves him from falling to his death after the creature attacks him. As they delve deeper into the mysteries of the dragons, they encounter new friends and enemies, and also develop a closer relationship.","torrent":{"xt":"urn:btih:bba32e7386f04529813e980bc1466e1dcec47724","amp;dn":"Dragonaut+Part+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bba32e7386f04529813e980bc1466e1dcec47724","infoHashBuffer":{"type":"Buffer","data":[187,163,46,115,134,240,69,41,129,62,152,11,193,70,110,29,206,196,119,36]},"announce":[],"urlList":[]}}