{"title":"Loose Nut - The Mission  ( Skate Video )","uid":6023329,"size":559895756,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bcccf2d4558592e6c379e1a8c36af9df974029d3&amp;dn=Loose+Nut+-+The+Mission++%28+Skate+Video+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"footron","files":-1,"time":1291870599,"description":"Loose Nut - The Mission\n\nThe ultimate skateboarding experience follows the travels and exploits of Ben Krahn, a pro skateboarder from Seattle, as he journeys thousands of miles along the West Coast by hopping trains and hitching rides from one epic skate spot to the next. \nShot entirely on film, The Mission is set apart from other movies, telling a story of adventure from a skater's perspective. \nThe Mission begins in Ben's hometown of Seattle where he rips the streets and skate parks along with friends Scotty Moeller, Huy Lee, Chad Vogt and Eric Green.  Plus, footage of the legendary Westside Bowl with Munk &amp; Swim. \nJoin Ben as he rips Burnside Project with Red, Choppy, Mikey Chin, Neil Heddings, Pig Pen and other locals. \nThen onward to the mecca of street skating, San Francisco, where Ben hooks up with Dan Drehobl, Aaron Astorga, Brian Chum, Joey Bast, Satva Leung, Lonny Peoples, Kenny Hughes, and a host of others. \nThe Mission continues with an unforgettable session at the Skate Park of Santa Rosa with Phil Shao, Joel Price, Tim McKenney and Eric Peoro. \nBen's quest finally takes him to San Diego where he meets up with the Donger, Chad Muska, Clyde Singleton, Joe McClellen, Pat Duffy, Simon Loveless, Neil Heddings and Sage Boylard - and includes the first footage of the never seen Temecula Skate Park. \n`The Mission' is already becoming a household phrase for skaters in their endless search for new terrain.  Slap Magazine says &quot;Is one of those benchmark videos no one should be without ... an odyssey of skating ... in the tradition of Endless Summer ...&quot;\n\n\n\nAudio and Video are Not the best, but this video comes from the land before digital...  I digitized this myself from VHS (if you remember what that is), so it is what it is.  Remember the good old days!?\n\nPlease Seed !!\n\n...and check out my other torrents for other rare skate videos...\n\t\t","torrent":{"xt":"urn:btih:bcccf2d4558592e6c379e1a8c36af9df974029d3","amp;dn":"Loose+Nut+-+The+Mission++%28+Skate+Video+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcccf2d4558592e6c379e1a8c36af9df974029d3","infoHashBuffer":{"type":"Buffer","data":[188,204,242,212,85,133,146,230,195,121,225,168,195,106,249,223,151,64,41,211]},"announce":[],"urlList":[]}}