{"title":"Aerosmith - The Other Side (2nafish)","uid":5980853,"size":195502084,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bd69330b9191a8be2bd50796149143b4c0973076&amp;dn=Aerosmith+-+The+Other+Side+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1290590449,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Other Side&quot; is a song performed by American hard rock band Aerosmith, and written by Jim Vallance (music) and Steven Tyler (lyrics). It was released in 1990 as the fourth single from the band's highly successful 1989 album Pump.\n\nThe songwriting team of Holland-Dozier-Holland were eventually given songwriting credit on the song after threatening to file suit over what they perceived to be similarities between &quot;The Other Side&quot; and their song &quot;Standing in the Shadows of Love&quot;.\n\nThe song won the MTV Video Music Award for Best Rock Video in 1991.\n\nPeaking at #22 on the Billboard Hot 100, the song marked a first for Aerosmith, as it became the fourth song from a single album of theirs to chart in the Top 40 of the Billboard Hot 100. Only Get a Grip has equaled this feat.\n\nAdditionally, the song reached #1 on the Mainstream Rock Tracks chart, the third single from Pump to do so.\n\nPump is the tenth album by American rock band Aerosmith, released in 1989. The album was remastered and reissued in 2001.\n\nPump was widely acclaimed by both fans and critics upon its release. The album incorporates the use of keyboards and a horn section on many of the singles (&quot;Love in an Elevator&quot;, &quot;The Other Side&quot;), and contains straightforward rockers (&quot;F.I.N.E.*&quot;, &quot;Young Lust&quot;), the ballad &quot;What It Takes&quot;, songs about issues such as incest and murder (&quot;Janie's Got a Gun&quot;) and drug and alcohol abuse (&quot;Monkey on My Back&quot;), as well as a variety of instrumental interludes such as &quot;Hoodoo&quot; and &quot;Dulcimer Stomp.&quot;\n\nThe album has certified sales of seven million copies in the U.S. to date, and is tied with its successor Get a Grip as Aerosmith's second best-selling studio album (Toys in the Attic leads with eight million). It produced a variety of successes and &quot;firsts&quot; for the band including their first Grammy Award (&quot;Janie's Got a Gun&quot;). &quot;Love in an Elevator&quot; became the first Aerosmith song to hit #1 on the Mainstream Rock Tracks chart. Additionally, it is the only Aerosmith album to date to have three Top 10 singles on the Billboard Hot 100 and three #1 singles on the Mainstream Rock Tracks chart. The album was the fourth bestselling album of the year 1990.\n\nIn the UK, it was the second Aerosmith album to be certified Silver (60,000 units sold) by thePhonographic Industry, achieving this in September 1989.\n\nPump was the second of three sequentially recorded Aerosmith albums to feature producer Bruce Fairbairn and engineers Mike Frazer and Ken Lomas at The Little Mountain Sound Studios.\n\nA video documentary on the recording, The Making of Pump, was released in 1994.\n\nAerosmith found themselves in law school textbooks after a small rock band named Pump sued Aerosmith's management company for service mark infringement. Aerosmith won the case. Aerosmith also found themselves in legal trouble when the songwriting team Holland-Dozier-Holland threatened to sue the band over the main melody in Aerosmith's song &quot;The Other Side&quot; which sounded similar to the melody in the song &quot;Standing in the Shadows of Love&quot;. As part of the settlement, Aerosmith agreed to add &quot;Holland-Dozier-Holland&quot; in the songwriting credits for &quot;The Other Side&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:bd69330b9191a8be2bd50796149143b4c0973076","amp;dn":"Aerosmith+-+The+Other+Side+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd69330b9191a8be2bd50796149143b4c0973076","infoHashBuffer":{"type":"Buffer","data":[189,105,51,11,145,145,168,190,43,213,7,150,20,145,67,180,192,151,48,118]},"announce":[],"urlList":[]}}