{"title":"Anthrax - Got The Time (2nafish)","uid":5986764,"size":102060036,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bd6a16b592477b99eafe9fb77145d0920c4c5d6a&amp;dn=Anthrax+-+Got+The+Time+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1290762604,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nPersistence of Time is the fifth studio album by the American heavy metal band Anthrax. It was released on August 21, 1990 through Megaforce Worldwide/Island Records.\n\nThe album includes the singles, &quot;Got the Time&quot; (a Joe Jackson cover) and &quot;In My World&quot; (which was performed by the band on the Married... with Children episode, My Dinner with Anthrax.)\n\nAnthrax returned to the studio in the fall of 1989 with Mark Dodson (who produced the previous album, State of Euphoria) to start work on their fifth album. Recording of the album was difficult, with a large structure fire causing the band to lose more than $100,000 worth of gear and their recording studio in January 1990. Following their personal disaster the band moved to a different studio in late February of that year to finish work on the album.\n\nThe album's tone is decidedly more serious and mature than on prior Anthrax albums. Eschewing the humor and comic book references in prior albums, the lyrical focus of Persistence of Time is the need for tolerance and peace. The band also introduced a progressive side of the music which they hadn't tried earlier.\n\nIt was the last studio album to feature Joey Belladonna on vocals until he returned in 2010.\n\nThe introduction to the song &quot;Intro to Reality&quot; featured dialogue from an episode of The Twilight Zone called &quot;Deaths-Head Revisited&quot;.\n\nKeep It in the Family, In My World, and Belly of the Beast were later re-recorded with the John Bush/Rob Caggiano lineup for the album The Greater of Two Evils.\n\nPersistence of Time was certified gold by the RIAA. Its highest Billboard Music Chart position was #24 on the Billboard 200 chart.\n\nNew York Times (11/18/90) - &quot;..the music carries the exhilaration of a desperate struggle.&quot;\n\nAnthrax is an American heavy metal band from New York City, formed in 1981. Founded by guitarists Scott Ian and Danny Lilker, the band has since released 9 studio albums and 20 singles, and an EP featuring Public Enemy. The band was one of the most popular of the 1980s thrash metal scene. When thrash metal began to gain a major following in the mid-to-late 1980s, Anthrax were dubbed one of the &quot;big four&quot; of thrash metal alongside Metallica, Megadeth, and Slayer.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:bd6a16b592477b99eafe9fb77145d0920c4c5d6a","amp;dn":"Anthrax+-+Got+The+Time+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd6a16b592477b99eafe9fb77145d0920c4c5d6a","infoHashBuffer":{"type":"Buffer","data":[189,106,22,181,146,71,123,153,234,254,159,183,113,69,208,146,12,76,93,106]},"announce":[],"urlList":[]}}