{"title":"Dracula UK Concept Album","uid":6006065,"size":42286066,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:be753fe922e0189a5499d1400551cfb5d5039553&amp;dn=Dracula+UK+Concept+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NikkiCabrara","files":21,"time":1291327046,"description":"Dracula is the new musical by Gareth Evans and Christopher J. Orton, with orchestrations and additional music by Ian Lynn.  Dracula, the musical is an adaptation of Bram Stoker's classic gothic novel, 'Dracula'.\nThis collaborative work accurately represents the dark Victorian world of Stoker's novel whilst making a direct connection between the fictional vampire and historic figure, Vlad Tepes - Dracula. The libretto has been deliberately written with due consideration to the period and intention of the original 1897 novel.\n\nThis work has not recieved the funding to be brought to the stage, yet.\n\n* More music tracks are being recorded for the New and complete Dracula musical CD.\n\nDracula Musical Cast:\nMichael McCarthy - Dracula\nStephanie Benavente - Mina\nRobert Fardell - Van Helsing\nKit Orton - Harker\nAlison Guill - Lucy\nJohn Barr - Renfield\nChristian Jon Billett - Holmwood\nAlex Sangster - Seward\nSteven Sparling - Morris\nEnsemble/Chorus: Deborah Crowe, Stephanie Evans, Claire Falconer, Ian Lynn, Christopher Orton,\nAlex Sangster, Steven Sparling, Anna-Lee Robertson\n\nTracklist:\n1 - Overture (Orchestra)\n2 - I Am Condemed (Dracula)\n3 - The Proper Thing to Do (Mina &amp; Harker)\n4 - Within My World (Dracula)\n5 - This is My Chance (Harker)\n6 - It's a Different World (Dracula &amp; Lucy)\n7 - I'm Really Not Insane (Renfield, Seward, Van Helsing)\n8 - For the Good of Mankind (Van Helsing)\n9 - In Your Eyes (Dracula, Mina, Lucy)\n10 - When She Came Into My Life (Holmwood)\n11 - The Lady in White (Company)\n12 - For the Angel You Are (Renfield)\n13 - She Devil, Nosferatu (Van Helsing, Lucy, Harker, Seward, Holmwood)\n14 - Never to Die (Dracula)\n15 - Your Heart's Desire (Dracula &amp; Mina)\n16 - Those Dreams of Long Ago (Mina)\n17 - Finale (Dracula &amp; Company)\nBonus Tracks include two new songs (Tender Love and Beyond the Night) and a Compilation of the musical.\n\nBrief History of the Musical:\nThe musical &quot;Dracula&quot; has taken several years to reach the present stage of development. After extensive research had been conducted by the lyricist in 1999 / 2000 (including the use of references to Stoker's original notes for the novel), the initial lyric structures for some of the proposed songs and the outline of the musical plot were written. The first version of the complete libretto had been produced by 2003 and has subsequently been further improved.\nChristopher J. Orton and Gareth Evans began working together on the project in 2004, when Christopher began setting the libretto to his original music and to create the score for the work.\nAfter the lyricist and composer had recorded some demo material of their work in 2004, and following some private cast readings of scenes, an opportunity arose to produce a professional concept recording of the show. This process began in 2005 after the noted composer, arranger and musical director, Ian Lynn, agreed to orchestrate the work.\nThe album features the leading West End musical theatre performer, Michael McCarthy, singing the title role.\nThe official album launch was on September 25th at Dress Circle (London). Since then the album has been selling well at all retail outlets and is still a top CD best seller at Dress Circle.\nThe UK Theatre Magazine, What's On Stage, published a very positive review of the Dracula concept album in its December 2006 issue. Recently, a track from the album was played on national radio. That was on the Elaine Paige show on BBC Radio 2.\nA further album of the complete Dracula musical is planned and that process will begin during 2009.\nThe producers of the album are Sang de Vie Productions Ltd. They can be contacted via their website.\n\nSample Reviews of the Album:\n&quot;With a stunning orchestra and stellar lyrics, Evans and Orton have composed a masterpiece. Closely following the book, their rendition returns to Count Dracula what society has so horrifically stolen from him. Michael McCarthy excels as the chilling and sensual lead role. Songs such as &quot;I Am Condemned,&quot; &quot;Within My World,&quot; and &quot;Never to Die&quot; allow listeners to see a full range of emotion and power. A beautiful, inspired recording, Dracula gives you chills every time you hear it.&quot;\n(From Amazon)\n\n&quot;Evita started as a concept album. Why not Dracula? This 70 minute CD has already gathered a battalion of fans (or should they be fangs?). It's a powerful new Gothic musical that remains faithful to the original novel and has enough dramatic bite to keep you listening well beyond moonrise. With music by Christopher J. Orton and Lyrics by Gareth Evans, the songs deliver just the right measure of dramatic passion to get the blood pumping. And when you've got one hell of a vocalist like Les Miserables stalwart Michael McCarthy hitting all the right notes in the title role, something really does begin to quiver on the side of the neck. First the concept. Then the concert? Next, the West End?&quot;\n(From UK Theatre Magazine)\n\n&quot;All songs paint a picture and tell a story but when that song can make tears fall from your eyes, that's magic. Your songs are magic.&quot;\n(From MySpace)\n\n\nAll information was taken from the show's website: http://www.dracula-uk.com/index.html","torrent":{"xt":"urn:btih:be753fe922e0189a5499d1400551cfb5d5039553","amp;dn":"Dracula+UK+Concept+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be753fe922e0189a5499d1400551cfb5d5039553","infoHashBuffer":{"type":"Buffer","data":[190,117,63,233,34,224,24,154,84,153,209,64,5,81,207,181,213,3,149,83]},"announce":[],"urlList":[]}}