{"title":"Gregg Allman Band  Playin' Up A Storm (rock)(mp3@320)[rogercc]","uid":6211945,"size":85185826,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:be8c63ad635b37a98a6a89ee3f8f02add31e8408&amp;dn=Gregg+Allman+Band++Playin%5C%27+Up+A+Storm+%28rock%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rogercc1","files":10,"time":1299016247,"description":"GREGG ALLMAN BAND PLAYIN UP A STORM\nAudio CD May 1, 2001 \nOriginal Release Date: 1977 \nLabel: Mca Special Products\nFormat: Mp3@320\n\n\nIn a way, Playin' Up a Storm doesn't really highlight Gregg Allman's strengths, since it's a little smoother and soul-inflected than his work with the Allman Brothers. Then again, that's not a problem; after all, why make a solo album that's exactly like your full-time gig? Consequently, Playin' Up a Storm is a well-made, expertly performed set of blues-rock, soul-pop, and straight-ahead rock &amp; roll. There aren't any true classics here, but the thing that makes it one of Allman's best solo efforts is the terrific performances. Not only is he in fine voice, delivering each song with conviction, but his supporting band -- featuring such luminaries as Dr. John and Bill Payne -- is sterling. All the grooves are in the pocket, the sound is enticing, and the overall effect is just right. \n\nTracklist\n1 Come and Go Blues  4:45 \n2 Let This Be a Lesson To Ya' 3:40 \n3 Brightest Smile In Town  3:05 \n4 Bring it on Back  4: \n5 Cryin' Shame  3:41 \n6 Sweet Feelin'  3:35 \n7 It Ain't No Use  3:52 \n8 Matthew's Arrival  3:47 \n9 One More Try 3:53\nRecorded at Warner Brothers Recording Studios, North Hollywood, California.\n\nGregg Allman Band: Gregg Allman (acoustic guitar, piano, organ); Ricky Hirsch (acoustic, electric &amp; slide guitars); Steve Beckmeier, John Hug (electric guitar); Neil Larsen (piano, Fender Rhodes piano, synthesizer); Willie Weeks (bass); Bill Stewart (drums).\n\nAdditional personnel: Dave Luell (tenor saxophone); Steve Madaio, Pat Rizzo (horns); Mac &quot;Dr. John&quot; Rebennack (piano, clavinet); Bill Payne (synthesizer); Fred Beckmeier, George &quot;Red&quot; Callender (bass); Milt Holland, Victor Feldman (percussion); Clydie King, Sherlie Matthews, Venetta Fields (background vocals).\n","torrent":{"xt":"urn:btih:be8c63ad635b37a98a6a89ee3f8f02add31e8408","amp;dn":"Gregg+Allman+Band++Playin%5C%27+Up+A+Storm+%28rock%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be8c63ad635b37a98a6a89ee3f8f02add31e8408","infoHashBuffer":{"type":"Buffer","data":[190,140,99,173,99,91,55,169,138,106,137,238,63,143,2,173,211,30,132,8]},"announce":[],"urlList":[]}}