{"title":"Alex Jones Show - 2010 Nov 05 [sebaygo1]","uid":5937103,"size":88630085,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:bf6679a0bf33fd56795e66b31eb6bbc8fd67d106&amp;dn=Alex+Jones+Show+-+2010+Nov+05+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":14,"time":1289010289,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nFriday, 05 November 2010\n\n\n[sebaygo1]\n\n\n\n++++++++++++\nAlex scheduled a full 4th hour today, then extended the broadcast 30 minutes into a 5th hour to continue his conversation with Joe Rogan and a comedian friend of Rogan's who was also in studio.  Neither GCN nor infowars has made audio of the 5th hour available for download.  I was unable to record it because I was already recording Mike Rivero's show. See my blog for further details.\n+++++++++++++++++\n\n\n\n\nScheduled Guests\n................\n\nFrom the Infowars web site ::\n\nAlex welcomes back to the show Gary Franchi, producer of Enemy of the State: Camp FEMA Part 2, the follow up to Williams Lewis' eye-opening documentary, Camp FEMA: American Lockdown. Franchi is a Chicago-area native and host of The Reality Report. Gary helped Aaron Russo found Restore The Republic in 2007. \n[from 19:00 in hour 3, through about 15 minutes into hour 4]\n\n\n\nAlex also talks with regular Friday guest Bob Chapman of the International Forecaster about the economy and the Fed's decision to unleash QE2. \n[1st half of hour 2, through 1st 5 minutes of hour 3]\n\n\n\nLindsey Williams makes an appearance to reveal his insider source. \n[2nd half of hour 2, through the end of hour 3]\n\n\n\nAlex also welcomes back in-studio comedian, actor and color commentator for the Ultimate Fighting Championship, Joe Rogan. \n[from 18:00 into hour 4, through the end of the broadcast]\n\n\n\n[Infowars employee] Michelle continues her story about the indignities of the TSA and their molestation of children.\n[2nd half of hour 3]\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n\n","torrent":{"xt":"urn:btih:bf6679a0bf33fd56795e66b31eb6bbc8fd67d106","amp;dn":"Alex+Jones+Show+-+2010+Nov+05+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf6679a0bf33fd56795e66b31eb6bbc8fd67d106","infoHashBuffer":{"type":"Buffer","data":[191,102,121,160,191,51,253,86,121,94,102,179,30,182,187,200,253,103,209,6]},"announce":[],"urlList":[]}}