{"title":"Harriet the Spy; Blog Wars 2010 NL Dutch Subtitled SDTV DVDR-5 P","uid":6093947,"size":4091750400,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bf6cbec4e506bc388420863a6925a2d39328aa31&amp;dn=Harriet+the+Spy%3B+Blog+Wars+2010+NL+Dutch+Subtitled+SDTV+DVDR-5+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"DisneyChannel-DutchNL","files":-1,"time":1294683974,"description":"Harriet The Spy; Blog wars 2010 NL Dutch Subtitled SDTV DVDR-5 PAL - Disney Channel Netherlands NL\nRecorded from Analog TV from Disney Channel Netherlands with Samsung DVD-HR753\nDVDR-5-Video files based on a Single VOB file that you can direct burn on DVD 4,7GB Disc, or watch them without breaks on your PC/Mac!\n\nSize: 3,81GB\nCompression: MPEG2 \nExtension: VOB\nAudio Language/Taal: English/Engels Stereo AC3 384kbps\nSubtitles/Ondertitels : Dutch/Nederlands Nederlandse\nOndertiteld Subtitled Subs NL Ondertiteling\nAlone Hard Coded subs\nRegion/Regio: 4:3 Normal PAL free/vrij\nIMDB: http://www.imdb.com/title/tt1545097/\nRapid.Share: http://freetexthost.com/wa5rwxbdak\nPass: qwerty (Only to see links, Rars don't have password)\n(With this service you can download this movie at maximum speed without seeding, but it required paying, and this download can be blocked by Disney)\n\nUnited States\nFamily\n90 Minutes\n\ndirected by Ron Oliver\nwith Jennifer Stone, Kristin Booth and Wesley Morgan\n\nIn a modern twist on the popular book series, \nHarriet the Spy: Blog Wars begins with aspiring writer Harriet The Spy Welsch determined to become class blogger. \nCompeting against her supreme nemesis, Marion Hawthorne, Harriet will do whatever it takes to win the coveted title. \nBut when it begins to look like Marion might take the lead, \nHarriet becomes desperate to figure out a way to get the most blog hits.\n\nDe jonge Harriet Welsch gedraagt zich als een spion. \nWanneer haar pad dat van Marion Hawthorne kruist om de titel van 'Blogger van de klas' \nte behalen besluit ze om alles uit de kast te halen om deze prestigieuze wedstrijd te winnen. \nWanneer Marion gestart is met het bloggen zet Harriet haar zinnen op de popster Skander Hill (Wesley Morgan), \ndie in de stad is om aan een nieuwe film te werken. \nHarriet lijkt eerst geen kans te hebben maar waneer blijkt dat haar vader de film produceert besluit ze om \nHill te gaan stalken en alles in haar blog te zetten. \nMaar dan wordt Harriet van de filmset geweerd...\n\nPlease seed to a minimum of 1.000 to keep the torrent online!\nThank you!\t","torrent":{"xt":"urn:btih:bf6cbec4e506bc388420863a6925a2d39328aa31","amp;dn":"Harriet+the+Spy%3B+Blog+Wars+2010+NL+Dutch+Subtitled+SDTV+DVDR-5+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf6cbec4e506bc388420863a6925a2d39328aa31","infoHashBuffer":{"type":"Buffer","data":[191,108,190,196,229,6,188,56,132,32,134,58,105,37,162,211,147,40,170,49]},"announce":[],"urlList":[]}}