{"title":"Fun...Can Be Dangerous Sometimes Super Hot 18+(2005) Hindi x264 ","uid":6018167,"size":1884290763,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bff1fd1f9b90c0e4b57ca69d661bd379a06ac42b&amp;dn=Fun...Can+Be+Dangerous+Sometimes+Super+Hot+18%2B%282005%29+Hindi+x264+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"amanrulz","files":2,"time":1291715705,"description":"mastitorrents.com\n &lt;a href=&quot;\nhttp://mastitorrents.com/forums/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mastitorrents.com/forums/index.php&lt;/a&gt;\n\nInfo\n &lt;a href=&quot;\nhttp://img210.imageshack.us/img210/7204/captureqks.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img210.imageshack.us/img210/7204/captureqks.jpg&lt;/a&gt;\n\n\nSYNOPSIS\n\nIMDb Link : http://www.imdb.com/title/tt0497620/\n\nNatasha (Payal Rohatgi), Phalguni and Urmila are fun loving married women and they strongly believe we live only once and so we should enjoy life fully. But Phalguni and Urmila have a major problem with their husbands as they have become indifferent to their sexual needs and have no time for them. Natasha on the other hand has no problem with her husband Aryan (Siddharth Koirala) because she always gives him surprises. She believes that after some time every marriage becomes stale, so one has to make efforts to keep it alive and fresh. To revive their lives and fulfil their desires, Natasha suggests husband swapping to Urmila and Phalguni. Initially the duo is shocked and they refuse to do it. But later when Natasha explains to them how to go about it, they agree. The three women reach a resort with their husbands to enjoy for a week and celebrate the New Year Night. On the very first day, they decide who would be paired with whom. But in the lucky draw, Natasha is left with her own husband. Now Phalguni and Urmila put in their best efforts to seduce each other's husbands and finally succeed. During their stay in the resort, the group comes across a young pretty girl called Megha (Heena Rehman). Aryan gets attracted towards Megha and in a very subtle way Natasha encourages their relationship and pretends as if she doesn't mind it. But Aryan is surprised when he learns that Megha is married to a wealthy man, Raj (Aryan Vaid) who too arrives at the resort. However at the same time he also comes to know that Megha and Raj have a strained relationship.As the New Year Night approaches, strange things begin to happen. Megha receives messages from an anonymous person who claims to be her lover. Raj receives threatening calls warning him that there would be an attempt on his life. The couple don't take the threats very seriously until there is an attack on Raj's life. Fortunately, he survives. But finally on the eve of New Year night, to everyone's shock Megha's is found dead near the swimming pool. There is chaos in the hotel. The police investigate and find out that Aryan was with Megha just before she was killed. Since all evidences are against him, Aryan is arrested.\n\nBut is he the real culprit?\n","torrent":{"xt":"urn:btih:bff1fd1f9b90c0e4b57ca69d661bd379a06ac42b","amp;dn":"Fun...Can+Be+Dangerous+Sometimes+Super+Hot+18%2B%282005%29+Hindi+x264+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bff1fd1f9b90c0e4b57ca69d661bd379a06ac42b","infoHashBuffer":{"type":"Buffer","data":[191,241,253,31,155,144,192,228,181,124,166,157,102,27,211,121,160,106,196,43]},"announce":[],"urlList":[]}}