{"title":"Duncan-Secular Humanism-The Most Dangerous Religion in America(1","uid":5973163,"size":528457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0555274f73fcf4939d17391a0e2b42d973d1548&amp;dn=Duncan-Secular+Humanism-The+Most+Dangerous+Religion+in+America%281&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1290365491,"description":"This is Homer Duncan's informative book Secular Humanism - The Most Dangerous Religion in America (1984) which exposes many dangers emanating from secular philosophies of our age. As former US senator Jesse Helms observed, when the US Supreme Court prohibited children from participating in voluntary prayers in public schools, the conclusion was inescapable that the Supreme Court not only violated the right of free exercise of religion for all Americans but it also established a national religion in the United States - that of secular humanism. Since that time, schools have been increasingly plagued with vandalism, crime, violence, drug abuse and promiscuity, not to mention that academic standards and achievements have been falling sharply year by year. What is interesting about humanism is that it is the exact opposite of christianity - as if by design. It rejects god in all its forms as it's based on pure atheism. Whatever christianity says is right, humanism says is wrong. Duncan dwelves deep in humanism's philosophical roots and discovers they have been motivated by political goals, resulting in such contradicting teachings as social darwinism or communism that are directly responsible for deaths of millions of humans. Secular Humanism is a well documented and consise overview of secular humanism and exposes it as a religion that is to be enforced on every single American whether they like it or not. 135 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:c0555274f73fcf4939d17391a0e2b42d973d1548","amp;dn":"Duncan-Secular+Humanism-The+Most+Dangerous+Religion+in+America%281","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0555274f73fcf4939d17391a0e2b42d973d1548","infoHashBuffer":{"type":"Buffer","data":[192,85,82,116,247,63,207,73,57,209,115,145,160,226,180,45,151,61,21,72]},"announce":[],"urlList":[]}}