{"title":"Coast to Coast AM 11 - 07 -10  - Ancient ET Intervention","uid":5966304,"size":55335501,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c067c8da83c03855747d28561f0955a9c8e6c2c2&amp;dn=Coast+to+Coast+AM+11+-+07+-10++-+Ancient+ET+Intervention&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":4,"time":1290115752,"description":"Ancient ET Intervention\n\nDate: 11-07-10\nHost: George Noory\nGuests: Marshall Klarfeld, Robert Felix\n\nMechanical engineer Marshall Klarfeld discussed his relationship with the late Zecharia Sitchin and his theories of how humans were created by genetic engineering of the Annunaki. Sitchin arrived at his conclusions after translating the ancient cuneiform tablets of the Sumerians, telling Klarfeld, &quot;It's not a secret, I'm just a reporter.&quot; While some have not concurred with Sitchin's interpretations, Klarfeld said five major scholars agreed with his translations.\n\nKlarfeld recounted the 6,000 year-old Epic of Gilgamesh which tells in cuneiform the history of Earth's first contact with extraterrestrial beings-- the Annunaki, who mixed their DNA with Homo erectus to create the human race. The story involved Gilgamesh, the king of Uruk, who was part Annunaki, a cloned counterpart, Enkidu, and Ishtar, an Annunaki princess who traveled in a shuttlecraft to the space platform (the huge stone ruins in Baalbek, Lebanon). She was said to control a weapon &quot;the Bull of Heaven,&quot; which Klarfeld likened to a laser beam.\n\nThe Epic also tells the story of the Great Flood (associated with the arrival of the planet Nibiru in between Mars and Jupiter), and how the Annunaki wanted to use it to wipe out humans, said Klarfeld. Yet, some opted to save humankind, and Noah's Ark was developed as a submersible, and rather than containing actual animals, it held the DNA of all living creatures, which was later reconstituted after the flood, he explained.\n\nClimate &amp; Volcanic Activity\nFirst hour guest, researcher Robert Felix talked about climate and its connection to volcanic activity, and pole flips. Previous ice ages have coincided with big increases in volcanic activity, which we are now seeing around the world, he noted. He also spoke about the discovery of &quot;Carolina Bays&quot; around the world. These are oval holes blasted into the ground, which have been dated to 12,000 years ago, around the time when the Gothenburg magnetic reversal occurred, he detailed.","torrent":{"xt":"urn:btih:c067c8da83c03855747d28561f0955a9c8e6c2c2","amp;dn":"Coast+to+Coast+AM+11+-+07+-10++-+Ancient+ET+Intervention","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c067c8da83c03855747d28561f0955a9c8e6c2c2","infoHashBuffer":{"type":"Buffer","data":[192,103,200,218,131,192,56,85,116,125,40,86,31,9,85,169,200,230,194,194]},"announce":[],"urlList":[]}}