{"title":"The Doomsday Code - R. Fitzpatrick - Judgment Day May 21, 2011","uid":6040254,"size":2498640,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c29d00ea3b295654390a6ee5e426e463e6bac132&amp;dn=The+Doomsday+Code+-+R.+Fitzpatrick+-+Judgment+Day+May+21%2C+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zappaz123","files":3,"time":1292364658,"description":"This is a clean and excellent ocr, pdf version of the paperback edition previously uploaded as raw scans. Now only 2.5 GB in size.\n\nProduct Description\n\n\tThe Holy Bible is quite clear that the end of the world is coming soon. In the &quot;Doomsday Code&quot; we have proof from the Bible when this will occur: \n\tStarting May 21, 2011 there will be 153-days of Judgment in which nearly 7 billion people will die. Finally on October 21, 2011 this planet will be destroyed. \n\n\tPlease note that this text will show in detail many timelines from the Bible that proves October 21, 2011 is the end of the world. One of the best is 1 day=1,000 years and 7 days= 7000 years from which we derive: First destruction of the world: 4990 B.C., Final destruction of the world: 4990 B.C.+ 7,000 years= 2011 A.D.\n \n\tPlease order this book and warn others about the impending destruction that will shortly occur. To God alone be all the Glory!\n\nFor more information on the subject visit: FamilyRadio.com, WeCanKnow.com, eBibleFellowship.com, The-Latter-Rain.com.\n\t\n\tMankind has only one book that can prove itself to be the word of God. That book is the Bible. God took over 1,500 years to write it and now, more than 1,900 years after its completion, God has &quot;unsealed&quot; the Bible to reveal astonishing secrets it contains. The Bible tells us in Ecclesiastes 8:5: Whoso keepeth the commandment shall feel no evil thing: and a wise man's heart discerneth both time and judgment. God has promised to reveal not only the time when He will bring judgment on the earth, but also the nature of that judgment. In our day, God is using His ambassadors to warn the world that its time is almost over, and that they must be reconciled to Him or face the evil He is about to bring: five months of hell on earth. \n\t\nIn The Doomsday Code, you will learn:\n\nWhy and when the earth was created.\nWhat happens to a person who dies.\nWhat the Bible reveals about conditions in today's local congregations of Christian churches, and what terrible thing happened there in recent history. How we can know that Judgment Day begins on May 21, 2011 with a great earthquake, and that the last day of the earth's existence will be October 21, 2011.\nWhat will happen to you if God has not saved you by May 21, 2011.\nWhich groups of people God will punish more severely during the five months of Judgment Day.\nWhose countdown for the nation of Israel began on May 14, 1948.\nHow we can turn back our calendar to determine the date of the Crucifixion. \n\t\nThis nonfiction exposition plainly lays out a comprehensive, integrative, and systematic Biblical view about why we are here and when we are leaving. The book contains something to offend most everyone in today's world, but also exposes the reader to tremendous spiritual issues for study, reflection, and self-examination. The author explains many Biblical parables as well as adds his own analogies to aid understanding. \n\tThe book presents science, mathematics, and history, discussed alongside Bible verses. The Biblical calendar of history is presented along with the doomsday code; Biblical and mathematical proofs substantiate the findings and arguments made. The book is a serious, time-consuming, and vitally important read.\n\tA very accurate book about the Bible and its many doctrines, complete with much scripture to support the author's interpretation but not exhaustive. In an easy to read and understand text, Fitzpatrick points out the many false beliefs that Christians and non believers alike have had concerning God and His nature and His plan for this universe. It is especially poignant for today and this time of God's salvation plan in which we are near the very end of time and God has opened up the scriptures of the Old and New Testaments to our understanding and is testing His believers to see if they are listening to His word and obeying. The Doomsday Code is a book that the Holy Spirit can use to bless its readers.","torrent":{"xt":"urn:btih:c29d00ea3b295654390a6ee5e426e463e6bac132","amp;dn":"The+Doomsday+Code+-+R.+Fitzpatrick+-+Judgment+Day+May+21%2C+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c29d00ea3b295654390a6ee5e426e463e6bac132","infoHashBuffer":{"type":"Buffer","data":[194,157,0,234,59,41,86,84,57,10,110,229,228,38,228,99,230,186,193,50]},"announce":[],"urlList":[]}}