{"title":"Dennis Lehane - Moonlight Mile - unabridged","uid":5937452,"size":500166851,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c2d91305129472f8b3491e1a2ba049c2f0f3da5e&amp;dn=Dennis+Lehane+-+Moonlight+Mile+-+unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rmctmrx6","files":106,"time":1289023187,"description":"Dennis Lehane - Moonlight Mile - unabridged 128 kbps\n\nAcclaimed New York Times best-selling author Dennis Lehane delivers an explosive tale of integrity and vengeance - heralding the long-awaited return of private investigators Patrick Kenzie and Angela Gennaro. Amanda McCready was four years old when she vanished from a Boston neighborhood 12 years ago. Kenzie and Gennaro risked everything to find the young girl - only to orchestrate her return to a neglectful mother and a broken home. Now Amanda is 16 - and gone again. Haunted by their consciences, Kenzie and Gennaro revisit the case that troubled them the most. Their search leads them into a world of identity thieves, methamphetamine dealers, a mentally unstable crime boss and his equally demented wife, a priceless, thousand-year-old cross, and a happily homicidal Russian gangster. It's a world in which motives and allegiances constantly shift and mistakes are fatal. In their desperate fight to confront the past and find Amanda McCready, Kenzie and Gennaro will be forced to question if it's possible to do the wrong thing and still be right or to do the right thing and still be wrong. As they face an evil that goes beyond broken families and broken dreams, they discover that the sins of yesterday don't always stay buried, and the crimes of today could end their lives.","torrent":{"xt":"urn:btih:c2d91305129472f8b3491e1a2ba049c2f0f3da5e","amp;dn":"Dennis+Lehane+-+Moonlight+Mile+-+unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2d91305129472f8b3491e1a2ba049c2f0f3da5e","infoHashBuffer":{"type":"Buffer","data":[194,217,19,5,18,148,114,248,179,73,30,26,43,160,73,194,240,243,218,94]},"announce":[],"urlList":[]}}