{"title":"Minor Sick - Fremdscham in Reality","uid":5946734,"size":260863271,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c397209d1fe5483ef560063986d51f9398b75363&amp;dn=Minor+Sick+-+Fremdscham+in+Reality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"unfug","files":12,"time":1289347599,"description":" &lt;a href=&quot;http://www.duzzdownsan.com/releases/fremdscham-in-reality/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.duzzdownsan.com/releases/fremdscham-in-reality/&lt;/a&gt; &lt;a href=&quot;\nhttp://minorsick.bandcamp.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://minorsick.bandcamp.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.hhv.de/item_219851.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hhv.de/item_219851.html&lt;/a&gt;\n\nthis is a prerelease, if you like it buy it, sounds like dorian concept, maybe a little bit less chaotic\n\nVienna`s vibrant electronic hip hop scene has had it`s share of profile acts that not only earned large acclaim by international audiences and critics, but also came to influence the genre as a whole. With Fremdscham in Reality, Minor Sick, an artist previously known to a privileged few, enters the scene in style - with a whispered Fuck you all. Born in Vienna, Christoph Prager (alias Minor Sick) has roamed the country as a DJ and as bassist of the popular Austrian rap/reggae band B Seiten Sound for much of the past decade. His influences range from rap, funk and soul to Hard Bop, Roots Reggae and the recent surge of the vast unnamed genre of instrumental hip hop of the likes of Flying Lotus or Hudson Mohawke. His first solo piece titled Harte Liebe in der Realitaet EP (Hard Love in Reality EP) of 2009 marked the first appearance of his new sound and style which very much counters many of the attempts on a more popular appeal in his early career. His introspective first album Fremdscham in Reality isn`t meant to be light. And for the most part it isn`t meant solely to entertain. Fremdscham is the german word for feeling embarassed by the public embarassement of others. Minor Sick escapes this painful feeling of empathy by regressing to a state of musical childdom with all it`s simple beauty, innocence and purity. But in the process he lets this theme collide with mature sophistication, with violence, with destruction and the chaos of thought. Nothing is simple in Minor Sick`s music, nothing is absolute. There is always a counterpart to melody, always the contrast of subtle beauty and blaring terror, lucid dream and harsh reality.","torrent":{"xt":"urn:btih:c397209d1fe5483ef560063986d51f9398b75363","amp;dn":"Minor+Sick+-+Fremdscham+in+Reality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c397209d1fe5483ef560063986d51f9398b75363","infoHashBuffer":{"type":"Buffer","data":[195,151,32,157,31,229,72,62,245,96,6,57,134,213,31,147,152,183,83,99]},"announce":[],"urlList":[]}}