{"title":"Wolves_And_Machines-Ailments-2010-FNT","uid":6110142,"size":72777258,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c6bfa95d4fc6d29b6775b5dff498a1c4091e19be&amp;dn=Wolves_And_Machines-Ailments-2010-FNT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HalfEvil333","files":15,"time":1295319871,"description":"Release Info --------------------------------------------------------------\n\nArtist:      Wolves &amp; Machines\nAlbum:       Ailments\nLabel:       Capeside Records\nPlaytime:    46:13 min\nGenre:       Rock\nURL:        \nRip date:    2011-01-14\nStreet date: 2010-09-28\nSize:        72.36 MB\nType:        Normal\nQuality:     205 kbps / 4410kHz / Joint Stereo\n\nRelease Notes -------------------------------------------------------------\n\nEnter Wolves &amp; Machines, a quartet from Michigan, US, whose debut album\n&quot;Ailments&quot; was recently recommended to me by our own good DR. I have since\ntaken quite a liking to it, and I'm beginning to wonder if it could grow into\na dark horse role in so far as making my list is concerned. But until I\nactually write the damn thing, I guess that doesn't really interest you\npeople at all, so let me explain what this sounds like.\n\nIt took me a while to make the connection, but these days, I think what\nprimarily makes &quot;Ailments&quot; so appealing is that its instrumental tone reminds\nme a lot of original emocore, delightfully mixing soaring melodies with\nabrasive walls of distortion. There are however, quite a few more ingredients\nin this delicious compound. For instance, the mainstay of the vocal work is\ndelivered in a raw Jimmy Stadt-ish (Polar Bear Club) voice which contributes\nboth in the lead and in backing roles. This delivery will often alternate\nwith a mumble/whisper style resemblant of those used by bands like Brand New,\nCrime In Stereo or The Xcerts, and topping things off there are sparkling\nguitar hooks and moments of odd moods - part anthemic, part tranquil - which\nreminds me of Lydia.\n\nIt may sound a bit strange, but in reality it works like a charm. The songs\nperfectly escort the listener between dreamy, floating soundscapes, and\nblood-rush, punk-rock outbursts which soak in the kind of raw emotion that\nemo and hardcore-purists are always on the prowl for. All are generally well\nwithin the territory between 'good' and 'great', and personally I recommend\nmaking special notice of the opening duo &quot;Missteps&quot; and &quot;Nomads&quot;, as well as\nthe central tripod of &quot;Wages&quot;, &quot;Discords&quot; and &quot;Ailments&quot;, the last of which\nis particularly memorable, via great signature riffage and chorus.\n\nIn fact, &quot;Ailments&quot; is a very good record, especially considering that it's a\ndebut, and there isn't really all that much to complain about. I get the\nfeeling that more experience and slightly increased production options could\nhave helped the band make even more of especially their more subtle moments,\nand also there surely is room for these guys to get more versatile in their\nsongwriting. But that being said, the sound of this is still so good that it\ncan hardly be ignored, and without further ado, I think it's time I just tell\nyou people to give this disc a whirl, just before I mark it with a\nwell-deserved: [8]\n\nFor The Fans Of: Moneen, Crime In Stereo, Brand New, The Xcerts\n\nTrack List ----------------------------------------------------------------\n\n01. Missteps                                                          ( 3:21)\n02. Nomads                                                            ( 4:34)\n03. Tides                                                             ( 4:17)\n04. Trespasses                                                        ( 3:01)\n05. Fevers                                                            ( 4:37)\n06. Wages                                                             ( 4:10)\n07. Discords                                                          ( 3:46)\n08. Ailments                                                          ( 4:49)\n09. Harbors                                                           ( 4:01)\n10. Rogues                                                            ( 5:14)\n11. Anchors                                                           ( 4:23)\n\nStripped by HeXagon's Advanced NFO Stripper: http://www.stripnfo.com\n","torrent":{"xt":"urn:btih:c6bfa95d4fc6d29b6775b5dff498a1c4091e19be","amp;dn":"Wolves_And_Machines-Ailments-2010-FNT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6bfa95d4fc6d29b6775b5dff498a1c4091e19be","infoHashBuffer":{"type":"Buffer","data":[198,191,169,93,79,198,210,155,103,117,181,223,244,152,161,196,9,30,25,190]},"announce":[],"urlList":[]}}