{"title":"Night At The Roxybury(1996)DVDRip.AC3(ENG)-DROCK","uid":6016351,"size":732762112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c716b4d4cdb2117f08b8e6b686d5ce7d6d5f2616&amp;dn=Night+At+The+Roxybury%281996%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1291645586,"description":"This comedy extends and embellishes characters introduced on Saturday Night Live by regulars Will Ferrell and Chris Kattan in their sketch series of two head-bobbing losers who go on the town, looking for action, when they hear the What Is Love? disco tune. Looking cool, brothers Steve (Ferrell) and Doug Butabi (Kattan) always fail to pick up women in their hapless nightclub jaunts. In Beverly Hills, they work at a fake-flower store run by their father (Dan Hedaya). They are always denied entrance to the Roxbury, a leading discotheque, but an auto accident with Richard Grieco (portraying himself) gives them a foot in the door. Inside, they meet the club's owner (an uncredited Chazz Palminteri), and two gold-diggers (Elisa Donovan, Gigi Rice) believe they are wealthy businessmen. Steve finds his father shoving him into marriage with next-door neighbor Emily (Molly Shannon), but Doug keeps this from happening. Fortune smiles, and the Butabi brothers become the co-owners of a new nightclub. The real-life Roxbury on the Sunset Strip (once the location of the Imperial Gardens and the Players Club) was converted into a Japanese restaurant by the time this film was released. \n\nRipped with FairUse 2 wizard.","torrent":{"xt":"urn:btih:c716b4d4cdb2117f08b8e6b686d5ce7d6d5f2616","amp;dn":"Night+At+The+Roxybury%281996%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c716b4d4cdb2117f08b8e6b686d5ce7d6d5f2616","infoHashBuffer":{"type":"Buffer","data":[199,22,180,212,205,178,17,127,8,184,230,182,134,213,206,125,109,95,38,22]},"announce":[],"urlList":[]}}