{"title":"Aces of the Pacific [dos]","uid":6217418,"size":3876589,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c9c85891273db5c61c64976106c4d40c6cab010b&amp;dn=Aces+of+the+Pacific+%5Bdos%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtSposh","files":1,"time":1299211590,"description":"Aces of the Pacific is a computer game flight simulator developed by Dynamix in 1992. Its success caused Dynamix to create a very similar sequel, entitled Aces over Europe. The game takes place during World War II. Player can choose single or instant mission, or choose to take a career path in United States Army Air Forces, United States Navy, United States Marines, Imperial Japanese Army or Imperial Japanese Navy. The game features various warplanes of the era, such as: P-40 Warhawk, P-51D Mustang, P-38 Lightning, F6F Hellcat, Zero, and Val Divebomber.\n\nIf the 1946 Expansion Pack is installed, at the end of the war, the player may choose to continue in an alternate history in which atomic bombs were never used on Japan. The game calls the campaign Operation Coronet--the name the US Military used for the planned, conventional invasion of Japan. This extra campaign contains numerous prototype aircraft that were developed before the war\\'s end but never saw combat in World War II (F2G \\&quot;Super\\&quot; Corsair, F7F Tigercat, F8F Bearcat, the P-80 Shooting Star, and even a Japanese jet-powered aircraft, the Nakajima Kikka).\n\nNumerous World War II aces make an appearance in the game, and the player can fly either with them or against them through the course of his or her career. Dick Bong, Thomas McGuire, David McCampbell, Joe Foss, and Pappy Boyington are some of the American aces that appear in the game. Accomplished aces of the Imperial Japanese Navy such as Hiroyoshi Nishizawa, Tetsuzo Iwamoto, and Saburo Sakai also take to the skies of the Pacific.\n\nThe game includes historical missions, should the player choose to play them during the course of their career or as a single mission. Historical missions include the Japanese Navy\\'s surprise Attack on Pearl Harbor, defense of Pearl Harbor by a handful of US Army Air Corps P-40 Warhawks based at Wheeler Field, fighter/bomber combat during the Battle of Midway, the Battle of Leyte Gulf, the Battle of Coral Sea and the ambush of Japanese Admiral Yamamoto by P-38s.\n\n(wiki)","torrent":{"xt":"urn:btih:c9c85891273db5c61c64976106c4d40c6cab010b","amp;dn":"Aces+of+the+Pacific+%5Bdos%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9c85891273db5c61c64976106c4d40c6cab010b","infoHashBuffer":{"type":"Buffer","data":[201,200,88,145,39,61,181,198,28,100,151,97,6,196,212,12,108,171,1,11]},"announce":[],"urlList":[]}}