{"title":"Leverage.S01.Full.3pp0.NL","uid":6124350,"size":4236234455,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c9e197129e6365c6fcc511bc1f6bb6f47ed7260d&amp;dn=Leverage.S01.Full.3pp0.NL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Eppo","files":16,"time":1295878539,"description":"Leverage Season 1 with hardburned Dutch subs.\n\nEpisode 1: The Nigerian Job\nWhen Nathan Ford, a former insurance company investigator, is approached by a man asking him to help retrieve some stolen property, he is dubious. When he finds out that the job requires him to supervise and maintain control of three known thieves that he himself caught in the course of his insurance investigations, he's more than dubious. However, the job offers him the opportunity to get some of his own back from the insurance company that allowed his son to die, so he takes it despite his misgivings. When his doubts prove to be well-founded, he persuades his reluctant colleagues to unite once more to reach a more &quot;equitable&quot; settlement.\n\nEpisode 2: The Homecoming Job\nCorporal Robert Perry, an Army reservist who fought in Iraq, was severely injured in an apparent error by Castleman Security, government contractors working in Iraq. The Army investigation clears Castleman of involvement, thus freeing them of any monetary obligation, and Perry lives too far from veteran's resources to allow him to receive government funded treatment that would allow him to work. He contacts Nathan Ford for help. What Nathan Ford and the rest of the Leverage team find is far more than a simple error.\n\nEpisode 3: The Two-Horse Job\nAfter a Wall Street broker sets fire to his stable-killing his underachieving racehorses in the process-the team visits Kentucky to help the heartsick trainer, Eliot's high school love.\n\nEpisode 4: The Miracle Job\nThe team helps Nate's former pastor save his church from the hands of a shady developer.\n\nEpisode 5: The Bank Shot Job\nWhile Nate and Sophie try to con a corrupt Judge, they are taken hostage during a botched bank robbery.\n\nEpisode 6: The Stork Job\nA job where the team tries to recover a war orphan for a grieved couple hits close to home for Parker.\n\nEpisode 7: The Wedding Job\nA job for the wife of a wrongly-jailed restaurateur lands the team between the FBI and rival mob families.\n\nEpisode 8: The Mile High Job\nThe team traces incriminating evidence about a corporation's misdeeds to two witnesses on a plane to the Cayman Islands, not knowing what the corporation has planned for the flight.\n\nEpisode 9: The Snow Job\nNate complicates a simple con regarding a sleazy contractor and the recovery of a family's house.\n\nEpisode 10: The 12-Step Job\nWhen the team cons an addicted embezzler into entering rehab, Nate confronts some of his own issues regarding alcoholism.\n\nEpisode 11: The Juror #6 Job\nWhen one of Parker's aliases receives jury duty, Nate forces her to go, resulting in a showdown between the team and a lawyer tampering with the jury.\n\nEpisode 12: The First David Job\nThe team goes after the CEO of Nate's former insurance company, responsible for denying his late son's medical care, but the situation causes conflict among the crew.\n\nEpisode 13: The Second David Job\nIn order to take down his former boss, Nate must reunite the splintered team to help him.\n\nTorrent by 3pp0 | Subs by Oxygen from www.bierdopje.com thx :)","torrent":{"xt":"urn:btih:c9e197129e6365c6fcc511bc1f6bb6f47ed7260d","amp;dn":"Leverage.S01.Full.3pp0.NL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9e197129e6365c6fcc511bc1f6bb6f47ed7260d","infoHashBuffer":{"type":"Buffer","data":[201,225,151,18,158,99,101,198,252,197,17,188,31,107,182,244,126,215,38,13]},"announce":[],"urlList":[]}}