{"title":"Oorlog van de eeuw dvd 10(Dutch)(TinkerBell) TBS","uid":6040195,"size":4683898809,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cb33b20cf2e3b0fbbeb2475849c7a2fd9b1dca90&amp;dn=Oorlog+van+de+eeuw+dvd+10%28Dutch%29%28TinkerBell%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mad_Parrot","files":67,"time":1292362095,"description":"\n\n\nDe Oorlog Van De Eeuw 10/10       \n\nDe Tweede Wereldoorlog woedde meer dan zes decennia terug en eiste meer dan 50 miljoen mensenlevens, in veldslagen van NormandiÃƒÂ« tot de Kaukasus, bij de marine en in de luchtgevechten en bombardementen op steden. Dit was een oorlog die duidelijk aantoonde hoe diep de mensheid kan zinken.\n\nDe machtsstrijd tussen twee totalitaire ideologieÃƒÂ«n, de overwinning van democratie over dictatorschap, de triomf van technologie in oorlogsvoering en het misbruik ervan voor gemechaniseerde slachtpartijen bewees uiteindelijk, in Hiroshima, dat de mensheid nu in staat was om zichzelf uit te roeien...\n\nDe val van Berlijn\nEind april 1945 was Duitsland goed en wel verslagen, maar toch wisten de Nazi's van geen opgeven. \nHoewel de Russische overmacht in Berlijn overweldigend was, luidde het bevel van de FÃƒÂ¼hrer dat de Duitse hoofdstad tegen elke prijs verdedigd diende te worden. \nHitlerjugend en Folkssturm gaven vervolgens tot hun laatste kogels gehoor aan dit bevel. \nZonder enige hoop. De Russen op hun beurt hadden de grootst mogelijke haast om Berlijn zo snel mogelijk in te nemen. \nStalin had namelijk geÃƒÂ«ist dat op ÃƒÂ©ÃƒÂ©n mei 1945 de Sovjetvlag op het Reichstaggebouw zou wapperen. En stalins bevelen werden al even strikt opgevolgd als die van Hitler.\n\nHet verloren vaderland\nMei 1945. Duitsland heeft de Tweede Wereldoorlog verloren. Berlijn ligt in Puin. \nDe gealliÃƒÂ«erden maken nu de dienst uit in Duitsland en de bevolking moet op de een of andere manier het dagelijks leven weer zien op te pakken. \nVoor de Sudetenduitsers blijkt dit echter onmogelijk. In 1938 had Hitler met toestemming van Frankrijk en Engeland delen van Tsjechoslowakije waar veel Duitsers woonden, mogen annexeren. Nu, na de ondergang van Nazi-Duitsland kwamen deze gebieden weer onder Tsjechoslowaaks gezag en \nzocht de bevolking een manier om haar woede over het het door de Duitsers aangedane onrecht te koelen. De Sudetenduitsers die vaak al generaties lang in dit gebied leefden, werden het doelwit. Ze werden onteigend en het land uitgezet. Mishandeling was aan de orde van de dag en Duitse dorpen werden met de grond gelijk gemaakt. \nNiets mocht meer aan de voormalige onderdrukker herinneren. \n \n \n\n\nNEDERLANDS GESPROKEN\n\nSpotinformatie\n \nCategorie    : Beeld \nFormaat      : DVD5 \nBron         : Retail\nOndertitels  : Nederlands (instelbaar)\nGenre        : Documentaire\n\n\n &lt;a href=&quot;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+10/10&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+10/10&lt;/a&gt; \n\n\n \n \n \n\n\n*****************************************\n\nBrought to you by TinkerBell TBS","torrent":{"xt":"urn:btih:cb33b20cf2e3b0fbbeb2475849c7a2fd9b1dca90","amp;dn":"Oorlog+van+de+eeuw+dvd+10%28Dutch%29%28TinkerBell%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb33b20cf2e3b0fbbeb2475849c7a2fd9b1dca90","infoHashBuffer":{"type":"Buffer","data":[203,51,178,12,242,227,176,251,190,178,71,88,73,199,162,253,155,29,202,144]},"announce":[],"urlList":[]}}