{"title":"Democracy Now - 24 nov 2010","uid":5981877,"size":454201391,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cb5370ec11af9e7c6d5fbf50bf41f76d2510cde2&amp;dn=Democracy+Now+-+24+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1290616160,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 24, 2010\n\n- Corporate America Reports Record Profits\n- Major Investment Firms Subpoenaed in Insider-Trading Case\n- Study: Anti-AIDS Drug Reduces Risk of HIV Transmission\n- UN: AIDS Epidemic Is Slowing\n- Pope: Condoms Can Be Used to Stop AIDS\n- Tensions Escalate on Korean Peninsula\n- General Strike Staged in Portugal\n- Labor Protests Planned in Ireland Over Cuts\n- Expert Warns Cholera Could Spread to 400,000 Haitians\n- Report: Massey Has Worst Safety Record in Coal Industry\n- Int'l Day for the Elimination of Violence Marked\n\n\nSpecial reports\n\n- Tim Shorrock: Direct Talks With North Korea Are the Only Answer to End Korean War\n\n&quot;The United States has only one choice in dealing with North Korea, even after its deadly artillery attack on a South Korean island,&quot; writes Tim Shorrock, an investigative journalist who has covered Korea for more than 30 years. &quot;Negotiate directly with its government, forge an agreement to end Pyongyang's nuclear weapons program, and move towards a peace agreement to formally end the Korean War.&quot; On Wednesday, South Korea found the bodies of two civilians killed in the North Korean attack. The bombardment also killed two South Korean soldiers, wounded 18 others and set dozens of homes ablaze.\n\n\n- StoryCorps Declares Friday a National Day of Listening\n\nTo mark the Thanksgiving holiday weekend, StoryCorps is declaring Friday a National Day of Listening. StoryCorps is a national social history project created by the award-winning radio producer Dave Isay. Over the past seven years, more than 30,000 interviews have been recorded, making StoryCorps one of the largest oral history projects in U.S. history. We play one of StoryCorps' most famous interviewees, the late, great oral historian, Studs Terkel.\n\n\n- Dr. Gabor MatÃƒÂ© on ADHD, Bullying and the Destruction of American Childhood\n\nA spike in diagnoses of attention deficit hyperactivity disorder (ADHD) and other mental disorders has fueled an unprecedented reliance on pharmaceutical medications to treat children, with long-term effects that remain unknown. We speak with Canadian physician and best-selling author, Dr. Gabor MatÃƒÂ©. He argues that these responses are treating surface symptoms as causes while ignoring deeper roots. Dr. MatÃƒÂ© says children are in fact reacting to the broader collapse of the nurturing conditions needed for their healthy development.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cb5370ec11af9e7c6d5fbf50bf41f76d2510cde2","amp;dn":"Democracy+Now+-+24+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb5370ec11af9e7c6d5fbf50bf41f76d2510cde2","infoHashBuffer":{"type":"Buffer","data":[203,83,112,236,17,175,158,124,109,95,191,80,191,65,247,109,37,16,205,226]},"announce":[],"urlList":[]}}