{"title":"Glee - S01E17 - Bad Reputation [Np]","uid":5938902,"size":366773752,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cc254d851ec09427614db15d6db932fc654fc097&amp;dn=Glee+-+S01E17+-+Bad+Reputation+%5BNp%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoahPuckerman","files":1,"time":1289066197,"description":"Name: Glee\nSeason: 1\nEpisode: 17\nEpisode Name: Bad Reputation\nOriginal Air Date on TV: May 4, 2010\n\n\nEpisode Plot\n(Via: Wikipedia)\n\nWhen glee club member Kurt Hummel (Chris Colfer) steals a video of cheerleading coach Sue Sylvester (Jane Lynch) performing Olivia Newton-John's &quot;Physical&quot; in Jazzercise, the club members decide to post it on YouTube as a prank. Sue is mortified, and in retalliation gives Principal Figgins (Iqbal Theba) a list she has found, called a &quot;glist&quot;, which ranks the glee club members based on a sexual promiscuity quotient. Figgins tells club director Will Schuester (Matthew Morrison) that he must either find the creator of the list, or he will be forced to disband the glee club and suspend all of its members. Will reprimands the club members, and for their weekly club assignment, he has the students find songs with bad reputations and rehabilitate them, performing Vanilla Ice's &quot;Ice Ice Baby&quot; as an example.\n\nSue is ridiculed by her co-workers regarding her appearance in the video, and makes an enemy of her new colleague, alcoholic astronomy teacher/badminton coach Brenda Castle (Molly Shannon). Sue is reminded by her sister, Jean (Robin Trocki), who has Down Syndrome, that when they were hurt as children they would volunteer at an animal shelter as a reminder there was always someone less fortunate than themselves. In light of her sister's advice, Sue decides to act as a therapist to school guidance counselor Emma Pillsbury (Jayma Mays), informing her that Will has been unfaithful to her. Emma confronts Will in the teachers' lounge, publicly shaming him.\n\nGlee club members Kurt, Mercedes (Amber Riley), Artie (Kevin McHale), and Tina (Jenna Ushkowitz) are upset over not being included on the list, while Brittany (Heather Morris) is aghast at not being listed among the top three - especially after her stints at making out with everyone in the school, boys, girls, the school janitor. They perform a rendition of &quot;U Can't Touch This&quot; in the school library to cause a disruption in the hope of earning a bad reputation. Their plan backfires, and the librarian asks them to perform at her church's Sunday service. Next, Kurt confesses to Sue that he is the one who stole her video. Prior to his confession, however, Sue is contacted by Olivia Newton-John, who requests her help remaking the &quot;Physical&quot; video. As a result, Sue actually thanks Kurt for his actions. The song's re-release gains Sue a position in the top 700 recording artists, ending the ridicule by her colleagues - in which she rubs it in their faces. She donates her share of the profits to her sister's residential care facility.\n\nAfter apologizing to Emma and presenting her with flowers, Will sees a depressed-looking Quinn (Dianna Agron) in the hallway and suspects that she is responsible for the list. He confronts Quinn, who confesses. To prevent her from being suspended, Will lies to Figgins that no culprit has been found, but convinces him that as no new lists have been posted, they should drop the matter.\n\nRachel asks Puck to assist her in their glee assignment, creating a video for David Geddes' &quot;Run Joey Run&quot;. Unbeknownst to each of them until the video is completed, she also has Finn (Cory Monteith) and Jesse (Jonathan Groff) triple-cast in the role of her boyfriend, Joey. They are offended to see they were all playing the same role and were edited in at different points during the video. Puck and Finn become angry, and Jesse breaks up with Rachel as a result. The episode closes with Rachel singing a rendition of Bonnie Tyler's &quot;Total Eclipse of the Heart&quot; as the club members leave the classroom.\n\nI Will Be Uploading All Glee Episodes As Single Files Then All Together (:\nI Will Also Be Uploading All Albums To Each Season (:\n\nEnjoy (: &amp; Please Seed \n\nThanks\n\n- [Np]\n","torrent":{"xt":"urn:btih:cc254d851ec09427614db15d6db932fc654fc097","amp;dn":"Glee+-+S01E17+-+Bad+Reputation+%5BNp%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc254d851ec09427614db15d6db932fc654fc097","infoHashBuffer":{"type":"Buffer","data":[204,37,77,133,30,192,148,39,97,77,177,93,109,185,50,252,101,79,192,151]},"announce":[],"urlList":[]}}