{"title":"Djelimady Tounkara Sigui","uid":6074081,"size":317603674,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf2e415ab5f63a6555cb9e47209ec234b878d958&amp;dn=Djelimady+Tounkara+Sigui&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ocnrf","files":16,"time":1293750717,"description":"Djelimady Tounkara has achieved legendary status as the leader of Mali's Super Rail Band; now he gets the chance to step out on his own for the first time with Sigui, and it's a gorgeous experience. On a mix of Super Rail cuts and traditional Malian songs performed acoustically, he gets a chance to show the true breadth and depth of his immense talent. For much of the disc he's content to lead from the back, letting others -- be they singers or ngoni players -- take the spotlight -- with his fretwork introducing the numbers then adding runs to slide through the song and push it along gently. But on both &quot;Djoura&quot; and &quot;Samakoun&quot; it's all Tounkara, and the stunning fluency of his invention and expression is a joy to hear. He's been called one of the three best guitarists in the world, and on the basis of this, it's possible that title doesn't even do him justice. The sumptuous, swinging solo in &quot;Mande Djeliou&quot; is a lesson in how to play the guitar, staying rooted in your own tradition but still taking on board influences from all areas of music and making them entirely your own. And to prove it's no fluke, he shows again and again just how to play, such as with the solo of &quot;Amary Ndaou.&quot; a sheer masterpiece of construction. Whether working in the griot tradition that informs the title cut and &quot;Yamaryo,&quot; or the praise singing of &quot;Amary Ndaou,&quot; Tounkara reinvents the Manding tradition in glorious fashion, with a vibrancy that illustrates exactly why he's deified as a player. An essential purchase for people who considers themselves guitarists or guitar lovers. \n\nEAC rip log Cue sheet art work","torrent":{"xt":"urn:btih:cf2e415ab5f63a6555cb9e47209ec234b878d958","amp;dn":"Djelimady+Tounkara+Sigui","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf2e415ab5f63a6555cb9e47209ec234b878d958","infoHashBuffer":{"type":"Buffer","data":[207,46,65,90,181,246,58,101,85,203,158,71,32,158,194,52,184,120,217,88]},"announce":[],"urlList":[]}}