{"title":"Pink Floyd - P.U.L.S.E.  H.264 .m4v/.mp4","uid":5945271,"size":5627547804,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cf57b34ef0d265cef13830c0aebea5ea12b5d188&amp;dn=Pink+Floyd+-+P.U.L.S.E.++H.264+.m4v%2F.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tmax666","files":4,"time":1289338791,"description":"- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nPink Floyd - P.U.L.S.E.  H.264 .m4v/.mp4\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nJudging from the number of downloads o shows that I've packaged into  H.264 MP4's, there appears to be a large demand for these shows in a modern video container.  AVI's have become obsolete. \n\nHowever, to support these and future downloads I ask YOU KEEP SEEDING after your download is complete.  I suggest you set a minimum UL speed of 30 kB/s by right clicking on the torrent in your Bittorrent client and adjusting the Bandwidth Allocation.  This will free up my bandwidth for new torrent uploads.  THANKS!\n---------------------------------------------------------------------------\nI took VIDEO TS files of each of the two DVD's and ripped H.264 MP4 files of each movie.  The files have a suffix of .m4v as they were ripped using HandBrake 0.9.4 so they can be played on any current iPod, iPhone, iPad, Apple TV or in iTunes.  They can also be played on any compliant player but you may need to change the suffix from .m4v to .mp4.\n\nA note about the audio:\n\nThe videos indicate a separate channel with Dolby Digital 5.1 when you &quot;Get Info&quot; using iTunes. For a better explanation of this go to:\n &lt;a href=&quot;\nhttp://trac.handbrake.fr/wiki/SurroundSoundGuide&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://trac.handbrake.fr/wiki/SurroundSoundGuide&lt;/a&gt;\n\nThe second and third paragraphs apply to these rips. But as I understand it, all the suffixes must remain .m4v.\n\nAll I really know is I get 5.1 surround sound when I play on my 1st Gen Apple TV\n===========================================================================\n\nPink Floyd - P.U.L.S.E. (1994 - DVD released in 2006)\n\nDavid Gilmour and long-time Floyd producer James Guthrie labored to restore, re-edit, and remix this legendary concert video in 5.1-channel Dolby Surround Sound. The resulting two-disc set was well worth the wait: While the limitations of the original video source are still evident in the sometimes-hazy image quality (Gilmour would later admit the concert should have been captured on film), Floyd fans will unanimously agree that Pulse has never looked or sounded better, and only the absence of group co-founder Roger Waters prevents this from being the ultimate document of Pink Floyd in performance. (Even without Waters, it's easily one of the group's most impressive stage productions.) Gracefully directed with minimal intrusion by veteran music video and concert director David Mallet, and shot on video during Pink Floyd's two-week stint at London's Earls Court Exhibition Centre in October 1994, this 145-minute performance (from Floyd's Division Bell tour) is a sonic marvel to behold. Under a massive arch festooned with then-state-of-the-art laser, lighting, and projection systems, the 1987 incarnation of Pink Floyd (Gilmour, keyboardist Richard Wright, and drummer Nick Mason) and their stellar supporting band kicks off with &quot;Shine on You Crazy Diamond&quot; (a loving tribute to Floyd co-founder Syd Barrett), followed by four tracks from The Division Bell, two from 1987's A Momentary Lapse of Reason, &quot;Another Brick in the Wall (Part 2)&quot; from 1979's magnum opus The Wall, and leading into intermission with an absolutely stunning performance of &quot;One of These Days,&quot; the timeless opening track from 1971's Meddle.\n\nThe centerpiece of Disc 2 is a near-perfect performance of 1974's Dark Side of the Moon in its entirety--reason enough to make this a must-have DVD for even the most casual Floyd admirers. And while no one will ever re-create the sheer magnificence of Clare Torry's original tour de force vocals on &quot;The Great Gig in the Sky,&quot; it's safe to say that backup singers Sam Brown, Claudia Fontaine, and Durga McBroom deliver the next best thing, in addition to seamless contributions throughout the concert. After the closing heartbeat of &quot;Eclipse,&quot; the concert ends with encore performances of &quot;Wish You Were Here,&quot; &quot;Comfortably Numb,&quot; and a no-holds-barred, pyrotechnically explosive rendition of The Wall's &quot;Run Like Hell,&quot; all showcasing Gilmour's guitar mastery with frequent close-ups of his picking and fret-work as seen throughout the concert. (Like Gilmour, Mason and Wright were never dynamic onstage, and that's true here as well, but their technical precision is fully evident, and while guitarist Tim Renwick and saxophonist Dick Parry are each given moments to shine, bassist Guy Pratt is a worthy substitution for Waters, especially when vocally sparring with Gilmour on &quot;Run Like Hell.&quot;)\n","torrent":{"xt":"urn:btih:cf57b34ef0d265cef13830c0aebea5ea12b5d188","amp;dn":"Pink+Floyd+-+P.U.L.S.E.++H.264+.m4v%2F.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf57b34ef0d265cef13830c0aebea5ea12b5d188","infoHashBuffer":{"type":"Buffer","data":[207,87,179,78,240,210,101,206,241,56,48,192,174,190,165,234,18,181,209,136]},"announce":[],"urlList":[]}}