{"title":"Flu and Flu Vaccines - What's coming Through That Needle (2DVD)","uid":5972968,"size":6524748327,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d18cd9d5e718b104bc1228036bf376f2f05f6a9a&amp;dn=Flu+and+Flu+Vaccines+-+What%5C%27s+coming+Through+That+Needle+%282DVD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lord_offo","files":-1,"time":1290358277,"description":"Dr. Sherri Tenpenny's DVD, Flu and Flu Vaccines: What's Coming Through That Needle, explores the problems associated with annual flu shots.  In addition to the Truth about the effectiveness of flu shots, the two hour presentation will detail:\n\n    *\n      How influenza viruses are selected each year for the vaccine\n    * The six labor-intensive steps involved with the manufacture of flu shots\n\n    * The low prevalence of influenza viruses in circulation\n\n    * The low number of persons per year that actually die from the flu\n    * The reality of flu shot side effects\n    * Flu shots and asthma\n    * Problematic ingredients: animal cells, detergents, polysorbate 80, formaldehyde, gelatin, mercury and more\n    * Problematic adjuvants: aluminum, AS03, MF59 and squalene\n    * The serious problem with latex and rubber stoppers used in the vials\n    * How to refuse flu shots\n    * The truth about vaccination antibody titers\n    * The truth about Tamiflu, the medication for influenza\n    * An overview of possible things to come: Mandatory flu shots for all\n    * How to stay well without the flu shot\n\n\nThis presentation is the most complete guide to influenza and influenza vaccines you will find all in one location. Some elements of manufacture, production and delivery of influenza vaccines is often in flux. This presentation is designed with information that stays constant, year after year.It is a must-see for anyone who has ever questioned the safety or effectiveness of the seasonal campaign.\n\n \n\nDr. Tenpenny's vaccine information is essential for anyone who is intent on making a fully informed decision about vaccination. ","torrent":{"xt":"urn:btih:d18cd9d5e718b104bc1228036bf376f2f05f6a9a","amp;dn":"Flu+and+Flu+Vaccines+-+What%5C%27s+coming+Through+That+Needle+%282DVD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d18cd9d5e718b104bc1228036bf376f2f05f6a9a","infoHashBuffer":{"type":"Buffer","data":[209,140,217,213,231,24,177,4,188,18,40,3,107,243,118,242,240,95,106,154]},"announce":[],"urlList":[]}}