{"title":"a kidzcorner christmas 4 movie pack in xvids by winker-1337x-kid","uid":6041064,"size":3132328743,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d1b471461be902cde7a85f0aac4411dddf835c1d&amp;dn=a+kidzcorner+christmas+4+movie+pack+in+xvids+by+winker-1337x-kid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alanwatson","files":-1,"time":1292391056,"description":"miracle on 34th street\n\nIn this new holiday 'miracle' , based on the famous 1947 film classic, a little girl discovers dreams can come true if you really believe. Six-year-old Susan Walker has doubts about childhood's most enduring miracle - Santa Claus. Her mother told her the 'secret' about Santa a long time ago, so Susan doesn't expect to receive the most important gifts on her Christmas list. But after meeting a special department store Santa who's convinced he's the real thing, Susan is given the most precious gift of all something to believe in.\n\nelf\n\nOnce upon a Christmas Eve, an orphan baby crawled into Santa's bag of gifts and was taken to the North Pole. Raised by Papa Elf (Bob Newhart), Buddy (Will Ferrell) comes to realise he doesn't fit in with the other elves. Determined to find a place where he belongs, Buddy searches for his real dad - in New York City!\nIn the Big Apple, Buddy finds out why his dad (James Caan) is on the naughty list! But most importantly, he sees that the world is seriously lacking in Christmas spirit, which causes Santa all kinds of problems! So with the help of a beautiful department store elf (Zooey Deschanel), Buddy tries to teach his dad and the world the true meaning of Christmas spirit and to prove to everyone that Santa (Ed Asner) really exists!\n\n\none magic christmas\n\nAward-winning actress Mary Steenburgen (Melvin and Howard) gives a solid performance as Ginny Grainger, a young mother who rediscovers the joy and beauty of Christmas, thanks to the unshakable faith of her six-year-old daughter Abbie (Elisabeth Harnois) and Gideon (Harry Dean Stanton), Ginny's very own guardian angel. Ginny's wondrous experience will touch your heart and warm your soul in the timeless tradition of past Disney favourites. One Magic Christmas fulfils all your most treasured Christmas fantasies. Share it with those you love.\n\n\nCelebrate the season with Winnie the Pooh in a brand new full-length adventure. Share the joy and magic of the holidays as Pooh and his lovable friends enjoy Christmas and New Year in a delightful tale about spending special moments with those you care about most. After fond recollections of a Christmas past... the countdown to New Year begins! Rabbit plans a party, but when Pooh and friends bother Rabbit, he starts to sulk - threatening to move away. To appease him, everyone makes a New Year's resolution to change. Then see what happens to the Hundred Acre Wood when Piglet starts bouncing to conquer his fear, Pooh becomes gloomy from not eating any honey, and Tigger... unbounc-able!\nFeaturing 4 New Christmas Songs!\nFor the first time, hear Pooh and his friends sing their own rendition of &quot;Jingle Bells,&quot; &quot; Auld Lang Syne,&quot; and other holiday favourites.","torrent":{"xt":"urn:btih:d1b471461be902cde7a85f0aac4411dddf835c1d","amp;dn":"a+kidzcorner+christmas+4+movie+pack+in+xvids+by+winker-1337x-kid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1b471461be902cde7a85f0aac4411dddf835c1d","infoHashBuffer":{"type":"Buffer","data":[209,180,113,70,27,233,2,205,231,168,95,10,172,68,17,221,223,131,92,29]},"announce":[],"urlList":[]}}