{"title":"P.A.HDRip.Castellano","uid":6104647,"size":2364782848,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d1d0958b01d26d6c687b75b3145d69e6ead272a1&amp;dn=P.A.HDRip.Castellano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1295115624,"description":"Calidad de video: HD Rip\nPeso: 2200 mb\nIdioma del audio: Castellano AC3 5.1\n\nCuando una joven pareja de clase media se muda a lo que parece ser la tipica casa de un barrio periferico de nueva construccion, empieza a ser perturbada por una presencia,maligna o no, que se muestra especialmente activa durante las noches. Especialmente cuando la pareja duerme. O intenta hacerlo. La presencia parece muy preocupada por Katie, una estudiante que toda su vida se ha sentido poseida. Su novio, Micah, operador de bolsa, se obsesiona con investigar a fondo el fenomeno. Conocedor de las tecnologias y amante de los juguetes, Micah compra por unos miles de dolares una camara de video de alta definicion que coloca a los pies de la cama, consiguiendo asi un escenario intimo y un medio de saber que pasa realmente.\n\nLa llegada del nuevo juguete de Micah parece desencadenar una mayor actividad paranormal, y Katie se de cuenta de que a la presencia no le ha gustado. A medida que la cinta avanza, Katie se vuelve mas distante, mientras que la fascinacion de Micah va haciendose mas obsesiva.\n\nCineasta por necesidad, Micah resulta ser tan tenaz -y profano como Heather en El proyecto de la bruja de Blair. Sin embargo, su distinto punto de vista -el de un hombre que defiende su hogar- confiere una desesperacion muy particular a este nuevo tipo de trabajo documental. Despues de todo, el ve como su mejor amiga, su alma gemela, su companera, es alejada de el noche a noche, fotograma a fotograma... \n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:d1d0958b01d26d6c687b75b3145d69e6ead272a1","amp;dn":"P.A.HDRip.Castellano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1d0958b01d26d6c687b75b3145d69e6ead272a1","infoHashBuffer":{"type":"Buffer","data":[209,208,149,139,1,210,109,108,104,123,117,179,20,93,105,230,234,210,114,161]},"announce":[],"urlList":[]}}