{"title":"Honkytonk Man - Deutsch, English, Spanish; Multi.subs","uid":6054945,"size":4475764035,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d2eca5f40b909bc1c222e6c43d287022995db362&amp;dn=Honkytonk+Man+-+Deutsch%2C+English%2C+Spanish%3B+Multi.subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"abajanga2","files":11,"time":1292873718,"description":"Honkytonk Man\n\n\nClint Eastwood\nKyle Eastwood\n\nDirected by Clint Eastwood \nProduced by Clint Eastwood \nWritten by Clancy Carlile (novel), Clancy Carlile (screenplay)\nStarring Clint Eastwood\nKyle Eastwood\nBarry Corbin\nAlexa Kenin\nJoe Regalbuto\nTim Thomerson \nMusic by Steve Dorff \nCinematography Bruce Surtees \nEditing by Ferris Webster\nMichael Kelly\nJoel Cox \nStudio The Malpaso Company \nDistributed by Warner Bros. \nRelease date(s)  December 15, 1982\n \n\n\n\n-----------------------------\n\nFormat : DVD Video (DVD-5)\n\nAudio Format : AC-3 \nLanguage : 1 channels German, 1 channels Spanish, 6 channels English \nSampling rate : 48.0 KHz \n\nText:  English, German, Spanish, French, Italian, Swedish, Norwegian, Danish, Finnish, Croatian, Czech, Greek, Hebrew, Hungarian, Icelandic, Polish, Portuguese, Turkish, Slovenian, English (more info : Normal), German (more info : Normal)\n\n---------------------------------------------\nEnglish:\n\nHonkytonk Man ist ein US-amerikanischer Film aus dem Jahr 1982. Regie fÃƒÂ¼hrte Clint Eastwood, der auch die Produktion und die Hauptrolle ÃƒÂ¼bernahm. Das Drehbuch schrieb Clancy Carlile anhand des eigenen Romans, der wiederum vom kurzen Leben des Countrymusikers Jimmie Rodgers inspiriert war.\n\nDie Handlung spielt in den USA wÃƒÂ¤hrend der GroÃƒÅ¸en Depression. Red Stovall trÃƒÂ¤umt von einer Karriere als Country-SÃƒÂ¤nger. Er und sein Neffe Whit reisen nach Nashville, wo Red in der Grand Ole Opry vorsingen mÃƒÂ¶chte. Unterwegs nehmen sie Marlene mit. Doch am Ziel verschlechtert sich der Zustand des an Tuberkulose erkrankten Stovall. Aufgrund seiner Krankheit muss Stovall das Vorsingen abbrechen, sein groÃƒÅ¸er Traum, berÃƒÂ¼hmt zu werden, scheint zerplatzt.\n\nStovall lernt in Nashville den Musiker Smoky kennen. Gerade so schafft es Stovall, mit Smoky seine Songs aufzunehmen. Er stirbt kurz nach den Aufnahmen in Nashville an Tuberkulose. Doch Stovalls Songs bleiben unsterblich.\n\nquelle: http://de.wikipedia.org/wiki/Honkytonk_Man\n\n\n----------------------------------------------\nDeutsch:\n\nHonkytonk Man is a 1982 drama film set in the Great Depression. Clint Eastwood, who produced and directed the film, stars in the film with his son, Kyle Eastwood. Clancy Carlile's screenplay is based on his novel of the same name. This was Marty Robbins' last appearance before he died.\n\nClint Eastwood plays a would-be western singer named Red Stovall suffering from tuberculosis who is finally given an opportunity to make it big at the Grand Ole Opry. He is accompanied by his young nephew (played by Eastwood's son Kyle) to Nashville, Tennessee where he is supposed to record a song.\n\nAfter a series of adventures which include the nephew's &quot;coming of age&quot; in a house of ill repute, he and Uncle Red finally arrive at Nashville, only to have the tuberculosis reach a critical stage in the middle of the recording session, where Red's lines are filled in by a side guitarist (played by Marty Robbins). Red finally succumbs while his nephew vows to tell the story of his uncle. Red's vintage touring auto, prevalent throughout the movie, finally 'dies' at the cemetery where Red is laid to rest.\n\nresource: http://en.wikipedia.org/wiki/Honkytonk_Man\n\n\n-------------------------------------------------------------------\n\nTracker: udp://tracker.openbittorrent.com:80/announce\n","torrent":{"xt":"urn:btih:d2eca5f40b909bc1c222e6c43d287022995db362","amp;dn":"Honkytonk+Man+-+Deutsch%2C+English%2C+Spanish%3B+Multi.subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2eca5f40b909bc1c222e6c43d287022995db362","infoHashBuffer":{"type":"Buffer","data":[210,236,165,244,11,144,155,193,194,34,230,196,61,40,112,34,153,93,179,98]},"announce":[],"urlList":[]}}