{"title":"Layer Cake.DVDrip. Norsk tekstet. Rippet av Robban","uid":6011747,"size":1253321342,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d371dfbec2a71245d0908c296c1e572a8b522a98&amp;dn=Layer+Cake.DVDrip.+Norsk+tekstet.+Rippet+av+Robban&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pobban","files":1,"time":1291480401,"description":"Plot\nThe film centers on a cocaine distributor played by Daniel Craig. The character, who also narrates the film, is deliberately unnamed throughout, but is listed in the credits as &quot;XXXX&quot;. XXXX has established a successful business in London buying, cutting, and selling cocaine while avoiding the largesse and gangster behavior associated with drug dealing. Having made his fortune, he plans to retire from the business for good.\n\nXXXX's powerful supplier, Jimmy Price (Kenneth Cranham) sends him to track down Charlie, the teenage daughter of Price's associate, Eddie Temple (Michael Gambon), who has fled a rehabilitation centre with her drug-addicted boyfriend. In reality, XXXX is being sent to kidnap Charlie to help Jimmy blackmail Temple over a bad investment.\n\nAt the same time, Price instructs XXXX to organize the purchase and distribution of one million ecstasy tablets from a gangster named The Duke (Jamie Foreman). Unbeknownst to XXXX, the pills have been stolen from a gang of Serbian war criminals in Holland. Jimmy has found out about XXXX's plans to retire, and believes that either the Serbian gang or Eddie Temple's mercenaries will kill XXXX, allowing him to recover some of his losses (the accountant used by XXXX has stolen his money, having been working for Price) . Meanwhile, XXXX encounters The Duke's idiotic nephew, Sidney (Ben Whishaw) at a bar, and becomes attracted to Sidney's bored girlfriend Tammy (Sienna Miller).\n\nXXXX's world gradually unravels as he discovers Jimmy Price is informing for the police; XXXX's associate, Morty (George Harris) goes into hiding after brutally beating and scalding a former associate with boiling tea in a cafe; the Duke and his gang mysteriously disappear; and the ruthless Eddie Temple involves himself in the already bungled ecstasy deal.\n\nXXXX devises an elaborate scam to play his various adversaries off against one another and ends up in the clear with most of his enemies dead, even after Temple steals the Ecstasy by withholding all payment other than a lifetime membership to the exclusive, Stoke Park Club. He sticks to his original plan to retire, but as he and Tammy leave a celebratory lunch with his associates, he is shot on the front steps of the country house restaurant by Sidney in revenge for stealing his girlfriend. The film ends with XXXX left lying bleeding on the steps, his fate unknown. Although there is an alternative ending that sees XXXX getting into his flash new car and driving off with Tammy (Sienna Miller).\n\nThis alternative ending was filmed at the insistence of Sony who tried to veto the lead characters apparent death.[citation needed] It was only due to Director Matthew Vaughn threatening to disavow the project that the current ending was kept.\n\n\nSEED for alle:-)\n\nRobbanPobban\n\n","torrent":{"xt":"urn:btih:d371dfbec2a71245d0908c296c1e572a8b522a98","amp;dn":"Layer+Cake.DVDrip.+Norsk+tekstet.+Rippet+av+Robban","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d371dfbec2a71245d0908c296c1e572a8b522a98","infoHashBuffer":{"type":"Buffer","data":[211,113,223,190,194,167,18,69,208,144,140,41,108,30,87,42,139,82,42,152]},"announce":[],"urlList":[]}}