{"title":"Debbie Harry - In Love With Love (2nafish)","uid":6066058,"size":117803012,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d3d72d82e629ae56c80b1d94fd29e78b4afee7ac&amp;dn=Debbie+Harry+-+In+Love+With+Love+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1293358273,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;In Love with Love&quot; is the fourth track from the 1986 album Rockbird, and second single to be released from the album by Debbie Harry.\n\nLyrically, the song is the sequel to Blondie's &quot;Heart of Glass&quot;, according to Harry. The song was released on May 9, 1987 and was, to date, her only solo single to reach #1 on the US dance chart. The single also went on to become a minor hit in several countries, including number forty-five in the UK and number seventy in the US. &quot;In Love With Love&quot; remains Harry's most recent Billboard Hot 100 hit to date.\n\nThe song was the second single released off Rockbird in the US, but it was the third single released off the album in the UK. The music video features Harry dancing in front of various cultural backdrops in a couple different outfits throughout the clip.\n\nThe UK single version of &quot;In Love With Love,&quot; was remixed and produced by the Stock Aitken Waterman production team, who at the time were producing many popular singles in both the UK and the US by artists such as Bananarama, Dead or Alive, Rick Astley, Kylie Minogue and Jason Donovan. As a result, Geffen Records issued a second 12&quot; of the song in the US including these UK mixes, labelling them &quot;London Mixes&quot;.\n\nIn 1988 both the US &quot;Heart Of Fire Mix&quot; of &quot;In Love With Love&quot; and the French language version of &quot;French Kissin' In The USA&quot; were included on the Blondie/Debbie Harry remix compilation Once More into the Bleach. The Stock Aitken Waterman version of &quot;In Love With Love&quot; appears in its edited 7&quot; form on Chrysalis Records/EMI's 1999 compilation Most of All - The Best of Deborah Harry.\n\nRockbird is the second solo album by the American singer Debbie Harry.\n\nRockbird was Harry's second solo album following the split of Blondie in 1982. It was produced by Seth Justman, a key member of the J. Geils Band. Released in November 1986, there were five variations of the album artwork with the lettering either green, orange, purple, pink and yellow.\n\nThe album peaked at number 32 in the UK, and remained in the charts for 11 weeks. Although one of her lowest charting solo albums to date, it was ironically the highest selling and was certified &quot;Gold&quot; by the BPI in January 1987. Three singles were released from the album, &quot;French Kissin' In The USA&quot;, which reached number 8 in the UK to become Harry's only solo top 10 single in that territory, &quot;In Love With Love&quot;, which reached number 45, and ballad &quot;Free To Fall&quot;, which reached number 46. &quot;French Kissin'&quot; also reached number 57 on the US Billboard Hot 100.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d3d72d82e629ae56c80b1d94fd29e78b4afee7ac","amp;dn":"Debbie+Harry+-+In+Love+With+Love+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3d72d82e629ae56c80b1d94fd29e78b4afee7ac","infoHashBuffer":{"type":"Buffer","data":[211,215,45,130,230,41,174,86,200,11,29,148,253,41,231,139,74,254,231,172]},"announce":[],"urlList":[]}}