{"title":"1408(2007)DVDRip.AC3(ENG)-DROCK","uid":6012203,"size":735649792,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d5ac158dec29c04bf497178f489b793c1156a7e0&amp;dn=1408%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1291500935,"description":"A writer renowned for debunking infamous paranormal events is confronted by a force that he cannot explain upon checking into room 1408 of the notoriously haunted Dolphin Hotel. Mike Enslin (John Cusack) is an author who specializes in horror, but who only believes in what he can see with his eyes and touch with his hands. Having constructed an entire career on his ability to dispel superstitious &quot;haunted house&quot; rumors, Mike is convinced that the afterlife is a manmade construct designed to offer false comfort to the weak minded. Mike's latest project is a book entitled &quot;Ten Nights in Haunted Hotel Rooms,&quot; and it seems that in room 1408 of the Dolphin Hotel, this skeptical scribe may finally find proof of the supernatural. Implored by the hotel manager (Samuel L. Jackson) not to enter room 1408, Mike defiantly procures the key and prepares to dispel yet another spectral sham. Now, as is the case with many of life's most profound epiphanies, the writer who thought he knew it all is caught entirely off guard at the precise moment he least expected it. Subsequently faced with undeniable proof of an afterlife, Mike may have a best-seller on his hands if he can simply survive until sunrise. Mary McCormack and Jasmine Jessica Anthony co-star in director Mikael HÃƒÂ¥fstrÃƒÂ¶m's (Derailed) adaptation of an original short story by horror icon Stephen King.\n\nRipped with DVD Decrypter and Autogk.\t\t","torrent":{"xt":"urn:btih:d5ac158dec29c04bf497178f489b793c1156a7e0","amp;dn":"1408%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5ac158dec29c04bf497178f489b793c1156a7e0","infoHashBuffer":{"type":"Buffer","data":[213,172,21,141,236,41,192,75,244,151,23,143,72,155,121,60,17,86,167,224]},"announce":[],"urlList":[]}}