{"title":"Serrallonga.1X02.(Final).HDTV.Xvid.Spanish.By.Ainhdesi","uid":6066792,"size":676694128,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d694d3cc3f941f71c48b6bc855bfca32e0d46e2d&amp;dn=Serrallonga.1X02.%28Final%29.HDTV.Xvid.Spanish.By.Ainhdesi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ainhdesi","files":3,"time":1293397579,"description":"Capitulo 2\nSerrallonga es la historia de un hombre, Joan Sala, convertido en leyenda al huir de la justicia por un crimen cometido en defensa propia, que le obliga a hacerse al monte junto con otros bandoleros. En la misma banda convivirÃƒÂ¡ con uno de sus hermanos y un enemigo de la infancia. Poco a poco su fama de rebelde se extiende por los pueblos y es llegado a ser conocido como el Rey de Les Guilleries. El populacho lo apoya, asÃƒÂ­ como los nobles, que ven en ÃƒÂ©l una posibilidad de enfrentamiento con la Corona, lo cual incrementa su fama de manera imparable. Pero serÃƒÂ¡ su antiguo enemigo Antic quien sea el encargado de dar caza al bandolero, quien verÃƒÂ¡ como todos sus apoyos se desmoronan, debiendo huir para no ser detenido. El resto de su historia lo llevarÃƒÂ¡ por tierras francesas antes de regresar a CataluÃƒÂ±a donde conocerÃƒÂ¡ que su mujer estÃƒÂ¡ encarcelada y sus amigos y hermanos asesinados. El final de su vida no serÃƒÂ¡ sino el inicio de su leyenda. Basada en hechos y personajes reales, la serie recrea la vida de uno de los bandoleros mÃƒÂ¡s famosos de CataluÃƒÂ±a durante el siglo XVII, un periodo en el que se pueden contabilizar mÃƒÂ¡s de 200 bandidos solo en esa zona. La penuria, el hambre y el descontento popular hacÃƒÂ­an a los hombres llevar una vida de saqueos continuados. Es en este ambiente donde se desarrolla la historia de Serrallonga.","torrent":{"xt":"urn:btih:d694d3cc3f941f71c48b6bc855bfca32e0d46e2d","amp;dn":"Serrallonga.1X02.%28Final%29.HDTV.Xvid.Spanish.By.Ainhdesi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d694d3cc3f941f71c48b6bc855bfca32e0d46e2d","infoHashBuffer":{"type":"Buffer","data":[214,148,211,204,63,148,31,113,196,139,107,200,85,191,202,50,224,212,110,45]},"announce":[],"urlList":[]}}