{"title":"Red Hot Chili Peppers - Freaky Styley (1985) WMA320","uid":6095799,"size":137252818,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d772bbe0b745f0ca36ecec8ade6841ce5b306491&amp;dn=Red+Hot+Chili+Peppers+-+Freaky+Styley+%281985%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1294769310,"description":"Before they were international superstars known for their soothing, mellow and soulful ballads, the Red Hot Chili Peppers were four poverty-stricken L.A punks making some of the funkiest music known to man. In the spirit of P-Funk recordings from the 70s, Freaky Styley is laden with springy bass lines, funkdafied guitar, and edgy, uneven drum grooves. Far from accessible, Freaky Styley is nonetheless an interesting, unique, and extremely original white-boy funk album. \n\nThe most intriguing prescence on the album would most certainly be guitarist Hillel Slovak, whose funky guitar dominates almost any track, lifting all of them to new heights. Tracks such as &quot;Hollywood&quot; and &quot;Jungle Man&quot; are guitar heavy, with super-charged funk-laden riffs that are as musically complex and interesting as much of John Frusciante's work. His noodling will no doubt be respected by listeners of all ages and backgrounds, even if it's not necessarily their kind of music. The virtuoso bassist Flea has some interesting pieces here as well, but don't be expecting any of his genius that comes through on Mother's Milk or BloodSugarSexMagik. He was surely one of the most talented bassists of the eighties, but he had yet to come into his own as a songwriter, as some of the basslines are repetitive and are consistently dominated by the outstanding guitar; Slovak and Flea are both extremely talented, but don't have the chemistry that the Frusciante-Flea team display. \n\nAnthony Kiedis also had yet to become the lead singer he is today, his voice has very little range on this album, and his lyrics are seriously undeveloped. Tracks like &quot;Catholic School Girls Rule&quot; are fun, but will leave the listener wanting more after five songs in a row witht he same lyrical content. His charismatic and confident voice however, makes up for many of its shortcomings, and he definitely connects with the rest of the band. Cliff Martinez gives very strong work here as well, easily rivaling anything current drummer Chad Smith has done over the years. \n\nIf you've heard Californication and By the Way and are looking for some of the funkier Chili Peppers, I would suggest starting with BloodSugarSexMagik. If you enjoy tracks on that such as &quot;Mellowship Slinky in B major&quot; and &quot;Sir Psycho Sexy,&quot; Freaky Styley would be a great second purchase. Drenched in L.A cool, it's a unique, funky and outright weird experience you won't soon forget. \n\nby John Doe &quot;Andy&quot;\n\nTRACKLIST:\n\n01 - Jungleman.wma                                                    \n02 - Hollywood (Africa).wma                                           \n03 - American Ghost Dance.wma                                         \n04 - If You Want Me To Stay.wma                                       \n05 - Nevermind.wma                                                    \n06 - Freaky Styley.wma                                                \n07 - Blackeyed Blonde.wma                                             \n08 - The Brothers Cup.wma                                             \n09 - Battleship.wma                                                   \n10 - Lovin' And Touchin'.wma                                          \n11 - Catholic School Girls Rule.wma                                   \n12 - Sex Rap.wma                                                      \n13 - Thirty Dirty Birds.wma                                           \n14 - Yertle The Turtle.wma                                            \n15 - Nevermind (Demo).wma                                             \n16 - Sex Rap (Demo).wma                                               \n17 - Freaky Styley (Original Long Version).wma                        \n18 - Millionaires Against Hunger (Unreleased).wma  \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:d772bbe0b745f0ca36ecec8ade6841ce5b306491","amp;dn":"Red+Hot+Chili+Peppers+-+Freaky+Styley+%281985%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d772bbe0b745f0ca36ecec8ade6841ce5b306491","infoHashBuffer":{"type":"Buffer","data":[215,114,187,224,183,69,240,202,54,236,236,138,222,104,65,206,91,48,100,145]},"announce":[],"urlList":[]}}