{"title":"Red Dead Redemption [R.Free][Xbox360][Multi5][Spanish][www.conso","uid":6102048,"size":6781000077,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:d7eeb85c3b5d4b5e20346995c0cc5900f790c61f&amp;dn=Red+Dead+Redemption+%5BR.Free%5D%5BXbox360%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.conso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":35,"time":1294966563,"description":"Plataforma: X360\nNÃ‚Âº de Jugadores: 1 Online: No\nGÃƒÂ©nero: AcciÃƒÂ³n, Shooter, Aventura\nVideo: R.Free\nIdiomas: espaÃƒÂ±ol\n\nResumen:\nEn este contexto aparece nuestro protagonista: John Marston, un fuera de la ley que ha abandonado su vida de criminal para formar una familia y gozar de una tranquila paz. No obstante, el pasado no puede olvidarse nunca, motivo por el que los agentes del Bureau (que mÃƒÂ¡s tarde serÃƒÂ¡ el FBI) irrumpen para dar lugar a una historia ÃƒÂ©pica y oscura que nos tocarÃƒÂ¡ descubrir a lo largo de un videojuego donde la frontera entre el bien y el mal nunca va a estar completamente definida.\n\nEsta es la interesante y enigmÃƒÂ¡tica trama que esconde Red Dead Redemption, una enorme obra que retransmite una autÃƒÂ©ntica sensaciÃƒÂ³n de encontrarnos en el Oeste americano. Arrojados en medio del desierto, los chicos de Rockstar nos mostraron la tremenda profundidad de los escenarios. &quot;PodÃƒÂ©is ir hasta donde alcance vuestra vista&quot;, nos decÃƒÂ­an los responsables de la demo mientras que avanzÃƒÂ¡bamos a lomos de un caballo que se adaptaba perfectamente a la orografÃƒÂ­a del terreno gracias al reformado motor Euphoria. Colinas, valles y abundante vegetaciÃƒÂ³n conformaban el realista paisaje de Nuevo MÃƒÂ©xico, levantado sobre una tonalidad de marrones perfectamente escogidos, los cuales parecÃƒÂ­an sacados de uno de los muchos westerns grabados en el sur de EspaÃƒÂ±a.\n\nLa fuerza del motor RAGE (utilizado en GTA IV) se hace visible desde el primer momento, gracias a un dibujado continuo de un horizonte que en esta ocasiÃƒÂ³n no estÃƒÂ¡ tapado por edificios. En Red Dead Redemption, la concepciÃƒÂ³n de mundo abierto adquiere una dimensiÃƒÂ³n diferente que en GTA IV, siendo aquÃƒÂ­ necesario recorrer largos caminos al trote o al galope de un caballo.\n\nRed Dead Redemption\nEn lo nuevo de Rockstar San Diego no todo es tan simple como diferenciar entre buenos y malos. Tal es asÃƒÂ­, que nosotros decidiremos si actuar o no ante las injusticias, ganando o perdiendo fama y honor.\nÃ‚Â¡Se busca!\nPero no os preocupÃƒÂ©is, que Rockstar San Diego ya se ha encargado de que ninguno de nuestros trayectos sea aburrido. Por ejemplo, en nuestras pruebas un jinete mexicano aparecÃƒÂ­a tristemente abatido en el suelo, pidiendo auxilio en espaÃƒÂ±ol y con un exquisito acento sureÃƒÂ±o. &quot;SeÃƒÂ±or, ayÃƒÂºdeme&quot;, gritaba antes de levantarse rÃƒÂ¡pidamente para robarnos el caballo y escapar al grito de &quot;te engaÃƒÂ±ÃƒÂ©, hijo de puta&quot;.\n\nPor tanto, Red Dead Redemption va a gozar de un entorno vivo, con multitud de escenas aleatorias que se irÃƒÂ¡n sucediendo en nuestro particular camino como cowboys solitarios: ejecuciones pÃƒÂºblicas en medio de la nada, convictos escapando de un convoy, asaltos a diligencias, despiadados robos... y nosotros tendremos la elecciÃƒÂ³n de actuar o dejar que todo siga su curso natural, obteniendo de esta manera mÃƒÂ¡s o menos fama y honor como forajidos.\n\nA este respecto, hemos de comentar el renovado sistema de notoriedad que Rockstar introduce con respecto a GTA IV. Evidentemente, ahora todo se adapta a las dinÃƒÂ¡micas del lejano Oeste, de manera que se nos perseguirÃƒÂ¡ por todo aquello que constituya un delito contra el gobierno federal o alguno de sus empleados. Por ejemplo, disparar a un agente serÃƒÂ¡ una falta grave, que vendrÃƒÂ¡ seguida de un cartel de WANTED en rojo que nos acompaÃƒÂ±arÃƒÂ¡ allÃƒÂ¡ donde vayamos. Incluso despuÃƒÂ©s de haber abandonado la escena del crimen y estar aparentemente a salvo, una cifra en dÃƒÂ³lares quedarÃƒÂ¡ permanentemente al lado del sÃƒÂ­mbolo de bÃƒÂºsqueda. Es la suma por nuestra cabeza, y no la haremos desaparecer hasta que no obtengamos el perdÃƒÂ³n de la autoridad o sobornemos a alguien.","torrent":{"xt":"urn:btih:d7eeb85c3b5d4b5e20346995c0cc5900f790c61f","amp;dn":"Red+Dead+Redemption+%5BR.Free%5D%5BXbox360%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.conso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7eeb85c3b5d4b5e20346995c0cc5900f790c61f","infoHashBuffer":{"type":"Buffer","data":[215,238,184,92,59,93,75,94,32,52,105,149,192,204,89,0,247,144,198,31]},"announce":[],"urlList":[]}}