{"title":"Pokeporn v1.7 - Gary Oak !SRBWBk1PZU","uid":6090924,"size":2002336575,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:dbe514c6b01d62e2e8c8375c9918121d3e8ec743&amp;dn=Pokeporn+v1.7+-+Gary+Oak+%21SRBWBk1PZU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GaryOakar","files":8072,"time":1294557484,"description":"Hello /vp/! First official upload to TPB. I need to get finishing v1.8 since this is very old.\n\n---\nREADME file\n\nPokemon Porn archive v1.7\nAt the time of this upload on TPB, the Archive has been downloaded 6678 times from DDLs.\n\nName: -------- Gary Oak !ArcHiVe/T2 (New tripcode)\nEmail: ------- &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;9cdbfdeee5d3fdf7c8eef5ecfafdfbdcfbf1fdf5f0b2fff3f1&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nTwitter:------\n\n---\nHello! Its Gary Oak here to thank you for dl'ing this archive, everything is named and sorted (mostly), but don't expect the sorting to be perfect. I'm only human! This archive took a lot of work on my part. So remember to thank and seed! There's a lot of stuff in here, so don't be daunted by it. There should be more than enough for your average anon. If you can fap to all of this in a month, then you are a legend.\n\nThis update has a few problems. First, I've recieved a massive amount of porn again from qnqnx, and thus I'm having a lot of trouble sorting though all of it as much of it was unorganized. Second, there's a lot of non-porn in this archive because of the large RAR, so I might not of deleted it all. And third, I wanted to get this out this weekend at LEAST. So if you are unsatisfied with this, you can always wait for v1.8 for a vastly improved version!\n\nIf you want to help me distribute the archive. Copy and paste relevant links into a porn thread and sage. That IS the point of this, to reduce new porn threads by distributing porn to everyone so there is no need for new threads. You can find them on my twitter, or you can always copy the links from the thread into a text document.\n\nFAQ\n---\nQ: Why is there no gay?\nA: There is too much gay porn to sort through when looking for porn. And I am not gay myself.\n\nOccasinally one slips through me though, if so, just contact me though my email to change it.\n\nQ: Why is there so many pictures in the &quot;Misc&quot; categories when there are pokemon/girls that could fit in another category?\nA: Because there is just too many too sort through. Trust me, when you are sorting through thousands of pictures, you end up not giving a fuck about sorting.\n\nQ: Something is in the wrong place!\nA: Sorry about that, I tried to organize them, but some of them aren't all black and white in differences, plus some things may be in the wrong place because I didn't see it or bothered to sort \nit.\n\nQ: Why is there so much shit in this?\nA: When you have saved this many pictures, you can't expect all of them to be perfect. The average\nanon wouldn't care anyways and would fap regardless. I admit that I should of deleted some, but there is just so much I can't delete EVERYTHING. If you seriously have a problem with it, why not delete it yourself?\n\nQ: When do you make threads?\nA: Whenever I feel like it, I stopped posting on a schedule since mods and bombers know when the post  times are. So I've decided to go rouge and make a thread when I feel like it, but it won't be daily.\n\nQ: Why is there a lot of X pokemon/character compared to Y pokemon/character?\nA: Most of the porn I recieve is in the form of RARs from many various anons and tripfags that do not have absolutely EVERYTHING. I'm sorry if your favorite pokemon isn't in here, but the majority should be fine with this. There is also the fact that there simply isn't enough porn for all 600ish pokemon.\n\nQ: What can I do to help?\nA: Spoiler all your porn, don't raid, be polite, and if there's a conversation, you \nare welcome to join.\n\nQ: I keep posting but I sometimes accidentially forget to spoiler? wat do?\nA: First, don't panic. click the check mark next to your post and scroll down and press delete. You will have to wait a few seconds before you are allowed to delete your post, I believe the time is around 45-60 seconds.\n\nQ: Okay, that's great. How do I prevent it from happening again?\nA: If you use Google Chrome, here is a great extension that will allow the spoiler box to stay ticked. \n &lt;a href=&quot;\nhttps://chrome.google.com/extensions/detail/pinelipedelckihohgdlpcclgocodhjj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://chrome.google.com/extensions/detail/pinelipedelckihohgdlpcclgocodhjj&lt;/a&gt;\n\nIt has a quick reply box, auto-thread refresher, thumbnail viewer (It now works with spoilers, but \nis a bit buggy at times), and some other cool stuff. \n\nQ: Will there be a new thread after the first one hits image limit?\nA: Depends. If there's a lot of people who say yes, I'll go for it. If there happens to be a large\namount of spam, then no. I'd rather not go through the trouble.\n\nQ: Why isn't there a new archive yet? It's already been a few days.\nA: Because there hasn't been enough porn accumulated to call for a new archive, I haven't sorted it\nall, I am currently distributing it to pre-seeders, or because there are many problems I need to fix first.\n\nQ: Why do you post Renamon every now and again?\nA: It shows that I am switching between dumping pokegirls and pokemon. Plus, I like Renamon.\n\nQ: Can I have some of your real contact info?\nA: NOPE! Other than what I listed above, I'm not going to have random anons interfere with my\npersonal life. If you want to find out more about me, don't bother. The emails, twitter, and \nanything else is unrelated to me. Besides, it's more than enough to contact me.\n\nQ: Gary Oak? Posting porn?\nA: Yes, why not?\n\nQ: OP is a fag.\nA: Sure.\n\n---\n\nCHANGELOG\n\n&gt;v1.0\nStarted archive\nTotal Size: &lt;300mb\n\n&gt;v1.1\nTotal size: 377MB\n\n&gt;v1.2\nNew pictures, updated and fixed Readme.\nTotal size: 771.13MB\n\n&gt;v1.3\nTorrent online, more of everything.\nTotal size: 1.02GB\n\n&gt;v1.4\nReduced repeats, more pokegirls. New Doujins sections for both categories, split pokemon and pokegirls into two different downloads for DDL'ers\nTotal size: 1.07GB\n\n&gt;v1.5\nReduced repeats, sorting improved again. Added the changelog! :D\nTotal size: 1.15GB\n\n&gt;v1.6\nMassively increased Pokemon sections, more sorting will be done in v1.7, and split pokemon into two parts due to folder size.\nTotal size: 1.83GB\n\n&gt;v1.7\nMassively increased Pokegirl sections, sorted out what I consider &quot;bad&quot; and non-porn. Split pokegirls into two parts due to folder size. \nTotal size:\n\n---\n\nThanks goes out to:\nKeith, qnqnx, Trainer With a Mouth, Sofa, Pornodex Guy, Dahmer, all bombers, all the various furfriends and pokegirlfriends who contributed to this project, and of course. You.\n\n\nEnjoy!\n","torrent":{"xt":"urn:btih:dbe514c6b01d62e2e8c8375c9918121d3e8ec743","amp;dn":"Pokeporn+v1.7+-+Gary+Oak+%21SRBWBk1PZU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbe514c6b01d62e2e8c8375c9918121d3e8ec743","infoHashBuffer":{"type":"Buffer","data":[219,229,20,198,176,29,98,226,232,200,55,92,153,24,18,29,62,142,199,67]},"announce":[],"urlList":[]}}