{"title":"Halcon.(ebook).","uid":5974873,"size":7593558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dda1c5af06044f9044fa434603455f9caa308a34&amp;dn=Halcon.%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1290419801,"description":"En HalcÃƒÂ³n Jennings nos cuenta la trepidante historia de un personaje obstinado y valiente que va a ser testigo y protagonista de los acontecimientos mÃƒÂ¡s importantes del mundo de su ÃƒÂ©poca.\n\nEstas son las supuestas Ã‚Â«memoriasÃ‚Â» del godo Thorn, quien narra sus hazaÃƒÂ±as aventuras desde su insÃƒÂ³lita iniciaciÃƒÂ³n sexual en dos monasterios hasta un extraordinario viaje por toda Europa en compaÃƒÂ±ÃƒÂ­a de Wyrd, un centuriÃƒÂ³n romano convertido en cazador y trampero, que le enseÃƒÂ±a a sobrevivir en los bosques, sin olvidar su amistad con Teodorico, rey de los ostrogodos, a quien sirve como general y diplomÃƒÂ¡tico cuando el imperio romano, ya en plena decadencia, conoce un renacer gracias a este monarca.\n\nEl desarrollo de la novela, a travÃƒÂ©s de la vida de Thorn, nos transporta desde un monasterio cristiano en el reino de los Burgundios, donde crece, hasta la misma Italia acompaÃƒÂ±ando a Teodorico, quien despuÃƒÂ©s de vencer a Odoacro, se convierte en rey de la penÃƒÂ­nsula, en el ÃƒÂ­nterin nuestro personaje se desenvuelve por el norte del imperio llegando incluso hasta Constantinopla.\n\n\n\nGary Jennings nos relata en esta novela la historia de los godos, puesto que incluso nos remonta hasta los orÃƒÂ­genes mismos de la tribu en la penÃƒÂ­nsula escandinava y toda su migraciÃƒÂ³n hasta llegar a la rivera norte del Danuvio, y su contacto con el mundo romano hasta desembocar en el mÃƒÂ¡s grande de todos los godos -Teodorico- y el renacimiento que vive Italia durante su gobierno.\n\nTodo ello con el telÃƒÂ³n de fondo de la sorprendente vida secreta de Thorn, que estÃƒÂ¡ en el centro de una novela ÃƒÂ©pica cuya grandeza y energÃƒÂ­a narrativa revelan tambiÃƒÂ©n una profunda visiÃƒÂ³n de la naturaleza humana.\n","torrent":{"xt":"urn:btih:dda1c5af06044f9044fa434603455f9caa308a34","amp;dn":"Halcon.%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dda1c5af06044f9044fa434603455f9caa308a34","infoHashBuffer":{"type":"Buffer","data":[221,161,197,175,6,4,79,144,68,250,67,70,3,69,95,156,170,48,138,52]},"announce":[],"urlList":[]}}