{"title":"Using SQLite","uid":5956072,"size":8294199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfbf811f99432e03ef85085600b95d84a323291f&amp;dn=Using+SQLite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"annabelle31","files":1,"time":1289726750,"description":"This book provides an introduction to the SQLite database product. SQLite is a zero-\nconfiguration, standalone, relational database engine that is designed to be embedded\ndirectly into an application. Database instances are self-contained within a single file,\nallowing easy transport and simple setup.\nUsing SQLite is primarily written for experienced software developers that have never\nhad a particular need to learn about relational databases. For one reason or another,\nyou now find yourself with a large data management task, and are hoping a product\nlike SQLite may provide the answer. To help you out, the various chapters cover the\nSQL language, the SQLite C programming API, and the basics of relational database\ndesign, giving you everything you need to successfully integrate SQLite into your ap-\nplications and development work.\nThe book is divided into two major sections. The first part is a traditional set of chapters\nthat are primarily designed to be read in order. The first two chapters provide an in-\ndepth look at exactly what SQLite provides and how it can be used. The third chapter\ncovers downloading and building the library. Chapters Four and Five provide an in-\ntroduction to the SQL language, while Chapter Six covers database design concepts.\nChapter Seven covers the basics of the C API. Chapter Eight builds on that to cover\nmore advanced topics, such as storing times and dates, using SQLite  from scripting\nlanguages, and utilizing some of the more advanced extensions. Chapters Nine and\nTen cover writing your own custom SQL functions, extensions, and modules.\nTo complete the picture, the ten chapters are followed by several reference appendixes.\nThese references cover all of the SQL commands, expressions, and built-in functions\nsupported by SQLite, as well as documentation for the complete SQLite API.","torrent":{"xt":"urn:btih:dfbf811f99432e03ef85085600b95d84a323291f","amp;dn":"Using+SQLite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfbf811f99432e03ef85085600b95d84a323291f","infoHashBuffer":{"type":"Buffer","data":[223,191,129,31,153,67,46,3,239,133,8,86,0,185,93,132,163,35,41,31]},"announce":[],"urlList":[]}}