{"title":"Malwarebytes' Anti-Malware 1.46.rar","uid":5988149,"size":6847250,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e0a7fbf4b5a380f769e07e405fc9a21d4fb20bdd&amp;dn=Malwarebytes%5C%27+Anti-Malware+1.46.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pronob298","files":1,"time":1290806252,"description":"The well appointed Malwarebytes' Anti-Malware you will actively eradicating malware infecting your machines. The simplistic interface is divided into nine tabs, research, protection, update, quarantine, reports, exclusions, parameters, other tools. You have two methods of analysis rather swift; a quick scanning your system with a reduced basis for detection and a full review carefully analyzing all of your storage devices.\n\nThe depth exploration heuristic and your machine will register the file system or by processes loaded into memory. In case you want to accelerate the process of analysis, you will be able to disable certain tests by going to the Settings tab. A module for updating database, containing 32,319 signatures to date, provide reliable protection and updated almost daily. After each scan, Malwarebytes automatically generate a detailed analysis report format. Txt stored chronologically in the drawer Report / Logs. Rather it integrates complete, as a practical tool in the same spirit as Unlocker, which will unlock the process that prevents deleting a file recalcitrant.","torrent":{"xt":"urn:btih:e0a7fbf4b5a380f769e07e405fc9a21d4fb20bdd","amp;dn":"Malwarebytes%5C%27+Anti-Malware+1.46.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0a7fbf4b5a380f769e07e405fc9a21d4fb20bdd","infoHashBuffer":{"type":"Buffer","data":[224,167,251,244,181,163,128,247,105,224,126,64,95,201,162,29,79,178,11,221]},"announce":[],"urlList":[]}}