{"title":"Jon Boden...Songs from the Floodplain(2009)[FLAC]","uid":6007371,"size":302340857,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e3583538820091510d9bc76206f81a9030fed1d9&amp;dn=Jon+Boden...Songs+from+the+Floodplain%282009%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":17,"time":1291360700,"description":"2009 Songs From the Floodplain    CD  Navigator NAVIGATOR21 \n\n1 We Do What We Can   3:54 \n2 Going Down to the Wasteland   3:12 \n3 Days Gone By   3:41 \n4 Penny for the Preacher   3:05 \n5 Dancing in the Factory   3:58 \n6 Beating the Bounds   4:31 \n7 The Pilgrim's Way   2:27 \n8 April Queen   3:40 \n9 When the Walls Come Tumbling Down   5:09 \n10 Don't Wake Me Up 'Til Tomorrow   5:05 \n11 Under Their Breath   4:07 \n12 Has-Been Cavalry   5:36 \n\nAt first glance Jon Boden's second solo album sounds like another collection of well-crafted folk tunes. Closer inspection reveals it to be something altogether different. These are in fact hand-me-down songs from a time that has yet to happen. \nSet in some post-apocalyptic Albion, these are tales about life in a post-industrial wasteland where the barbed-wire and the ivy intertwine; a place where hope hasn't entirely dwindled away, but it may be on its last legs. \n\nOpening and closing with the sound of falling rain (perhaps the very Hard Rain that Dylan warned us about way back when), Boden maps out a desolate place where what's left of the population have fallen prey to chronic fear, huddling in small insular communities. \n\nIf the notion of a concept album somehow strikes you as indicative that he's given in to some prog-rock pomposity, stop worrying. \n\nGiven that the bulk of the traditional folk repertoire deals with great disasters and challenging events of times gone by, Boden's dipping into the song-book of the days of future passed produces some glorious tunes borne from grim adversity. \n\nThroughout, his vocals reveal an unexpected tenderness and an almost poetic incisiveness that sometimes gets lost in the mix in his day job with folk ensemble, Bellowhead.\n\nIn the album's poignant centre-piece, Dancing In The Factory, he observes ''We cling to words like children and seek for hidden meaning/ Long after sense has ceased to be and reason is receding/ But words have torn this world apart and left us stooped and pleading/We shovel dust and hide our hope and wrap ourselves in dreaming''.\n\nAccompanied by a lonely accordion, and emotion breaking his voice, when Boden sings on the chorus, ''And all that I can think about is wood smoke in the valley / kisses in the fall-out shelter, dancing in the factory/ That closed so long ago'', the sense of complete devastation is overwhelming. \n\nA beautifully profound and dramatic record that has all the makings of a future classic. --Sid Smith\n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/11/24/jon-boden/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/11/24/jon-boden/&lt;/a&gt;","torrent":{"xt":"urn:btih:e3583538820091510d9bc76206f81a9030fed1d9","amp;dn":"Jon+Boden...Songs+from+the+Floodplain%282009%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3583538820091510d9bc76206f81a9030fed1d9","infoHashBuffer":{"type":"Buffer","data":[227,88,53,56,130,0,145,81,13,155,199,98,6,248,26,144,48,254,209,217]},"announce":[],"urlList":[]}}