{"title":"Democracy Now - 02 dec 2010","uid":6005428,"size":452485594,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e4407cfb7eb01b62cbe90dc38eedc0d84e9f0169&amp;dn=Democracy+Now+-+02+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1291307581,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 02, 2010\n\n- Report:Police Await Arrest Warrant for Assange\n- Amazon Drops WikiLeaks Website\n- Admin Cancels Atlantic, Gulf Drilling But OKs it in Alaska\n- Report: SEC, Banks in Talks to Settle Securities Probes\n- FCC Chair Backs Two-Tiered Internet Fees\n- Senate GOPers Threaten Fillibusters to Maintain Tax Cuts for Wealthy\n- Deficit Panel Releases Proposals to Cut Spending Ahead of Vote\n- U.S. Soldier Sentenced for Shooting Afghans\n- Egyptian Opposition Group to Boycott Runoff Vote\n- GOP to Disband House Panel on Global Warming\n- Fmr. New Orleans Police Officer Sentenced to 8 Years for Danziger Shootings\n- Illinois Lawmakers Approve Recognition of Civil Unions\n\n\nSpecial reports\n\n- Attorney Confirms WikiLeaks Founder Julian Assange inResponds to U.S. Attacks\n\nAs the whistleblowing website WikiLeaks continues to publish secret U.S. diplomatic cables, its founder Julian Assange is facing international arrest over allegations in Sweden. In the U.S., Attorney General Eric Holder has announced WikiLeaks is the target of a criminal probe and some politicians have accused him of violating the Espionage Act. We speak to Assange's attorney in London, Jennifer Robinson.\n\n\n- Jeremy Scahill: WikiLeaks Cables Confirm Secret U.S. War Ops in Pakistan\n\nDespite sustained denials by the Pentagon, the leaked cables from WikiLeaks confirm that U.S. military Special Operations forces have been secretly working with the Pakistani military to conduct offensive operations and coordinate drone strikes in the areas near the Afghan border. A U.S. embassy cable from October of 2009 states, &quot;These deployments are highly politically sensitive because of widely-held concerns among the public about Pakistani sovereignty and opposition to allowing foreign military forces to operate in any fashion on Pakistani soil.&quot; The cables confirm aspects of a story about the covert U.S. war in Pakistan published in The Nation magazine last year by investigative journalist and Democracy Now! correspondent Jeremy Scahill.\n\n\n- UN Special Rapporteur Juan Mendez: Instead of Focusing on Assange, U.S. Should Address WikiLeaks' Disclosures of Torture\n\nOne of the leaked State Dept. cables urges diplomats to gather intelligence about &quot;plans and intentions of member states or UN Special Rapporteurs to press for resolutions or investigations into US counterterrorism strategies and treatment of detainees in Iraq, Afghanistan or Guantanamo.&quot; We speak to Juan Mendez, the new UN Special Rapporteur on Torture and Other Cruel, Inhuman and Degrading Treatment or Punishment. He's called on the U.S. to investigate and prosecute torture committed under former President George W. Bush. He also said he hopes to visit Iraq and GuantÃƒÂ¡namo Bay to probe widespread torture allegations. Mendez says: &quot;We seem to be focusing on whether disclosing [the cables] merits some kinds of action against Julian Assange...\nI am very concerned about the documents that show that thousands of people first imprisoned by U.S. forces [were] transferred to the control of forces in Iraq and perhaps even in Afghanistan where they knew they were going to be tortured.&quot;\n\n\n- Professor, Author Jacob Hacker on &quot;Winner-Take-All Politics: How Washington Made the Rich Richer-And Turned Its Back on the Middle Class&quot;\n\nOn Capitol Hill, Senate Republicans are threatening to filibuster every bill until the Democrats agree to extend the Bush-era tax cuts to all income groups. The Obama administration and many Democrats want to retain the lower rates only for individuals with an annual income of $200,000 or less and married couples earning no more than $250,000 a year. We speak with Yale University professor and co-author of the new book, Winner-Take-All Politics: How Washington Made the Rich Richer-And Turned Its Back on the Middle Class.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:e4407cfb7eb01b62cbe90dc38eedc0d84e9f0169","amp;dn":"Democracy+Now+-+02+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4407cfb7eb01b62cbe90dc38eedc0d84e9f0169","infoHashBuffer":{"type":"Buffer","data":[228,64,124,251,126,176,27,98,203,233,13,195,142,237,192,216,78,159,1,105]},"announce":[],"urlList":[]}}