{"title":"Make Way For Tomorrow (1937)","uid":6079284,"size":1167506962,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e45bae4e1bdaff2f4959ea03f025aae22b610a99&amp;dn=Make+Way+For+Tomorrow+%281937%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"timelyone","files":-1,"time":1294035563,"description":"\nMake Way for Tomorrow (1937)\n\nMake Way for Tomorrow is a 1937 American drama film directed by Leo McCarey. The plot concerns an elderly couple (Victor Moore and Beulah Bondi) who are forced to separate when they lose their house and none of their five children will take both parents in.\n\nThe film was written by ViÃƒÂ±a Delmar, from a play by Henry Leary and Noah Leary, which was in turn based on the novel The Years Are So Long by advice columnist Josephine Lawrence.\n\nMcCarey believed that this was his finest film.[1] When he accepted his Academy Award for Best Director for The Awful Truth, which was released the same year, he said &quot;Thanks, but you gave it to me for the wrong picture.&quot;\n\n\nSYNOPSIS (TCM)\t\n\n     Four of the five children of septuagenarian couple Barkley and Lucy Cooper gather to learn that their parents have lost their house. Expecting the children will soon find them a permanent home, Barkley and Lucy each go to live with a different child. Lucy unwittingly disrupts the home life of her well-meaning son George and his wife Anita by interfering with Anita's career as a bridge teacher and causing George and Anita's reckless daughter Rhoda to stop bringing her male friends home. When Rhoda's promiscuity leads the family to the brink of scandal, Anita convinces George to investigate the possibility of putting Lucy in a home for the aged, as efforts to unite Barkley and Lucy in the home of daughter Nellie Chase have foundered on the resistance of Nellie's husband. Three hundred miles away, Barkley's presence has so distressed his mean-spirited daughter Cora that she distorts a doctor's report to convince the family that Barkley must live in California with his daughter Addie. Resigning herself to permanent separation from Barkley, Lucy agrees to enter a home for the aged. The couple spends five joyous hours together in the city before the train to California separates husband and wife forever.\n\nCast &amp; Crew\n\nLeo McCarey Director\nVictor Moore as Barkley Cooper\nBeulah Bondi as Lucy Cooper\nFay Bainter as Anita Cooper\nThomas Mitchell as George Cooper\nPorter Hall as Harvey Chase\nBarbara Read as Rhoda Cooper\nMaurice Moscovitch as Max Rubens\nElisabeth Risdon as Cora Payne\nMinna Gombell as Nellie Chase\nRay Mayer as Robert Cooper\nRalph Remley as Bill Payne\n\nRelease Date 30 Apr 1937\nColor/BW Black and White\nSound Mono (Western Electric Sound System)\nProduction Dates began 11 Jan 1937\nAlternate Title(s) Years Are So Long\nDuration (in mins) 90-92\nDuration (in reels) 10\n\nPremiere Information World premiere, New York and Hollywood premiere: 7 May 1937\nDistribution Company Paramount Pictures, Inc.\nProduction Company Paramount Pictures, Inc. Company: Leo McCarey\nCountry United States\n\n\nNY TIMES Review\nReview Summary\n\nWhile not a box-office success, this drama, directed by Leo McCarey, developed a potent reputation among film critics and movie buffs for its sensitive and perceptive treatment of the problems of the elderly. When McCarey won the Oscar for Best Director the same year for The Awful Truth, he remarked that the Academy gave him the award for the wrong movie. Barkley and Lucy Cooper (Victor Moore and Beulah Bondi) are a couple in their late 60s who have fallen on hard times and have been given the bad news that the bank is foreclosing on their house. Barkley and Lucy turn to their five children for help, but none are willing or able to do much for them; their son George (Thomas Mitchell) says that Lucy can stay with him and his wife Anita (Fay Bainter), while Nellie (Minna Gombell) and her husband Harvey (Porter Hall) can take in Barkley, but neither couple have the space or the means to house them both. Living with their children and their new families proves stressful for everyone involved, and Lucy decides to take up residence in a home for older women. She and Barkley realize that this will probably mean a permanent separation for the two of them, and they try to enjoy one last outing together before they part. Remarkably, Beulah Bondi was only 46 years old when this film was made, making her less then ten years older than several of her on-screen children; make-up wizard Wally Westmore used his bag of tricks to age her the appropriate two decades for the role. ~ Mark Deming, All Movie Guide \n\nAmazon.com REVIEW\nHow, you may wonder, have you never heard of Leo McCarey's Make Way for Tomorrow, a film garlanded with the following raves from major critics: &quot;There are few American films as subtle, moving and bursting with human truth&quot; (Dave Kehr), &quot;Beautiful and heartbreaking&quot; (Roger Ebert), &quot;Hollywood movies don't get much better than this&quot; (Jonathan Rosenbaum)? The film's low profile in film history probably has a variety of causes: it flopped on its initial release, it lacks recognizable stars that might bring it residual interest, and its director, though an Oscar winner in his time, did not sustain his post-career reputation the way his contemporary and friend Frank Capra did. With the Criterion Collection's 2010 DVD release, this 1937 picture may finally assume its place of honor in the movie imagination of the public at large. Set when the Depression was still a reality, the film looks at an elderly couple, played by Victor Moore and Beulah Bondi, whose savings are gone and whose house is repossessed by the bank. The only feasible solution their children can find is to divide the parents up: Mom will stay with the eldest son (Thomas Mitchell) and his family in Manhattan, and Dad will bunk with a daughter in a small town 300 miles away. McCarey deals with this heartbreaking situation so plainly and directly, and yet with such on-target humor, that you almost don't notice how devastating the results are, and his work with Moore and Bondi--best known as character actors in film--is superb. The final half-hour bestows kindness on the couple but doesn't shy away from the story's only possible conclusion. Orson Welles described the movie's effect in perhaps the most succinct terms: &quot;It could make a stone cry.&quot; See it, and discover a classic. --Robert Horton\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6003960/The_American_Religion_Defined_In_The_Declaration_of_Independence&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6003960/The_American_Religion_Defined_In_The_Declaration_of_Independence&lt;/a&gt; \n\n","torrent":{"xt":"urn:btih:e45bae4e1bdaff2f4959ea03f025aae22b610a99","amp;dn":"Make+Way+For+Tomorrow+%281937%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e45bae4e1bdaff2f4959ea03f025aae22b610a99","infoHashBuffer":{"type":"Buffer","data":[228,91,174,78,27,218,255,47,73,89,234,3,240,37,170,226,43,97,10,153]},"announce":[],"urlList":[]}}