{"title":"Democracy Now - 11 jan 2011","uid":6095685,"size":454181972,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e494d92bc8aefc1f5e9074f4405ffe8f38ba7efa&amp;dn=Democracy+Now+-+11+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1294763670,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 11, 2011\n\n- Obama Heads to Tucson for Shooting Memorial\n- Giffords' Brother-in-Law Sends Message of Peace from Space\n- Colorado Man Arrested for Threatening Sen. Bennet\n- Tom DeLay Sentenced to Three Years in Jail\n- Gates: North Korea is Becoming a &quot;Direct Threat&quot; to U.S.\n- Biden: U.S. Troops May Stay in Afghanistan After 2014\n- Death Toll in Tunisia Rises to 35; Schools Indefinitely Shut Down\n- Lori Berenson Returns to Court in Peru\n- British Police Office Exposed for Infiltrating Green Groups\n- Anti-Torture Activists Mark 9th Anniversary of Opening of GuantÃƒÂ¡namo\n\n\nSpecial reports\n\n- Former Classmate of Jared Loughner: &quot;He Was Definitely Off...He Didn't Have the Same Stability Apparent in Most People&quot;\n\nAccused gunman Jared Lee Loughner made his first court appearance yesterday since the Jan. 8 shooting rampage that left six people dead and wounded 14 others, including Democratic Rep. Gabrielle Giffords in Tucson, Arizona. We speak with a former classmate of Loughner who sat behind him in poetry class.\n\n\n- Jared Loughner, Mental Illness and How Budget Cuts Have Slashed Behavioral Health Services in Arizona\n\nWhile federal investigators and the news media try to uncover the motivation behind Saturday's shooting rampage in Tucson, the picture emerging of the accused gunman, Jared Lee Loughner, is of a severely disturbed 22-year-old. Loughner's apparent mental health problems have shone a spotlight on issues surrounding mental health treatment in Arizona, which made drastic budget cuts to behavioral health services in 2010. We speak with H. Clarke Romans of the National Alliance on Mental Illness of Southern Arizona.\n\n\n- In Wake of Giffords Shooting, Will the Arizona Legislature Continue to Relax Gun Control Laws?\n\nJared Lee Loughner's first court appearance on Monday happened to coincide with the opening of the new session of the Arizona State legislature. Among the proposals up for debate in the new legislative session are two measures to loosen Arizona's already lax gun laws. We speak with Dr. Matt Heinz, a Tucson-based doctor and a member of the Arizona House of Representatives.\n\n\n- Dr. Richard Carmona: Non-partisan Solutions Needed in Wake of Tucson Tragedy\n\nTo place the Tucson shooting in a broader context, we speak to Dr. Richard Carmona, a public health professor at the University of Arizona. He served more than 20 years at the Pima County Sheriff's Department and was the U.S. Surgeon General under George W. Bush. Carmona addressed the issues of mental health, gun laws, and how communities cope in the face of fear and tragedy. &quot;We need to stop the partisan bickering, blaming each side of the isle,&quot; Carmona said. &quot;Thoughtful people in an adult manner need to sit down and tackle these very difficult problems. After all, that is what these elected officials have been elected for-to make good decisions on behalf of the citizens.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e494d92bc8aefc1f5e9074f4405ffe8f38ba7efa","amp;dn":"Democracy+Now+-+11+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e494d92bc8aefc1f5e9074f4405ffe8f38ba7efa","infoHashBuffer":{"type":"Buffer","data":[228,148,217,43,200,174,252,31,94,144,116,244,64,95,254,143,56,186,126,250]},"announce":[],"urlList":[]}}