{"title":"La Visa Loca (2005) DVDRip XViD Soft EngSub-sribats75","uid":6025638,"size":858750869,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e5a71b90a9645e08e605f69f527571fb2f22bdb4&amp;dn=La+Visa+Loca+%282005%29+DVDRip+XViD+Soft+EngSub-sribats75&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":6,"time":1291920453,"description":"La Visa Loca (2005) \n\nLike millions of Filipinos, Jess Huson--limo service driver and certified nursing aid/caregiver--has a dream: to get a visa and work in the United States. However, luck never seems to be on his side. After every interview with the ultra-strict US consul, Jess always goes home with a 'denied' stamped on his application. Meanwhile, Jess has to take care of his ageing but randy diabetic father, Mang Sancho, who spends his days watching TV and phoning into late night radio talk shows. To make ends meet, Jess drives around his prized client, Nigel Adams, internationally famous television host for Planet Strange, a show that documents all the world's weirdness and oddities. Jess becomes Nigel's guide to the strange universe that is Pinoy culture. They go to strip clubs that refuse to serve meat on Lent, and interview a colorful array of characters, from bulletproof shamans to enterprising penitents who charge money to be crucified. Along the way, Jess chances into an old girlfriend, Mara, who works in a carnival freak show as a sirena, a mermaid, whose authenticity is always questioned because of her bad cold (a result of being immersed in a water tank the whole day). Mara has an 8-year-old son, Jason, who may or may not be Jess' son. Incidentally, Jess also learns that Adams has a brother who operates one of the biggest nursing aid agencies in the US East Coast. But Adams' career is already on the brink unless he finally comes up with some truly bizarre footage. Talisman-toting mystics and Santo Ni?o-possessed faith healers just won't do anymore. In the end, Jess commits the ultimate sacrifice--to please Nigel with all-too important footage and to achieve his dream of going to the US. And when Jess comes inches close to his dream, he is faced with one life-changing choice. ","torrent":{"xt":"urn:btih:e5a71b90a9645e08e605f69f527571fb2f22bdb4","amp;dn":"La+Visa+Loca+%282005%29+DVDRip+XViD+Soft+EngSub-sribats75","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5a71b90a9645e08e605f69f527571fb2f22bdb4","infoHashBuffer":{"type":"Buffer","data":[229,167,27,144,169,100,94,8,230,5,246,159,82,117,113,251,47,34,189,180]},"announce":[],"urlList":[]}}