{"title":"Keith Urban - Put You In A Song (2nafish)","uid":5949018,"size":130306052,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e5ac8c92ebe253e77efc47525160b655ea9bfb27&amp;dn=Keith+Urban+-+Put+You+In+A+Song+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1289467262,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Put You in a Song&quot; is a song written by Keith Urban, Jedd Hughes, and Sarah Buxton, and recorded by Urban and released September 13, 2010. It serves as the lead-off single from his upcoming 6th American studio album, Get Closer, slated for release November 16, 2010.\n\nThe music video premiered on October 1, 2010 during CMT's Big New Music Weekend. It features footage of Keith Urban recording the song in a studio.\n\nIt debuted at #20 on CMT's Top Twenty Countdown for the week of October 8, 2010.\n\nMatt Bjorke of Roughstock gave the song a four-out-of-five star rating, citing it &quot;a sing-a-long quality song that will no doubt rocket up the country radio charts.&quot; Leeann Ward of Country Universe gave the song a B+, concluding her review by comparing the sound to the tracks on Urban's 2004 album Be Here, and calling it &quot;hopeful for the upcoming album.&quot;\n\n&quot;Put You in a Song&quot; debuted at #29 on the U.S. Billboard Hot Country Songs chart for the week of October 2, 2010. It also debuted at #82 on the U.S. Billboard Hot 100 chart for the week of October 9, 2010. It also debuted at #66 on the Canadian Hot 100 chart for the week of October 19, 2010.\n\nThe song is about a male narrator who wants to put his girlfriend in a song, and play it in his car over and over, so it seems like his girlfriend is with him everywhere he goes.\n\nGet Closer is the seventh studio album by Australian country music artist Keith Urban. It is set to be released November 16, 2010 on Capitol Records. The lead-off single, &quot;Put You in a Song,&quot; was released September 13, 2010, and debuted on Billboard Hot Country Songs charts at #29 for the week of October 2, 2010.\n\nThe lead single, &quot;Put You in a Song,&quot; was co-written by artists Sarah Buxton (who co-wrote Urban's 2006 single &quot;Stupid Boy&quot;) and Jedd Hughes. On October 22, 2010, the track &quot;Long Hot Summer&quot; was released to the US iTunes Store. On November 2, 2010, the track &quot;Without You&quot; was released to the US iTunes Store.\n\n&quot;Without You&quot; was released to the Australian iTunes Store on October 29, 2010. &quot;You Gonna Fly&quot; was also released to the Australian iTunes Store on November 5, 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e5ac8c92ebe253e77efc47525160b655ea9bfb27","amp;dn":"Keith+Urban+-+Put+You+In+A+Song+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5ac8c92ebe253e77efc47525160b655ea9bfb27","infoHashBuffer":{"type":"Buffer","data":[229,172,140,146,235,226,83,231,126,252,71,82,81,96,182,85,234,155,251,39]},"announce":[],"urlList":[]}}