{"title":"Glee - S01E09 - Wheels [Np]","uid":5938837,"size":367676980,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e60422d2da6352dd83743a1691247fbd5d9a801c&amp;dn=Glee+-+S01E09+-+Wheels+%5BNp%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoahPuckerman","files":1,"time":1289064074,"description":"Name: Glee\nSeason: 1\nEpisode: 9\nEpisode Name: Wheels\nOriginal Air Date on TV: November 11, 2009\n\n\nEpisode Plot\n(Via: Wikipedia)\n\nGlee club director Will Schuester is informed that the school budget will not cover a handicap accessible bus to transport the glee club to sectionals, meaning Artie will have to travel separately from the rest of the club. Will encourages the other club members to support Artie, not only by holding a bake sale to raise funds for a handicap bus, but also by spending time in wheelchairs to experience what life is like for him. Meanwhile, Quinn is struggling to cover the medical expenses of her pregnancy, and threatens to break up with Finn if he cannot pay her ultrasound bill. Puck fights with Finn, who he feels is not doing enough to support Quinn. By including cannabis in the cupcakes, Puck ensures the bake sale is a success and offers Quinn the money raised. She apologizes for previously calling him a loser, but refuses to accept the money, and is relieved when Finn is able to find a job.\n\nKurt and Rachel compete for a solo on &quot;Defying Gravity&quot;. The part (normally performed by a female) is initially offered to Rachel, but when Kurt's father (Mike O'Malley) complains to Principal Figgins (Iqbal Theba) that his son is being discriminated against, Kurt is allowed to audition. His father receives an anonymous abusive phone call about his son's sexual orientation, and Kurt deliberately sabotages his own audition to spare his father further harassment.\n\nArtie reveals the origin of his disability to Tina (Jenna Ushkowitz), explaining that he was paralyzed in a car accident at the age of eight. He likens his wheelchair-use to Tina's speech impediment. The two go on a date and kiss, but part on bad terms when Tina confesses that she has been faking her speech impediment since the sixth grade, in order to deflect attention from herself.\n\nHaving previously removed Quinn from the cheerleading squad due to her pregnancy, coach Sue Sylvester is forced to hold open auditions to find a replacement. She accepts Becky Jackson, a sophomore student with Down syndrome. Will is suspicious of her motives, increasingly so when Sue donates money to the school to fund three new handicap ramps for students with disabilities. It is revealed to the audience that Sue's older sister Jean also has Down syndrome, and lives in a residential home for people with disabilities. The episode ends with the glee club performing &quot;Proud Mary&quot;, staging the entire routine in wheelchairs in support of Artie.\n\nI Will Be Uploading All Glee Episodes As Single Files Then All Together (:\nI Will Also Be Uploading All Albums To Each Season (:\n\nEnjoy (: &amp; Please Seed \n\nThanks\n\n- [Np]\n","torrent":{"xt":"urn:btih:e60422d2da6352dd83743a1691247fbd5d9a801c","amp;dn":"Glee+-+S01E09+-+Wheels+%5BNp%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e60422d2da6352dd83743a1691247fbd5d9a801c","infoHashBuffer":{"type":"Buffer","data":[230,4,34,210,218,99,82,221,131,116,58,22,145,36,127,189,93,154,128,28]},"announce":[],"urlList":[]}}