{"title":"Sarah McLachlan - Happy Xmas (War Is Over) (Xvid-2nafish)","uid":6004259,"size":68782464,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e6072ddf46f7a090158f59353f796698b60694a2&amp;dn=Sarah+McLachlan+-+Happy+Xmas+%28War+Is+Over%29+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1291271852,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:47\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2295 Kbps\nQuality Factor : 0.34 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos.\n\n\n&quot;Happy Xmas (War Is Over)&quot; is a Christmas song by John Lennon, Yoko Ono and the Plastic Ono Band. It was recorded at Record Plant Studios in New York City in late October 1971, with the help of producer Phil Spector. It features soaring, heavily echoed vocals, and a sing-along chorus. The children singing in the background were from the Harlem Community Choir and are credited on the song's single. The lyrics were written by Lennon and Ono, while the melody and chord structure were taken from the folk standard known as &quot;Stewball&quot;.\n\nAlthough the song is a protest song about the Vietnam War, it has become a Christmas standard and has appeared on several Christmas albums.\n\nSarah McLachlan led off her 2006 Christmas album Wintersong with a cover of this song.\n\nWintersong is a Grammy-nominated album of Christmas songs by Canadian singer-songwriter Sarah McLachlan, released in October 2006. It was produced by longtime collaborator Pierre Marchand and includes contributions from Jim Creeggan of Barenaked Ladies. The album also includes a duet with Jazz musician Diana Krall.\n\n&quot;River&quot; was released as a single from that album in September 2006. The song was performed in mid-October on The Tonight Show with Jay Leno and The Ellen DeGeneres Show and reached #71 in the Billboard Hot 100. McLachlan's video for &quot;River&quot; premiered on Yahoo! music, on November 1, 2006.\n\nSarah Ann McLachlan, OC, OBC (born January 28, 1968(1968-01-28)) is a Canadian musician, singer and songwriter.\n\nKnown for her emotional ballads and mezzo-soprano vocal range, as of 2006, she has sold over 40 million albums worldwide. McLachlan's best-selling album to date is Surfacing, for which she won two Grammy Awards (out of four nominations) and four Juno Awards. In addition to her personal artistic efforts, she founded the Lilith Fair tour, which showcased female musicians. The Lilith Fair concert tours took place from 1997 to 1999, and resumed in the summer of 2010.\n\nIn October 2006, McLachlan released a Christmas album called Wintersong. The album included 11 new recordings, featuring covers of Joni Mitchell's &quot;River&quot;, Gordon Lightfoot's &quot;Song for a Winter's Night&quot;, and John Lennon's &quot;Happy Xmas (War Is Over)&quot;, which she recorded with her outreach children and youth choir, and seasonal favourites: &quot;Christmas Time Is Here&quot;, &quot;O Little Town of Bethlehem&quot;, &quot;Have Yourself a Merry Little Christmas&quot;, &quot;Silent Night&quot;, &quot;The First Noel&quot;, and &quot;Greensleeves (What Child Is This?)&quot;, among others. The title track is an original work of McLachlan's.\n\nWintersong debuted at No. 42 on the Billboard 200 album chart the week ending 4 November 2006. It has peaked at #7 and has sold 759,162 copies in the U.S. to date. For the week of 5 December 2006, it was the #1 album on iTunes. Worldwide the album has sold 1.1 million copies to date. It has been certified Platinum in the U.S. and 2x Platinum in Canada.\n\nWintersong was nominated for both a Grammy Award, in the Best Traditional Pop Vocal Album category, as well as for a Juno Award, for Pop Album of the Year.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e6072ddf46f7a090158f59353f796698b60694a2","amp;dn":"Sarah+McLachlan+-+Happy+Xmas+%28War+Is+Over%29+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6072ddf46f7a090158f59353f796698b60694a2","infoHashBuffer":{"type":"Buffer","data":[230,7,45,223,70,247,160,144,21,143,89,53,63,121,102,152,182,6,148,162]},"announce":[],"urlList":[]}}