{"title":"Oranje op het WK","uid":6038960,"size":565738496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e78aecc1867e934973cadc47ef68cea8c848cc0a&amp;dn=Oranje+op+het+WK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tpbtaker","files":1,"time":1292325166,"description":"Oranje op het WK is dÃƒÂ© ultieme voorbereiding op het WK 2006 in Duitsland. Aan de hand van de beelden zie je hoe Oranje onder de verfrissende leiding van bondscoach Marca van Basten voor het eerst sinds 1998 weer het WK hoofdtoernooi bereikte. Analyses van Oranje en haar tegenstanders geven de kijker een goed beeld van de kansen op een fantastisch toernooi.\n\nIn Poule C hadden naast Nederland ook ArgentiniÃƒÂ«, Ivoorkust en ServiÃƒÂ«-Montenegro zich geplaatst. Van ieder team is er een ruime samenvatting van de verschillende kwalificatiewedstrijden te zien, naast interviews met de sterspelers van ieder land. Duidelijk wordt wat Oranje toen te duchten had van rivalen als ArgentiniÃƒÂ« met o.a. Veron, Crespo, Zanetti, Riquelme en Messi, Ivoorkust met Drogba, KonÃƒÂ© en Kalou en ServiÃƒÂ«-Montenegro met o.a. Kezman. Niet voor niets sprak men toen over de 'Poule des Doods'.\n\nVan ieder team komen diverse spelers aan het woord die hun kijk geven op de kwaliteiten van hun team en de kansen om in Duitsland de volgende ronde te halen of zelfs een plaats bij de allerbesten.\n\nTevens voert de camera je mee naar verschillende speelsteden waar de meesten in 2006 Oranje waren gekleurd en wordt je een kijkje in de verschillende stadions gegund waar het Nederlands Elftal gespeeld heeft.\n\nAvi\nNederlands ondertiteld\nDVD 5\nRegio 2\nPal 4:3\n50 minuten","torrent":{"xt":"urn:btih:e78aecc1867e934973cadc47ef68cea8c848cc0a","amp;dn":"Oranje+op+het+WK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e78aecc1867e934973cadc47ef68cea8c848cc0a","infoHashBuffer":{"type":"Buffer","data":[231,138,236,193,134,126,147,73,115,202,220,71,239,104,206,168,200,72,204,10]},"announce":[],"urlList":[]}}