{"title":"PC - TRON EVOLUTION Fixed Directory by globe@","uid":6015349,"size":2341572436,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e9021636fa0ced55ec5175fbf0d6f4daedb9598a&amp;dn=PC+-+TRON+EVOLUTION+Fixed+Directory+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1291619069,"description":" * Hello PC games fans ...\n\n\n* Play the 2010 TRON game ...\n\n\n* The freeware FREEARC is needed to extract the arc file\n\n\n* FILE INFO : Complete but videos worked correctly and for the 1st time i give an indication of Fixed Directory to indicate that this game have a fixed directory to put the game folder and run a register information but all work nice , was the only solution\n\n\n* GAMEPLAY : *\n\nEvolution is a third-person action game with racing and RPG elements incorporated. The game features both singleplayer and multiplayer modes. The basic gameplay focuses on acrobatics and combat. Player's movements are heavily parkour-influenced, while combat was inspired by capoeira. The game also features light cycle races. Each cycle leaves a light trail that can hurt or &quot;de-res&quot; any enemy. Evolution features persistent character progression system, that lets players earn new levels and unlock new upgrades, both in multiplayer and singleplayer.\n\nTron: Evolution serves as a prequel to Tron: Legacy. It is designed to be an integral part of Tron story, featuring certain characters and settings from the film. The film will also reference the game's events. Evolution explains the events that led to Kevin Flynn's imprisonment inside Tron world,as well as tells how Tron world progressed through the years.The player controls Anon, short for &quot;Anonymous&quot;. This name was chosen by the game's creators in order to allow players to personify the character for themselves. Anon is a program written by Flynn to investigate a conspiracy in Tron world.\n\nMINIMUM SYSTEM CONFIGURATION\n\nMicrosoftÃ‚Â® WindowsÃ‚Â® 7 /  VistaÃ‚Â® SP2 /  XPÃ‚Â® SP3\nCPU: Intel Pentium D Processor 3 GHz or AMD Athlon 64 X2 3800+\nMemory: XP = 1GB, Vista/ Windows 7 =1.5GB\nVideo Card: Direct X 9.0c compliant video card with 256MB RAM (NVidia 8800 GT or higher, ATI Radeon HD 3870 or higher). 3D Video card supporting Shaders 3.0.  \nNOTE: Onboard (built-in) integrated chipsets are not supported,\nSound Card: 100% direct X 9.0c compatible sound card\nHard disc space: 10GB free space\nDVD-ROM Drive\nInternet connection\n\nMICROSOFT WINDOWSÃ‚Â® XP DISCLAIMER:\n\nAlthough this program will install and run on a system running Microsoft Windows XP, users with &quot;Limited User&quot; privileges will encounter difficulties. This program's installer is not designed to work around the upgraded security features that Windows XP provides. Administrative Privileges are required to install and uninstall the program. Depending on your system configuration, you may also be required to have Administrative Privileges to play this program.  Please refer to your Windows XP documentation for information about &quot;Administrative Privileges.&quot;\n\n\n\n\n* enjoy ... *","torrent":{"xt":"urn:btih:e9021636fa0ced55ec5175fbf0d6f4daedb9598a","amp;dn":"PC+-+TRON+EVOLUTION+Fixed+Directory+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9021636fa0ced55ec5175fbf0d6f4daedb9598a","infoHashBuffer":{"type":"Buffer","data":[233,2,22,54,250,12,237,85,236,81,117,251,240,214,244,218,237,185,89,138]},"announce":[],"urlList":[]}}