{"title":"Jeopardy! 13 DEC 2010 thru 17 DEC w/ COMMERCIALS","uid":6048667,"size":1680459822,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e91bb9089654d92dc4db2f1e590d72380d87fee5&amp;dn=Jeopardy%21+13+DEC+2010+thru+17+DEC+w%2F+COMMERCIALS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"higga","files":6,"time":1292649894,"description":"Jeopardy! 13 DEC 2010 thru 17 DEC w/ COMMERCIALS\n\n[b]---&gt;[/b] OLD LOGO FROM \\'08[img]http://www.chihuahuarescue.com/jeopardy_6.gif[/img] when I used to UL nightly. I got burned out by U/Ling every night until someone sent me a larger USB drive. Now, doing weekly is okay, but I can\\'t continue seeding after present is supplanted by new week because of size constraints.\n\n[b]~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~[/b]~\n\nA generous capitalization of a larger, say, 8GB usb drive would allow me to continue seeding ad infinitum for up to about 5 weeks worth at a time (the bigger the drive, the more storage and seeding commensurate with size).  Doesn\\'t hurt to ask.\n\nKeep reading below for a more technical and concise reason for this and the solution, again.\n\n[b]~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~[/b]\n  New logo of return of Jeopardy! to Demonoid [b]--&gt;[/b][img]http://img259.imageshack.us/img259/4660/alexn.gif[/img]\n\nFAQ&amp;As about the resurrected Jeaopardy! ULs on Demonoid after a 2 year hiatus:\n\n[quote]Subject: \\'Seed request: Jeopardy! 25 October 2010 thru 29 October 2010 w/ COMMERCIALS\\'\nMessage:[i]\nHey, at some point in the future, would you be willing to reseed this torrent? It\\'d be greatly appreciated.[/i][/quote]\n\nI wish I could re-seed, but I don\\'t have the files anymore because... \n\nI use a flash USB drive for all my seeding and there\\'s permanent stuff I keep on there, so each week\\'s Jeopardy! gets overwritten. \nIf someone wants to send me a 4GB (minimum) flash drive I could host them for up top 3 weeks each or if you want to send an external HDD, I would host a s many as would fit, indefinitely. Bandwidth, I have, but storage is getting tight.\n\nContact me privately if anyone is feeling generous and wants to donate some equipment.\n\n[quote][i]Also, a suggestion: If you want to cut your upload time by a good deal (especially since quality isn\\'t of paramount importance), you like using something like Handbrake, which is free and can reencode your MPEGs into MP4, which is pretty small (and people could watch episodes on their smartphones). [/i][/quote]\n\nNo, I record the shows using  EyeTV, which has excellent built-in encoding and export options and I choose the native format export because there is literally no encoding needed. It basically just copies the recording file in .mpg format. \n\nConverting to smaller/different formats takes time and ties up my machines for more than I\\'m willing to commit to at this time. I just want them off my machine and uploaded in as short of a period as possible after Friday\\'s episode so I can erase them and record more stuff my family watches. \n\nI used to UL Jeopardy here about 2 years ago, but I quit after several months because of the hassle/repsonsibility. This way (saving a week\\'s worth of shows, minimal encoding, overwriting) is the least hassle for me, so I\\'m happy to do it thi sway. \n\nThe downside is that people have to either grab them fast, or Jeopardy! fans need to seed for their fellow peers more generously.\n\n[b]~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~[/b]\n[color=Purple][b]Share the fun; please seed at least 1:1.[/b][/color]\n","torrent":{"xt":"urn:btih:e91bb9089654d92dc4db2f1e590d72380d87fee5","amp;dn":"Jeopardy%21+13+DEC+2010+thru+17+DEC+w%2F+COMMERCIALS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e91bb9089654d92dc4db2f1e590d72380d87fee5","infoHashBuffer":{"type":"Buffer","data":[233,27,185,8,150,84,217,45,196,219,47,30,89,13,114,56,13,135,254,229]},"announce":[],"urlList":[]}}