{"title":"RTB - FEET ON FIRE (Mastered by Mark Omann).mp3","uid":6127971,"size":9012896,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e91fbf114f67eda46b15ed59cfe28c09d7957c20&amp;dn=RTB+-+FEET+ON+FIRE+%28Mastered+by+Mark+Omann%29.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RTBMusik","files":1,"time":1296013064,"description":"R.T.B. is much more than the name of a rap group and entertainment company. It is the personification of a brotherhood forged and matured by the honesty of time by life on the streets of Macon, Georgia and beyond. It began as a silly pseudonym for young high school athletes to describe their brotherhood at Northeast High School, but over time these young men have come to embody a REASON TO BELIEVE. These young men have persevered through witnessing their fellow brothers being violently murdered, sentenced to prison, becoming star collegiate athletes, becoming fathers, husbands,college graduates, and most importantly men of GOD.\n\nYou can also find group members out acting in stage plays, meeting with local officials about making a positive contribution to society, or out hanging with the stars. If your network does indeed determine your net worth, then their ascension to vast weatlh will just be a coronation of destiny manifested before our very eyes.\n\nThey have already been featured on DJ VLAD\\'s VLADTV.COM and their exciting single \\&quot;FEET ON FIRE\\&quot; has been mastered by the great Universal Music Group engineer Mark Omann.\n\nR.T.B. is a light that shines through the darkness, an example of \\&quot;Impossible Possible\\&quot;, and living proof of a \\&quot;REASON TO BELIEVE\\&quot;.","torrent":{"xt":"urn:btih:e91fbf114f67eda46b15ed59cfe28c09d7957c20","amp;dn":"RTB+-+FEET+ON+FIRE+%28Mastered+by+Mark+Omann%29.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e91fbf114f67eda46b15ed59cfe28c09d7957c20","infoHashBuffer":{"type":"Buffer","data":[233,31,191,17,79,103,237,164,107,21,237,89,207,226,140,9,215,149,124,32]},"announce":[],"urlList":[]}}