{"title":"Add or swap audio tracks to DivX files instantly! moviesbyrizzo ","uid":5977048,"size":3829389,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ea342bd3471e98762cc4dcd450e2b8f102a0964e&amp;dn=Add+or+swap+audio+tracks+to+DivX+files+instantly%21+moviesbyrizzo+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1290469091,"description":"Note:\n\nThis folder was scanned for viruses etc using the popular malwarebytes anti-malware\nscanner and using the comprehensive rogers ISP subscription based anti-virus\nprogram. Clean at launch.\n\n\nDivXMux is a godsent for folks that want to add a second audio track in their own \nlanguage to a movie file they have downloaded. In fact it used to take DivX author\n5 or more hours to do this, when DivXmux (from DivX labs) takes only five minutes\nor less!\n\nWe have plans for example to make avialbel audio tracks in Fremch or Polish\nGerman, Italian Spanish or what have you - for movie files that have previously\nlaunched - where we feel there is a need or where we are made aware there is one.\n\nImagine downloading your DivX movie file, and then adding an audio track separately\ndownloaded to match your movie file, and get the files combins in just moments!\n\nIf the movie file you downloaded has an audio sync error in a second track perhaps\n(given dubs are sometimes that way by accident perhaps) you can re-import the\naudio file with an offset of plus/minus 1000 milliseconds at a time (at the moment\nanyways).\n\nYou will need to download netframe 1.1 as that is the specific version that is\nrequired although it may co-exist with a later version we are told. Its about\n26megs, free from the Microsoft website.\n\nI dont suggest you need to learn &quot;command line utilities&quot; as all you need to do\nis see the simple menu screen above. (The DivXMux GUI menu as its called).\n\nSimply pick the video file to begin with and then select the source of audio\ntracks (which can come from the same video file - other such video files, or an\nmp3 file separately obtained perhaps)and moments later - voila! A new video file\nis created with the changes made!\n\nOften in the old days DivX author used to mislabel a 720 X480 file as a 640 X480\nDivX author said so each time the file was re-openede in the DivX author edits section, or using avi-recomp or what have you! If DivXmux finds this is the \ncase, it too corrects the header to 720 X 480 so that the Divx author anomaly \nis repaired.\n\nVisit the autors site on the net if you have more quesions, although Ill try o\nhelp if you wish, with quesions that I am able to address with our limited\nuse of this product- although its been great for what we have seen it do\nwith our older DivX fles that needed second audio track additions.\n\n\nTo install:\n\n1) download and install Netframe 1.1 from the Microsoft site as indicated\n2) install the DivXgui installer in the downloaded folder\n\nYou should be set! (Worls on subtitle tracks too)\n\n\ngood luck and cheers!\n\nMichael Rizzo \n\n\nWe are busy seeding ur movies so please bear with us on the speed\nat the present time and please share!!!!!!!!!!!!!!!!! merci\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:ea342bd3471e98762cc4dcd450e2b8f102a0964e","amp;dn":"Add+or+swap+audio+tracks+to+DivX+files+instantly%21+moviesbyrizzo+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea342bd3471e98762cc4dcd450e2b8f102a0964e","infoHashBuffer":{"type":"Buffer","data":[234,52,43,211,71,30,152,118,44,196,220,212,80,226,184,241,2,160,150,78]},"announce":[],"urlList":[]}}