{"title":"DVDR Robot Jox.iso Region 1","uid":5984148,"size":3672213504,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ea424928dcb907fe95d165bc1718322d38cf6da0&amp;dn=DVDR+Robot+Jox.iso+Region+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JohnnyRimShot","files":1,"time":1290678581,"description":" Flashback to 20 years ago. &quot;Robot Jox&quot; has been released to critical acclaim amongst 10 year old kids whose parents rent movies for them from the video store inside Stop n' Shop. The film stimulates one's mind with it's complex, layered storyline, emotionally developed characters and incredibly liflike futuristic robot combat. Now 2010, &quot;Robot Jox&quot; makes it's triumphant return to The Pirate Bay.\n\n \n\n\n\n\n\nPlot:\nIt is the year 20 fucking billion, and war has been outlawed by the Democrats. National disputes are now solved via a super awesome, one-on-one deathmatch fought between 80 foot-tall human piloted robots that can like, fly and shit plus shoot lasers and missles. \n\nEach pilot and his robot are supported by a team of men and women consisting of various Hollywood ethnic stereotypes from 1990's (think Asians and Texans). And of course, being that the movie's from 1990, the protagonist is of course Russian, and indeed communist.\n\nSo anyway, the dude from Alien Nation has to fight this Ruskie for control of Alaska or something, the American flies his robot into orbit, gets shot down by the Commiebot, crashes, and then pulls some straight up Decepticon type shit. Guy then starts driving around in his robot tank, tries to punch Vodkabot in the nuts; fails, and then a Goddamn buzzsaw comes out of where it's robonuts should be.\n\nMotherfucker saws open the American robot, it's pilot,the guy from Alien Nation runs out with the giant Russiabot following him. After nearly getting trampled, he manages to fucking own the Ruskie by hot-wiring a discarded rocket-powered robot fist. After getting his shit royaly fucked up, Stalin bails out of his bot and they both proceed to FIGHT TO THE DEATH!!!.\n\nOr not. Turns out they're both pussies and instead of ending the battle with vicious hand-to-hand bloodshed; they talk it out, fistbump, and go suck each others dicks.\n\nOh yeah, and some chick shows her ass, but it doesn't really matter because she looks like a man anyway.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n16:9\nRegion 1\nSpoken English. English and French subs.\nSourced from a single layer DVD. Unaltered.\n\n\n\n\n\nThis is a disc image, I'll upload an .avi after the holiday weekend. Happy Thanksgiving!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCrash And Burn. And seed.\n","torrent":{"xt":"urn:btih:ea424928dcb907fe95d165bc1718322d38cf6da0","amp;dn":"DVDR+Robot+Jox.iso+Region+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea424928dcb907fe95d165bc1718322d38cf6da0","infoHashBuffer":{"type":"Buffer","data":[234,66,73,40,220,185,7,254,149,209,101,188,23,24,50,45,56,207,109,160]},"announce":[],"urlList":[]}}