{"title":"Oorlog van de eeuw dvd 8(Dutch)(TinkerBell) TBS","uid":6037163,"size":4683855202,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:eabf2a257d7469338fac9b50d73d3d2d9187a6d9&amp;dn=Oorlog+van+de+eeuw+dvd+8%28Dutch%29%28TinkerBell%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mad_Parrot","files":51,"time":1292272893,"description":"\n\nDe Oorlog van de Eeuw 8/10       \n \n \nDe Tweede Wereldoorlog woedde meer dan 60 jaar terug en eiste meer dan 50 miljoen mensenlevens, in veldslagen van NormandiÃƒÂ« tot de Kaukasus, bij de marine en in de luchtgevechten en bombardementen op steden. Dit was een oorlog die duidelijk aantoonde hoe diep de mensheid kan zinken.\nDe machtsstrijd tussen twee totalitaire ideologieÃƒÂ«n, de overwinning van democratie over dictatorschap, de triomf van technologie in oorlogsvoering en het misbruik ervan voor gemechaniseerde slachtpartijen bewees uiteindelijk, in Hiroshima, dat de mensheid nu in staat was om zichzelf uit te roeien... De Oorlog van de Eeuw.\n\nDe eindbeslissing\nIn maart 1945 kwam de strijd weer op Duitse bodem terecht. In het oosten stond het Rode Leger aan de Oder en in het westen hadden de Britten en de Amerikanen de Rijn bereikt. \nDe geallieerde troepen kregen uiteindelijk de overhand in een bittere en felle strijd en stad voor stad en dorp voor dorp viel in hun handen. Het einde van de Tweede wereldoorlog op Europese bodem was in zicht gekomen.\n\nDe slag om Oost-Pruisen\nTerwijl de geallieerden in 1944 hun opmars begonnen zijn, is Oost-Pruisen nog een oase van rust en vrede. \nMaar in oktober van dit jaar wordt deze meest oostelijke provincie van het Duitse rijk op ruwe wijze uit de droom geholpen. \nHoewel Hitler nog hardnekkig volhoudt dat Stalin bluft en dat het Rode leger uitgeschakeld is, trekken de op wraak beluste Russische troepen al over de oostelijke grens van het 'Duizendjarige rijk'. Omdat Hitler zijn troepen elders heeft ingezet, \nwordt de verdediging van Oost-Pruisen grotendeels overgelaten aan Hitlerjugend en bejaarde mannen die het bevel krijgen tot het bittere einde door te vechten. Ondertussen staan de burgers voor de keuze om te wachten op de Russen of het vluchtverbod te negeren en westwaarts te vluchten. \nZowel Russische als Duitse betrokkenen vertellen hun verhaal.\n \n \n \n\n\nNEDERLANDS GESPROKEN\n\nSpotinformatie\n \nCategorie    : Beeld \nFormaat      : DVD5 \nBron         : Retail\nOndertitels  : Nederlands (instelbaar)\nGenre        : Documentaire\n\n\n &lt;a href=&quot;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+5/10&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+5/10&lt;/a&gt; \n\n\n \n \n\n\n*****************************************\n\nBrought to you by TinkerBell TBS","torrent":{"xt":"urn:btih:eabf2a257d7469338fac9b50d73d3d2d9187a6d9","amp;dn":"Oorlog+van+de+eeuw+dvd+8%28Dutch%29%28TinkerBell%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eabf2a257d7469338fac9b50d73d3d2d9187a6d9","infoHashBuffer":{"type":"Buffer","data":[234,191,42,37,125,116,105,51,143,172,155,80,215,61,61,45,145,135,166,217]},"announce":[],"urlList":[]}}