{"title":"Mrs Pargeter's Point of Honour - Simon Brett   (Unabridged)","uid":6029195,"size":92676216,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ebfabfe6c9e6762148807ae70e8f306f19779c7a&amp;dn=Mrs+Pargeter%5C%27s+Point+of+Honour+-+Simon+Brett+++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lucy1948","files":14,"time":1292014162,"description":"Unabridged and read by Simon Brett. 6 hours 26 mins duration.(Fhg CBR 32 kbit/s 22050 Hz Mono)\n\n\n[The final Mrs Pargeter Book]\nArt theft in reverse is the subject of Brett's latest comic mystery starring Mrs. Melita Pargeter (Mrs. Pargeter's Plot, etc.), a charming Londoner whose genteel demeanor belies a keen intellect and steely determination. Elderly Veronica Chastaigne enlists Mrs. Pargeter to oversee the secret return of her late husband's collection of &quot;hot&quot; paintings to their rightful owners. To do so, Mrs. Pargeter assembles a team of her own late husband's old &quot;associates,&quot; including private detective Truffler Mason and interior designer Denzil Price. But when Mrs. Pargeter's team go to pick up the paintings, they discover that someone has already scooped up the stolen collection of Old Masters. A merry chase is on, as Mrs. Pargeter and company seek to reclaim the paintings even as they are dogged by the ineffectual Det. Insp. Craig Wilkinson and his ambitious assistant, Detective Sergeant Hughes. In the end, the police prove no match for the wily Mrs. Pargeter and her cadre of knights in tarnished armor.\n\nIn this final fast-paced tale, Brett offers yet another repast of merry mayhem with the redoubtable Mrs. Pargeter as the most excellent main course.","torrent":{"xt":"urn:btih:ebfabfe6c9e6762148807ae70e8f306f19779c7a","amp;dn":"Mrs+Pargeter%5C%27s+Point+of+Honour+-+Simon+Brett+++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebfabfe6c9e6762148807ae70e8f306f19779c7a","infoHashBuffer":{"type":"Buffer","data":[235,250,191,230,201,230,118,33,72,128,122,231,14,143,48,111,25,119,156,122]},"announce":[],"urlList":[]}}