{"title":"11 14 Destino Final .avi","uid":6211050,"size":685382656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ec55b3d2b83b1d65b1ec2519b0b9bbe7bd2225b2&amp;dn=11+14+Destino+Final+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1298987767,"description":"Genero: Thriller\nIdioma: EspaÃƒÂ±ol\nCalidad: DVD-Rip\n\nEs una noche tranquila en Middleton, un barrio de clase media. Pero a medida que la noche se aproxima a la fatÃƒÂ­dica hora de las 11:14 p.m., una serie de sucesos empezarÃƒÂ¡n a ocurrir, con letales consecuencias. En la autopista, Jack, un conductor borracho atropella a un joven con su coche... Un tiroteo en una tienda de conveniencia deja herida a la dependienta, Buzzy. Pero mÃƒÂ¡s tarde serÃƒÂ¡ arrestada por estar involucrada en el crimen... En el cementerio local, Frank, un padre muy protector, intenta hacerse pasar por culpable de un crimen que no cometiÃƒÂ³... En los alrededores, tres adolescentes aburridos conducen una camioneta de forma imprudente, haciendo tonterÃƒÂ­as y lanzando objetos contra otros vehÃƒÂ­culos. Pero antes de que acabe la noche, habrÃƒÂ¡n aprendido que el gamberrismo ciego tambiÃƒÂ©n puede tener consecuencias dolorosas, y hasta mortales... Mientras tanto, Cheri, experta manipuladora, intenta convencer a su novio para que cometa un asesinato... Antes de que acabe la noche, dos adolescentes estarÃƒÂ¡n muertos en Middleton, vÃƒÂ­ctimas de un destino que entrelaza todos los hechos descritos anteriormente, sin conexiÃƒÂ³n aparente. La historia se despliega en orden cronolÃƒÂ³gico inverso, conectando los sucesos a medida que la noche va transcurriendo para los habitantes de la ciudad. Estos flecos del destino convergerÃƒÂ¡n en la fatÃƒÂ­dica hora de las 11:14 pm.\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:ec55b3d2b83b1d65b1ec2519b0b9bbe7bd2225b2","amp;dn":"11+14+Destino+Final+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec55b3d2b83b1d65b1ec2519b0b9bbe7bd2225b2","infoHashBuffer":{"type":"Buffer","data":[236,85,179,210,184,59,29,101,177,236,37,25,176,185,187,231,189,34,37,178]},"announce":[],"urlList":[]}}