{"title":"The Kids Are All Right [2010] 400MB BRRip x264-RippeR","uid":6125452,"size":436493242,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ef79d7e78ba06b449f0c2d706eeac1e33ee15769&amp;dn=The+Kids+Are+All+Right+%5B2010%5D+400MB+BRRip+x264-RippeR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"etlover","files":4,"time":1295929019,"description":"Two children conceived by artificial insemination bring their birth father into their family life. \nNic and Jules are in a long term, committed, loving but by no means perfect relationship. Nic, a physician, needs to wield what she believes is control, whereas Jules, under that control, is less self-assured. During their relationship, Jules has floundered in her &quot;nine to five&quot; life, sometimes trying to start a business - always unsuccessfully - or being the stay at home mom. She is currently trying to start a landscape design business. They have two teen-aged children, Joni and Laser, Nic who is Joni's biological mother, and Jules who is Laser's biological mother. Although not exact replicas, each offspring does more closely resemble his/her biological mother in temperament. Joni and Laser are also half-siblings, having the same unknown sperm donor father. Shortly after Joni's eighteenth birthday and shortly before she plans to leave the house and head off to college, Laser, only fifteen and underage to do so, pleads with her to try and contact their sperm donor father. Somewhat reluctantly, she does. He is late thirty-something Paul, a co-op farmer and restaurateur. Despite his seemingly successful businesses, Paul has always shirked responsibility, most specifically in his personal life. After Joni and Laser meet with Paul, Nic and Jules learn what their children have done, and although they don't want Paul infiltrating their lives, they want to meet him especially as Joni and Laser seem to want to maintain some sort of relationship with him. As Paul's relationship with the entire family grows, which also includes him hiring Jules to design and construct his back yard, they have an effect on what he wants in life, and he in turn affects the family dynamic as well as each person's relationships outside of the family.\n\nNOTES : RippeR brings to you another high quality release in small size. English Subtitles added. Check sample before downloading :)\n &lt;a href=&quot;\nhttp://minimages.com/images/57377168317163764851.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://minimages.com/images/57377168317163764851.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://minimages.com/images/88507431902405671898.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://minimages.com/images/88507431902405671898.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://minimages.com/images/18477699473503853860.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://minimages.com/images/18477699473503853860.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ef79d7e78ba06b449f0c2d706eeac1e33ee15769","amp;dn":"The+Kids+Are+All+Right+%5B2010%5D+400MB+BRRip+x264-RippeR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef79d7e78ba06b449f0c2d706eeac1e33ee15769","infoHashBuffer":{"type":"Buffer","data":[239,121,215,231,139,160,107,68,159,12,45,112,110,234,193,227,62,225,87,105]},"announce":[],"urlList":[]}}