{"title":"Un Juego de Inteligencia[DVDRip][Castellano]","uid":6078139,"size":1616924672,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f073b9c25d3291e2a6258d411e748ccec26482ce&amp;dn=Un+Juego+de+Inteligencia%5BDVDRip%5D%5BCastellano%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1293980711,"description":"Calidad de video: DVD RIP\nPeso: 1510 mb\nIdioma del audio: EspaÃƒÂ±ol \n\nEl productor de televisiÃƒÂ³n Rainer es un hombre de ÃƒÂ©xito que lo tiene todo: un sueldo estupendo, un lujoso ÃƒÂ¡tico, un coche espectacular y una novia mÃƒÂ¡s espectacular todavÃƒÂ­a. A sus treinta y tantos aÃƒÂ±os ha llegado a la cima de su profesiÃƒÂ³n creando unos programas de televisiÃƒÂ³n de lo mÃƒÂ¡s vulgar y estÃƒÂºpido. Su ÃƒÂºltimo triunfo ha sido un concurso en el que un hombre podÃƒÂ­a conseguir el premio de ser padre de un niÃƒÂ±o, si su espermatozoide ganaba una carrera microscÃƒÂ³pica para fecundar un ÃƒÂ³vulo.\n\nUn dÃƒÂ­a, Pegah, una misteriosa mujer, embiste a toda velocidad el coche de Rainer. Tras sufrir una experiencia cercana a la muerte, en Rainer se opera un gran cambio y decide producir un sesudo magazÃƒÂ­n de actualidad para la franja horaria estelar de su emisora. Hundido por los bajos ÃƒÂ­ndices de audiencia obtenidos, deja su trabajo y decide investigar el sistema de mediciÃƒÂ³n de audiencia que mantiene en los mÃƒÂ¡s altos puestos a programas que son un insulto para la inteligencia.\n\nDeterminado a luchar contra el embrutecimiento de la sociedad que provoca la televisiÃƒÂ³n, Rainer y unos nuevos amigos traman un ingenioso y complicado plan para que el pÃƒÂºblico se interese por programas culturales de calidad. \n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:f073b9c25d3291e2a6258d411e748ccec26482ce","amp;dn":"Un+Juego+de+Inteligencia%5BDVDRip%5D%5BCastellano%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f073b9c25d3291e2a6258d411e748ccec26482ce","infoHashBuffer":{"type":"Buffer","data":[240,115,185,194,93,50,145,226,166,37,141,65,30,116,140,206,194,100,130,206]},"announce":[],"urlList":[]}}