{"title":"La.Amenaza.de.Andromeda.1X02.(Final).HDTV.Xvid.Spanish.By.Ainhoa","uid":6031836,"size":745333894,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f136a101b61db461de3cda90b4f66851d9dd3760&amp;dn=La.Amenaza.de.Andromeda.1X02.%28Final%29.HDTV.Xvid.Spanish.By.Ainhoa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ainhdesi","files":3,"time":1292105948,"description":"Un satÃƒÂ©lite espacial, lanzado desde la base aÃƒÂ©rea de Vandenberg, ha caÃƒÂ­do en un remoto pueblo del desierto de Nuevo MÃƒÂ©xico. Dos tÃƒÂ©cnicos con la misiÃƒÂ³n de recuperarlo entran en la pueblo y descubren que la mayor parte de los habitantes estÃƒÂ¡n muertos. Inmediatamente se ponen en contacto con su base y piden instrucciones. Desde ella, aunque conscientes del peligro que les amenaza, les ordenan que localicen el satÃƒÂ©lite y lo recojan. Al poco tiempo hay un silencio absoluto. El control de la misiÃƒÂ³n ordena un reconocimiento aÃƒÂ©reo. Se declara el estado de emergencia y se da la alerta Wildfire, nombre en clave previsto para una contingencia similar. El equipo denominado con este nombre se reÃƒÂºne. Tres cientÃƒÂ­ficos, vestidos con escafandras aislantes del exterior, llegan en helicÃƒÂ³ptero al lugar, encontrando cadÃƒÂ¡veres por todas partes. Las vÃƒÂ­ctimas, incluyendo a los tÃƒÂ©cnicos que habÃƒÂ­an llegado previamente, aparentemente murieron de forma instantÃƒÂ¡nea. No ven sangre, y al examinar los cadÃƒÂ¡veres, descubren que la sangre de los cuerpos se ha convertido en polvo. El satÃƒÂ©lite, parcialmente quemado y agrietado debido al calor provocado por el roce al entrar en la atmÃƒÂ³sfera terrestre, es encontrado en la oficina del mÃƒÂ©dico del pueblo. Su apertura ha sido forzada. Colocan la cÃƒÂ¡psula en un plÃƒÂ¡stico protector e inician el regreso, pero de repente se encuentran con dos supervivientes, un bebÃƒÂ© llorando en su cuna y un viejo, con ojos salvajes, cubierto de sangre y polvo. Ã‚Â¿Por quÃƒÂ© ellos se han salvado? Los investigadores deberÃƒÂ¡n esclarecer las causas de esta catÃƒÂ¡strofe.","torrent":{"xt":"urn:btih:f136a101b61db461de3cda90b4f66851d9dd3760","amp;dn":"La.Amenaza.de.Andromeda.1X02.%28Final%29.HDTV.Xvid.Spanish.By.Ainhoa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f136a101b61db461de3cda90b4f66851d9dd3760","infoHashBuffer":{"type":"Buffer","data":[241,54,161,1,182,29,180,97,222,60,218,144,180,246,104,81,217,221,55,96]},"announce":[],"urlList":[]}}