{"title":"La Vie Heureuse de Leopold Z [DVD]","uid":6032521,"size":1536835844,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f2022f977bbc726c13ab9a50e2b5ea2850141da1&amp;dn=La+Vie+Heureuse+de+Leopold+Z+%5BDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bobby_metzabota","files":1,"time":1292125846,"description":"Film en francais seulement.\n\nLa vie heureuse de Leopold Z is a 1965 comedy-drama by Gilles Carle that played a key role in efforts to create a popular national cinema in Quebec.\n\nThe film follows the misadventures of its title character, a snow plow operator for the City of Montreal, on Christmas Eve. La vie heureuse de Leopold Z incorporates documentary film footage of snow clearing in Montreal, and in fact, had been originally commissioned by the National Film Board of Canada as documentary on snow clearing, only to be turned into a fictional film by the director.The film paints a portrait of a hapless Quebecois little man, battling the winter elements as well as the demands of consumerism, sexual desire and the requirement at that time for French-speaking Quebecers to speak English to be successful.\n\nAs with other Quebec NFB films of the period, La vie heureuse de Leopold Z incorporates Direct Cinema techniques. It is also a film with a strong political point of view, with Carle intending his central character to be a &quot;pre-revolutionary&quot; figure, representing how the Quebecois people were being exploited by a capitalist, English-speaking power structure.\n\nFilm en francais seulement.","torrent":{"xt":"urn:btih:f2022f977bbc726c13ab9a50e2b5ea2850141da1","amp;dn":"La+Vie+Heureuse+de+Leopold+Z+%5BDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2022f977bbc726c13ab9a50e2b5ea2850141da1","infoHashBuffer":{"type":"Buffer","data":[242,2,47,151,123,188,114,108,19,171,154,80,226,181,234,40,80,20,29,161]},"announce":[],"urlList":[]}}