{"title":"Coast to Coast AM - 11 - 03 - 10 - Elections &amp; Economy","uid":5963646,"size":55199489,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f25a888aef45f1d0340736229568669ab422e11b&amp;dn=Coast+to+Coast+AM+-+11+-+03+-+10+-+Elections+%26+Economy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":4,"time":1290036770,"description":"Elections &amp; Economy\n\nDate: 11-03-10\nHost: George Noory\nGuests: Ken Hudnall, Jeffrey L. Peckman, Alex Jones\n\nIn the latter half of the show, radio host Alex Jones offered analysis and commentary on the mid-term elections, and the economy. While the Republican victories stemmed from a backlash of the public wanting change, what's different in this election cycle is that the Tea Party &quot;has a truly organic core to it,&quot; built up with grassroots participation, while Obama was a &quot;manufactured event&quot; backed by the monied elite, he remarked.\n\n&quot;For the first time in modern history,&quot; said Jones, &quot;the Tea Party is talking about real issues-- abolish the Federal Reserve, secure the dollar, cut the debt, put spending caps in,&quot; --all issues that liberals and conservatives have tried to block. The recent decision of the Federal Reserve to pump billions into the US financial system is part of a plan to devaluate the dollar, he continued. &quot;They are posing as our saviors when they are the author of these [financial] crises,&quot; he warned, and within two years America could see 35-40% unemployment, with the country reduced to an &quot;Argentine-type depression.&quot;\n\nLife &amp; Death of Bill Cooper\nIn the second hour, author and Internet radio host, Ken Hudnall discussed the life and controversial death of his friend, Bill Cooper. While initially known for his UFO revelations (he claimed a number of people in the ufology field were disinformation agents), Cooper gained notoriety for his belief that a very old secret society called the Brotherhood of the Snake was working to establish a one-world government. Wanted for tax evasion, he was shot to death in 2001 by an Arizona Sheriff's officer, after brandishing a handgun, Hudnall recounted.\n\nET Initiative\nFirst hour guest, Jeff Peckman talked about his initiative (rejected by Denver voters) to create an ET commission which would gather UFO evidence that would be placed on a city government website. The measure was hurt by a Democratic campaign for people to vote no on all numbered initiatives, he suggested. But even though the initiative failed, Peckman believes it has helped build a foundation for the disclosure process. For more, see the article below.","torrent":{"xt":"urn:btih:f25a888aef45f1d0340736229568669ab422e11b","amp;dn":"Coast+to+Coast+AM+-+11+-+03+-+10+-+Elections+%26+Economy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f25a888aef45f1d0340736229568669ab422e11b","infoHashBuffer":{"type":"Buffer","data":[242,90,136,138,239,69,241,208,52,7,54,34,149,104,102,154,180,34,225,27]},"announce":[],"urlList":[]}}