{"title":"Xenus 2: White Gold [ENG][Game Factory Interative] 2010 TRiViUM","uid":6064838,"size":3133904724,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f32370ce888188320d8da415e312840230fbc324&amp;dn=Xenus+2%3A+White+Gold+%5BENG%5D%5BGame+Factory+Interative%5D+2010+TRiViUM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ex_Exist","files":-1,"time":1293304921,"description":"Xenus 2: White Gold [ENG][Game Factory Interative] 2010 TRiViUM\n\n\n                    T e a M  T R i V i U M   P r e s e n t S                 \n                                                                           \n                                                                            \n                  Xenus 2: White Gold (c) Game Factory Interative            \n                                                                            \n                                                                          \n                  RELEASE DATE ........................ : 12/2010         \n                  RELEASE SiZE .......................... : 1 rar         \n                  PROTECTiON ... : Securom(?) + StarForce 5.60(?)         \n                                                                          \n                                                                             \n                                   RELEASE NOTES                              \n                                                                              \n                                                                          \n            ** Special note for GFI:                                      \n            1. It was a bad idea to take *our crack* and wrap it with     \n               SecuROM. Of course the game will NOT work after that.      \n               Next time test it before sale *facepalm*                   \n                                                                          \n            2. Your retail setup is not even patched, while you should    \n               have updated files from the developer. Fail.               \n                                                                          \n            3. We provide our old unprotected main executable as a crack  \n               for 1.0 and the patch 1.0.1 with our keygen as a bonus :)  \n                                                                          \n                                                                          \n                                                                          \n            Year 2010, a small Caribbean country. The main part of the    \n            island is aflame with revolt. The Government Army tries to    \n            quash an uprising, powerful drug cartels are trying to        \n            decimate the Indians, and the whole population is being       \n            indiscriminately slaughtered by criminal gangs. This boiling  \n            pot, however typical for Latin America, is rapidly nearing an \n            explosion. The main hero of the game is entrusted with a task \n            to uncover some dark secrets, to investigate a few            \n            disappearances, and to stay alive above all.                  \n                                                                          \n            Xenus 2: White Gold explores the shadowy background of modern \n            low intensity conflicts, where the newest weapons often do    \n            battle with the antics of witchdoctors. There are plenty of   \n            military toys in the game - tanks and helicopters, armored    \n            cars and gunboats - but your main armament will be your wits  \n            and cunning. A high quality dynamic FPS with a handful of RPG \n            elements thrown in for a good measure, White Gold offers a    \n            rich scenario in addition to the non-stop action. The FPS     \n            engine capable of working seamlessly with hundreds of square  \n            miles of open terrain, an extensive physics system, clever AI  \n            and free gameplay are combined with a character development   \n            system, realistic in-game economy, hundreds of quests and     \n            hundreds of NPCs.                                             \n                                                                          \n            With a lush exotic setting of a tropic paradise engulfed in   \n            the fires of war, White Gold offers to the FPS players a      \n            depth and immersion.                                          \n                                                                          \n            Xenus 2: White Gold is full of features every avid FPS fan    \n            will enjoy. The main hero can fight hand to hand combat,      \n            wield different weapons, and take control of a variety of     \n            vehicles. Drive jeeps, crush the opposing forces with tanks,  \n            blast them  from helicopters and naval ships - everything is  \n            possible in the absolutely open world. But it is living,      \n            immersive environment at the same time - inhabited by         \n            different factions vying for wealth  and power. During the    \n            game you'll stumble upon such dark omens  that even the       \n            full-scale fighting between the regular army and the mafia    \n            mercenaries will look like a quarrel among playing kids.       \n                                                                          \n                                                                          \n            Features:                                                     \n                                                                          \n            - An unique mix of RPG and an action shooter in a modern      \n              setting                                                     \n            - Total freeplay: visit all the island resorts of Caribbean   \n              turned into no-one's ground                                 \n            - Hundreds of destructible buildings and objects to blast     \n              into oblivion                                               \n            - More than 25 different military gadgets, including trucks,  \n              tanks, choppers and gunboats                                \n            - Gripping non-linear storyline                               \n            - More than 30 types of weapons                               \n            - 8 independent parties with complex relations between each   \n              other and the main hero                                     \n            - An original RPG system                                      \n            - Real-time weather effects, day/night and atmosphere changes \n            - Dynamic alternation of day and night and weather effects    \n            - Interaction with hundreds of unusual NPCs                   \n                                                                          \n                                                                             \n                                   iNSTALL NOTES                              \n                                                                              \n                                                                            \n                    - Unpack                                               \n                    - Install the game                                    \n                    - Copy the content from a chosen folder at the        \n                      TRiViUM dir to have cracked 1.0 or patched 1.0.1    \n                    - For 1.0.1 use our keygen to activate the game:      \n                      * Click 'Get Num' to generate a serial number,      \n                        copy/paste it to activation dialog.               \n                      * Choose 'I already have an Activation Key' and     \n                        copy/paste your Hardware code back to keygen.     \n                      * Press 'Get Key' to generate Activation Key,       \n                        copy/paste it to activation dialog, press Next.   \n                    - Enjoy ;)                                            \n                                                                          \n                                                                             \n                                    GROUP NOTES                               \n                                                                              \n                                                                            \n                              GFI guys, no more please                     \n                                                                           \n                                                                            \n-------------------------------------------------------------------\n\n\nall the useful information in the file trivium.nfo and\n\n &lt;a href=&quot;\nhttp://peerat.ru:8080/forum/viewtopic.php?t=3846&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://peerat.ru:8080/forum/viewtopic.php?t=3846&lt;/a&gt;\n\n\n-------------------------------------------------------------------\n\n\n","torrent":{"xt":"urn:btih:f32370ce888188320d8da415e312840230fbc324","amp;dn":"Xenus+2%3A+White+Gold+%5BENG%5D%5BGame+Factory+Interative%5D+2010+TRiViUM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f32370ce888188320d8da415e312840230fbc324","infoHashBuffer":{"type":"Buffer","data":[243,35,112,206,136,129,136,50,13,141,164,21,227,18,132,2,48,251,195,36]},"announce":[],"urlList":[]}}