{"title":"3Oh!3 - Double Vision (2nafish)","uid":5971919,"size":114071556,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f3df63b2b768ad777f6fb52226eab5a7077c5d83&amp;dn=3Oh%213+-+Double+Vision+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1290323203,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Double Vision&quot; is a song by 3OH!3 from their album Streets of Gold. The song, which was released as the third promo single as part of the &quot;Countdown to Streets of Gold&quot;, also doubles as the album's official second single. The song has been added to Radio 1's B Playlist in the United Kingdom. The official remix features rapper Wiz Khalifa.\n\nThe music video was directed by Evan Bernard. This song, was used as soundtrack of The Sims 3: Late Night expansion pack. The video was released at noon GMT in UK and was available worldwide at noon EST on 20 August.\n\n&quot;Double Vision&quot; debuted and peaked at #89 on the Billboard Hot 100 as a promotional single. It has re-entered the chart at #87 as an official single. Despite receiving placement on BBC Radio 1's B Playlist, &quot;Double Vision&quot; only managed to reach number 133 on the UK Singles Chart upon release.\n\nStreets of Gold is the third studio album by Colorado electronic duo 3OH!3. This is their second album to be produced by Matt Squire and released on the record label Photo Finish. It was released on June 29, 2010 in the United States and July 19, 2010 in the United Kingdom. The album debuted at number seven on the US Billboard 200, selling 41,000 copies in its first week. Upon its release, Streets of Gold received generally mixed reviews from most music critics.\n\n3OH!3 released a video for the song &quot;House Party&quot; on April 8 as a teaser for Streets of Gold. The group hired Andrew W.K. to do a rock remix of &quot;House Party&quot;, which was released virally on Friday April 16, 2010. 3OH!3 had met Andrew W.K. at a house party in Memphis, Tennessee. First single, &quot;My First Kiss&quot; was released on their website at 3:03 PM EST May 3. and digitally at midnight on May 4. On May 18, 2010, the song &quot;Touchin' on My&quot; was released exclusively on iTunes Store. 3OH!3 plans to release a new song every other Tuesday up to the release of the album. &quot;DÃƒÂ©jÃƒÂ  Vu&quot; was released on June 1, and &quot;Double Vision&quot; was released on June 15. On June 8, the song &quot;I Can Do Anything&quot; was released to members only on the 3OH!3 website.\n\n3OH!3 (pronounced &quot;three oh three&quot;) is an electropop duo from Boulder, Colorado, made up of Sean Foreman and Nathaniel Motte. The band is best known for their song &quot;Don't Trust Me&quot; from their album Want, which reached number seven on the Billboard Hot 100. Their second single, a remix of &quot;Starstrukk&quot; with Katy Perry from Want, was a top ten hit in the United Kingdom, Ireland, Finland and Australia. They gained more recognition from their collaboration with Ke$ha, on the track &quot;My First Kiss&quot;, from their album Streets of Gold, which peaked at number nine on the Billboard Hot 100.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f3df63b2b768ad777f6fb52226eab5a7077c5d83","amp;dn":"3Oh%213+-+Double+Vision+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3df63b2b768ad777f6fb52226eab5a7077c5d83","infoHashBuffer":{"type":"Buffer","data":[243,223,99,178,183,104,173,119,127,111,181,34,38,234,181,167,7,124,93,131]},"announce":[],"urlList":[]}}