{"title":"Star Wars: Batlefront (Retail ISO)","uid":6103109,"size":2084088637,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f488a261c5cd2c8da81088862df3eaa1f25b5c96&amp;dn=Star+Wars%3A+Batlefront+%28Retail+ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SanctusSecurity","files":6,"time":1295051400,"description":"Sanctus Security Is Proud To Produce Another Wonderful Torrrent\n\n\n\nProduct: Star Wars: Battlefront\nPlatform: PC\nDeveloper: Pandemic Studios\nPublisher: LucasArts Entertainment\n\n\n\nGame Description: I also like multiplayer gaming, so when they announced Star Wars Battlefront for the PC, I was more than a little excited. The idea of playing as Storm Troopers and Rebels was getting me all tingly inside. Since the game spanned every movie yet released, it also would give me the chance to put blaster bolts into some Gungans as well, and if that isn't enough to at least get you interested in this title then I don't think we can be friends anymore.\n\nOf course, if you follow my reviews you'll also know that this was a bittersweet play just because it's yet another multiplayer frag fest with vehicles. Battlefield really has a lot to answer for, and the main pre-release criticism of this game was that it could have been nothing more than a total conversion of Battlefield with Star Wars skins and vehicles. There was a certain amount of nervousness on the part of the video gaming public when viewing this project. So much could go wrong, and yet so much could go right. If the force was not with Pandemic Studios and LucasArts, this title wouldn't be worth the money.\n\nLet's get one other thing out of the way first, there are no playable Jedi characters, so there will be no way for you to wield a light saber in this game. That would have bothered me more if I hadn't spent the last month in heavy meditation before building my own. \n\n\n\n\nMinimum System Requirements:\n\n\nProcessor:            Intel P-III 1.0GHz, Athlon 1GHz\nRAM:                  256MB    \nCD-ROM:               8x Or Higher\nVideo Card:           64MB with hardware transform and lighting capability\nAudio:                100% DirectX 9.0c compatible\nHard Drive Space:     2.9GB\n\n\n\n\n\n\nThis disc comes in ISO format (disc image), so you will need to burn it to a blank disc, or you can mount it via MagicDisc or Dameon Tools. Product Key is located inside the torrent, along with the NO-CD crack, so you can play without the disc in the tray.\n\n\n\nPlease seed and enjoy!\n\n\n\nSoon, we will be setting up a LAN network with two separate ISP's, so we can always be seeding. At times, our seeds may be off...but not for long.\n\n\n\nSanctus Security (1/14/2011)\n\nTorrent Compiled By: CyberFerret32 ","torrent":{"xt":"urn:btih:f488a261c5cd2c8da81088862df3eaa1f25b5c96","amp;dn":"Star+Wars%3A+Batlefront+%28Retail+ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f488a261c5cd2c8da81088862df3eaa1f25b5c96","infoHashBuffer":{"type":"Buffer","data":[244,136,162,97,197,205,44,141,168,16,136,134,45,243,234,161,242,91,92,150]},"announce":[],"urlList":[]}}