{"title":"ActivitiVM Activiti 5.0 Demo","uid":6076850,"size":1257103731,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:f59aebe866cddb64fafd3b51b171aeeb77d3e05d&amp;dn=ActivitiVM+Activiti+5.0+Demo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JackieMoon2011","files":1,"time":1293908096,"description":"About Activiti 5.0\n\n\n\nThe first version of the Business Process Modeling Notation (BPMN 1.0) is from 2004 and helped the Business Process Managers and Business Process Analysts to model their business processes. Programmers and developers used WS-BPEL 2.0. BPMN 2.0 defines one language for modeling business processes and making them executable on a process engine without the need of conversion.\n\n\n\nTom Baeyens and Joram Barrez, the former leaders of jBPM now working for Alfresco, started the Activiti project to create this superb BPMN 2.0 process engine. Half a year later Activiti 5.0 was released. Activiti is lightweight and has a very clean and open API.\n\n\n\nBig thanks for all the hard work!\n\n\n\n\n\n\n\nAbout the ActivitVM\n\nThis is an Ubuntu 10.04 LTS installation running Activiti 5.0. You'll need at least VMware Player to run this Virtual Machine (to download the VMware Player visit http://www.vmware.com/). Most Ubuntu applications have been cut out of this VM to reduce space, you can re-install them if you want to.\n\n\n\nVirtual Machine name : activiti-demo-desktop\n\n\n\nActiviti User\n\nUser : activiti\n\nPassword : welcome\n\n\n\n\n\nRunning Activiti 5.0 in the ActivitVM\n\nStart the ActivitVM by double clicking the ActivitiVM.vmx file and wait for Ubuntu to start.\n\nLog on with the activiti user credentials (password = welcome) and open the browser in your Virtual Machine, check the bookmarks and enjoy the Activiti Demo!!!\n\n\n\n\n\n\n\nCredits\n\nThis Virtual Machine is a tribute to all the developers of the Activiti BPM suite!\n\n\n\nSpecial thanks to Winko Erades for writing the &quot;How to install Activiti on Ubuntu&quot; user guide as described in the Activiti User Forum.","torrent":{"xt":"urn:btih:f59aebe866cddb64fafd3b51b171aeeb77d3e05d","amp;dn":"ActivitiVM+Activiti+5.0+Demo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f59aebe866cddb64fafd3b51b171aeeb77d3e05d","infoHashBuffer":{"type":"Buffer","data":[245,154,235,232,102,205,219,100,250,253,59,81,177,113,174,235,119,211,224,93]},"announce":[],"urlList":[]}}