{"title":"FTV Girls - Penny &amp; Jenaveve - Sexual Friends","uid":6100667,"size":207128381,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f6c14e65fb0cd50ceeae1e00ec89e7169049ca77&amp;dn=FTV+Girls+-+Penny+%26+Jenaveve+-+Sexual+Friends&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"phatwarez","files":-1,"time":1294953023,"description":"FTV Girls - Penny &amp; Jenaveve - Sexual Friends\n\t\t\t\nPenny:  What to do when you have another hour or two left before you need to fly out back to LA?  Have some more fun &amp; sex of course!  Jenaveve is staying for a little longer to do some non-nude modeling here but I need to go back and be home for Monday.   The video guy said we can act out any way we like to and its like 4 in the morning so we're being all dopey.  Must be the coffee and the sex harmones all mixed together.  I so wanted to be in a guy's place with her and stick my dick in her tight wet little pussy and see how it feels.  Yeah, if I was a guy I would definitely pick her as one of my fuck friends.   So I acted like I was cumming on her like a guy, since I'm supposed to cream her breasts anyways.  Its the perfect excuse for me to play with her breasts as long as I wanted to.  I'm probably not going to see them again boo hoo.  She's so opened up to me too in these two nights, I wished we could've been together for another few days just as sex queens.  All I could think of was fucking her again, seeing her cum and tasting it.  That's what happens when you see a girl like this naked rubbing her breasts against mine!   When she creamed my butt it was the perfect excuse for me to rub my ass against hers.  She's all up for it!  Yeah, all I was thinking of was I wanna go down on her.\nJenaveve:  I was checking myself out in the mirror, and Penny slaps me on my butt and starts squirting cream on my breasts.  She definitely wasn't cheap on the cream, she was unloading the whole bottle on me!  I thought I'd be half-awake this early in the morning but that's not the case with her.   She has her way of 'stirring you up'.  At this hour we were a bunch of girlies who had lost all our inhibitions.  I felt like a ten year old girl at a slumber party with my best friend.  We jumped around rubbing our breasts together and then I thought up of massaging cream on her butt.  She has a very nice butt and the kind you want to grab and squeeze. \n\nScreens (also in torrent):\n &lt;a href=&quot;\nhttp://kopimg.com/images/kopi_351_Penny_Jenaveve_Sexual_Fr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kopimg.com/images/kopi_351_Penny_Jenaveve_Sexual_Fr.jpg&lt;/a&gt;\n\nFile Size ------- 197mb\nLength ---------- 26:05\nResolution ------ 640x480\nContainer ------- mkv\nVideo Codec ----- x264\nAudio Codec ----- mp3\nFrame Rate ------ 30\n\np h a t w a r e z . t k\nMade possible by your donations.","torrent":{"xt":"urn:btih:f6c14e65fb0cd50ceeae1e00ec89e7169049ca77","amp;dn":"FTV+Girls+-+Penny+%26+Jenaveve+-+Sexual+Friends","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6c14e65fb0cd50ceeae1e00ec89e7169049ca77","infoHashBuffer":{"type":"Buffer","data":[246,193,78,101,251,12,213,12,238,174,30,0,236,137,231,22,144,73,202,119]},"announce":[],"urlList":[]}}