{"title":"Billy Joel - You're Only Human (2nafish)","uid":5967420,"size":179478532,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f7fa817c33782d1f423a06ebf36198c2517e3808&amp;dn=Billy+Joel+-+You%5C%27re+Only+Human+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1290159143,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;You're Only Human (Second Wind)&quot; is a song written in 1985 and performed by Billy Joel for the express purpose of teenage suicide prevention.\n\nJoel, who had once attempted suicide himself, was asked if he could write a song about suicide in the hopes of promoting its prevention in teenagers. He agreed, but was concerned about his original draft which took a downbeat tone he thought would in fact encourage kids to end it all. In response, Joel created a new song with a bouncy joyous beat and lyrics that stress personal forgiveness and optimism about life.\n\nJoel donated all the royalties from the song to the National Committee for Youth Suicide Prevention.\n\nThe song appeared in Billy Joel's Greatest Hits in 1985 and became a top ten hit, peaking at #9 on the Billboard chart. It was digitally recorded.\n\nDuring the song, Joel audibly laughs after briefly hesitating during one of the verses. He decided to keep the mistake in the recorded version as it seemed to illustrate his point in the song about personal fallibility.\n\nAt the beginning of the video, Joel plays &quot;Piano Man&quot; on his harmonica. The entire video pays homage to It's a Wonderful Life, as the angelic Joel shows the young man - who's about to jump off a bridge because of a break-up with his girlfriend - what life will be like without him, as his family and friends mourn his death - as well as showing him the joys in his future he'll be missing if he dies (e.g. high school graduation, marriage). The video ends with the man choosing to live, and reconciling with his girlfriend. The drowning teen in the music video is Adam Savage, who would later gain fame as a special effects artist and the co-host of the popular science television show MythBusters.. The video was shot on Staten Island and features landmarks such as the OuterBridge Crossing and Monsignor Farrell High School.\n\nThe single version is slightly shorter than the album version, removing the sax solo between the bridge and the third verse.\n\nBilly Joel's Greatest Hits is a collection released in two sets, 12 years apart. The first set, consisting of two discs, titled Volume I and Volume II, was released in 1985. The second, single disc titled Volume III was released in 1997. All songs but the last three on Volume III, &quot;To Make You Feel My Love&quot;, &quot;Hey Girl&quot; and &quot;Light As The Breeze&quot; were written by Joel. &quot;You're Only Human (Second Wind)&quot; and &quot;The Night is Still Young&quot; are only available on the first set. The other songs appear mostly in order of their release dates and generally represent Joel's most successful singles.\n\nGreatest Hits - Volume I &amp; Volume II has been certified double diamond by the RIAA, selling over 10.5 million copies (21 million units) and is tied with Garth Brooks' &quot;Double Live&quot; for sixth best selling album of all time in the U.S. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f7fa817c33782d1f423a06ebf36198c2517e3808","amp;dn":"Billy+Joel+-+You%5C%27re+Only+Human+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7fa817c33782d1f423a06ebf36198c2517e3808","infoHashBuffer":{"type":"Buffer","data":[247,250,129,124,51,120,45,31,66,58,6,235,243,97,152,194,81,126,56,8]},"announce":[],"urlList":[]}}