{"title":"Glee - S01E01 - Directors Cut (Pilot) [Np]","uid":5938670,"size":531439838,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f8e406c05a3fc0fef5f3a1239beaf1c79daccc3a&amp;dn=Glee+-+S01E01+-+Directors+Cut+%28Pilot%29+%5BNp%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoahPuckerman","files":1,"time":1289055732,"description":"Name: Glee\nSeason: 1\nEpisode: 1\nEpisode Name: Director's Cut [Pilot]\nOriginal Air Date on TV: May 19, 2009\n\n\nEpisode Plot\n(Via: Wikipedia)\n\nSpanish teacher Will Schuester (Matthew Morrison) learns that Sandy Ryerson (Stephen Tobolowsky), the head of William McKinley High School\\'s glee club has been fired for inappropriate behavior towards male student Hank Saunders (Ben Bledsoe). The school principal (Iqbal Theba) gives Will permission to take over the club, and he plans to revitalize it, naming the group New Directions. The club consists of fame-hungry Rachel Berry (Lea Michele), diva Mercedes Jones (Amber Riley), flamboyant soprano Kurt Hummel (Chris Colfer), paraplegic electric guitar player Artie Abrams (Kevin McHale) and stuttering Goth Tina Cohen-Chang (Jenna Ushkowitz). Will\\'s efforts are derided by Sue Sylvester (Jane Lynch), head of the school\\'s successful cheerleading team, the Cheerios. His wife Terri (Jessalyn Gilsig) is also unsupportive, suggesting that Will become an accountant to increase their income. Rachel threatens to leave the club if Will cannot find a male vocalist with talent comparable to hers. When the school\\'s football coach Ken Tanaka (Patrick Gallagher) allows Will to try to recruit football team members, he discovers that quarterback Finn Hudson (Cory Monteith) is secretly a talented singer. He plants marijuana in Finn\\'s locker, and blackmails him into joining New Directions. Finn, determined not to disappoint his widowed mother, complies.\n\nWill takes New Directions to see Vocal Adrenaline, a rival club, perform. He is accompanied by Emma Pillsbury (Jayma Mays), the school\\'s mysophobic guidance counselor, who has a crush on him. Vocal Adrenaline perform an impressive rendition of Amy Winehouse\\'s \\&quot;Rehab\\&quot;, which leaves New Directions worried about their chances of competing in the regional show choir competition. When Will returns from the performance, Terri informs him she is pregnant. Believing he needs to support his family, Will regretfully tells the club he is resigning, and applies for a job as an accountant. Finn is attacked by the football team for his involvement with New Directions, and initially decides to quit the club. The team traps Artie in a portable toilet which they intend to tip over, however, Finn refuses to take part. He apologizes to the glee club members, and the group resolves to continue without Will. Emma urges Will to re-consider his decision to leave, and when he comes across New Directions performing \\&quot;Don\\'t Stop Believin\\'\\&quot; he decides to stay, telling the club he couldn\\'t bear to see them win Nationals without him.\n\nI Will Be Uploading All Glee Episodes As Single File's Then All Together (:\nI Will Also Be Uploading All Albums To Each Season (:\n\nEnjoy (: &amp; Please Seed \n\nThanks\n\n- [Np]","torrent":{"xt":"urn:btih:f8e406c05a3fc0fef5f3a1239beaf1c79daccc3a","amp;dn":"Glee+-+S01E01+-+Directors+Cut+%28Pilot%29+%5BNp%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8e406c05a3fc0fef5f3a1239beaf1c79daccc3a","infoHashBuffer":{"type":"Buffer","data":[248,228,6,192,90,63,192,254,245,243,161,35,155,234,241,199,157,172,204,58]},"announce":[],"urlList":[]}}