{"title":"Coast to Coast AM 11 - 13 - 10 thru 11 - 18 - 10","uid":5969640,"size":337744578,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f94755c70f72ffd702f6740e26a2536b482904c4&amp;dn=Coast+to+Coast+AM+11+-+13+-+10+thru+11+-+18+-+10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xAlkaline13x","files":30,"time":1290238569,"description":"Hostage Negotiations\n\nDate: 11-13-10\nHost: Ian Punnett\nGuests: Gary Noesner\n\nGary Noesner, retired FBI hostage negotiator for 23 years, was the first person to run the Bureau's Crisis Negotiation Unit. He joined Ian Punnett to talk about his career working in tense stand-off situations with criminals and terrorists.\n\n\n\nForeclosuregate\n\nDate: 11-14-10\nHost: Ian Punnett\nGuests: Greg Hunter\n\nIan Punnett welcomed investigative reporter Greg Hunter, who detailed how foreclosure mills are creating massive amounts of counterfeit promissory notes, so banks could legally foreclose on homeowners. &quot;When you start drilling down on this, you're going to find all kinds of malfeasance,&quot; he declared. However, Hunter lamented, unlike the Savings and Loan crisis of the 1980's which saw about 1,000 people sent to jail, the current financial debacle has yet to yield any indictments, despite being forty times bigger. &quot;Not a single person has been charged criminally,&quot; he marveled, &quot;with what I think is the biggest fraud in all of history.&quot;\n\nHunter explained that promissory notes are a critical aspect of the unfolding Forclosuregate. These notes, he said, are supposed to act as proof that the bank has the right to collect on a mortgage. However, Hunter revealed, as the larger banks purchased mortgages in bundles, many of these promissory notes were lost. Likening the notes to physical dollars, Hunter pointed out that they are &quot;financial instruments,&quot; and, thus, cannot be recreated or copied for official use. As such, he cautioned homeowners who are currently paying a mortgage that &quot;you don't know what they're going to say at the end of 15, 20, 30 years of you paying.&quot; Along those lines, he shared one troubling tale of a man who paid off his mortgage and was then told that the deed to his home was essentially lost in the mire of the Fannie Mae and Freddie Mac meltdown.\n\nLooking ahead to the future, Hunter warned about what he called &quot;the Fed's biggest fear.&quot; He noted that many adjustable rate mortgages will be recast over the next year, resulting in a massive increase in payments for homeowners, peaking in November of 2011. However, the stream of income from the homeowners must continue in order to maintain the economy. Therefore, Hunter theorized that the Fed will take a number of dangerous steps in order to &quot;keep interest rates artificially low until this clears out.&quot; This course of action would result in people staying in their homes and still paying their mortgages, but would also &quot;destroy the dollar while you're doing it.&quot;\n\n\n\n\nTime Travel &amp; Cosmology\n\nDate: 11-15-10\nHost: George Noory\nGuests: J. Richard Gott, Michael S. Roberts, Douglas Hagmann\n\nProfessor of astrophysics at Princeton University, J. Richard Gott spoke about his studies of cosmology, his work with the physics of time travel, and the need for space colonization. Working on the Sloan Survey of the universe, his measurement of what came to be called the Sloan Great Wall was listed in the Guinness World Records as the largest structure in the universe. The structure is a chain or filament that connects various galaxy clusters together, running some 1.37 billion light years across, he detailed.\n\nWe know from looking at the dinosaurs, there are definite extinction events that can wipe out entire species-- so we need to have some &quot;lifeboats,&quot; for the human race, he said. &quot;The goal of the space program...should be to increase our survival prospects by colonizing space, as a life insurance policy against anything bad that might happen on Earth,&quot; he continued. We should plant a colony on Mars, while the space program is intact, he urged.\n\nBased on Einstein's theory of relativity, time travel to the future is known to be possible and people are doing it in a small way today, Gott pointed out. In the future, if someone could take a spaceship at near the speed of light to a destination 500 light years away, when they returned to Earth, 1,000 years would have passed, but because they were traveling so fast, it would have only been 10 years for them. A small example of this effect can be seen with astronaut Sergei Krikalev, who by virtue of his many space flights, has aged 1/48th of a second less than he would have if he'd stayed on the Earth.\n\nAirport Body Scanners\nFirst hour guest, security expert Douglas Hagmann talked about the TSA's new whole-body security scan, which has been drawing increased complaints. &quot;Instead of treating every passenger as a potential terrorist,&quot; we should use profiling and then select those individuals to undergo the increased security checks, he commented. Pilot Michael Roberts, who recently refused both the body scan and physical frisking, also joined the discussion.\n\n\n\n\nUFO Sightings &amp; Investigations\n\nDate: 11-16-10\nHost: George Noory\nGuests: William J. Birnes, Richard C. Hoagland\n\nAuthor, magazine publisher, and host of the History Channel's UFO Hunters, William J. Birnes discussed recent and classic UFO cases, researchers, and the field of ufology itself. For his newest book, Aliens in America, a kind of travel guide to UFO hotspots, he chose cases that met four different criteria-- multiple, credible witnesses, physical trace evidence, government documentation, and government attempts at debunking/disinformation. One such case was the Betty &amp; Barney Hill incident. Among the pieces of evidence was a star map drawn by Betty Hill, showing where one of the alien abductors told her they came from-- thought by some to be the Zeta Reticuli star system.\n\nBirnes also touched on a 1984 UFO sighting at the Indian Point nuclear power plant in New York's Hudson Valley, in which a huge triangular craft hovered over the complex. Since that time the US military has been developing craft that have the ability to throw projections, seem to move at lightning speeds, as well as hover, he added. The mainstream media is focusing more on UFOs in recent years, and this may be due to monetary reasons, as the topic can be a big draw for websites and TV shows, he noted.\n\nAccording to a witness Birnes interviewed for UFO Hunters, there was a live alien humanoid kept by the Eisenhower administration that survived until the 1960s, and researcher J. Allen Hynek met and communicated with the being. In an episode of UFO Hunters that never aired, they showed a mutilated cow that had a strange fetus with a human head, which might have related to alien hybrids, and testing for mad cow disease, he detailed. Birnes also addressed the controversy surrounding researcher David Jacobs and abductee Emma Woods, which UFO Magazine did a cover story on.\n\nSpace News\nFirst hour guest, Richard C. Hoagland talked about several space topics. He reported that the Hayabusa space probe successfully retrieved dust from an asteroid. The purity of the found particles might indicate a type of technology exists on the asteroid they landed on, he suggested. He also weighed in in favor of a one-way colonizing mission to Mars, and opined that the Red Planet may be more Earth-like than is typically thought. Hoagland will be one of the host","torrent":{"xt":"urn:btih:f94755c70f72ffd702f6740e26a2536b482904c4","amp;dn":"Coast+to+Coast+AM+11+-+13+-+10+thru+11+-+18+-+10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f94755c70f72ffd702f6740e26a2536b482904c4","infoHashBuffer":{"type":"Buffer","data":[249,71,85,199,15,114,255,215,2,246,116,14,38,162,83,107,72,41,4,196]},"announce":[],"urlList":[]}}