{"title":"Democracy Now - 22 nov 2010","uid":5975942,"size":449290961,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f9bc8cb04b5e38374787d07e473abfa58bf4fa38&amp;dn=Democracy+Now+-+22+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1290447052,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 22, 2010\n\n- UN: World's Response to Haiti Cholera Epidemic &quot;Completely Inadequate&quot;\n- NATO Official: Children in Kabul Safer than in NYC or London\n- U.S. Forces Likely to Stay in Afghanistan After NATO's 2014 Deadline\n- Poll: 92% of Young Afghan Men Don't Know About 9/11 Attacks\n- U.S. Seeks to Expand Drone Strikes in Pakistan\n- Ireland Requests Massive EU/IMF Bailout\n- Warren Buffett: Trickle-Down Economics Don't Work\n- Settlements Approved for Native Americans and African-American Farmers\n- TSA Chief Defends Use of Full-Body Scanners &amp; Physical Pat-Downs\n- North Korea Reveals New Uranium Enrichment Plant\n- Wild Tigers Could Be Extinct in 12 Years\n- 22 Arrested at Protest Outside School of the Americas\n- Mayor of London to Bush: Stay Away From U.K. or Face Possible Arrest\n\n\nSpecial reports\n\n- Video Report From Afghanistan: How the U.S. Counter-insurgency Campaign Is Failing\n\nAt a conference in Portugal over the weekend, NATO countries agreed to hand over responsibility for Afghanistan's security to Afghan forces by the end of 2014. In his speech, President Obama claimed there has been significant progress in the fight against the Taliban. But reports from the ground in Afghanistan question these upbeat claims about the ongoing NATO operation. Last spring, NATO launched a major operation in the Taliban-held town of Marjah. The offensive was supposed to showcase America's new counter-insurgency campaign and demonstrate that victory is still possible. Independent filmmaker Rick Rowley of Big Noise Films recently traveled to Marjah and discovered the counter-insurgency campaign in crisis.\n\n\n- Anthony DePalma on &quot;City of Dust: Illness, Arrogance and 9/11&quot;\n\nIn New York, a settlement will pay hundreds of millions of dollars to more than 10,000 rescue workers who were exposed to toxic debris after 9/11. We speak with Anthony DePalma, author of the new book, City of Dust: Illness, Arrogance and 9/11. &quot;The dust becomes a metaphor,&quot; DePalma said, &quot;because after those statements come out [about the air being safe to breathe], the rest of the people in New York were left without about the ability to believe anyone. Their trust crumbled, just the way the towers crumbled.&quot;\n\n\n- Chalmers Johnson, 1931-2010, on the Last Days of the American Republic\n\nThe distinguished scholar and best-selling author Chalmers Johnson has died. He passed away in California on Saturday afternoon at the age of 79. During the Cold War, he served as a consultant to the Central Intelligence Agency and was a supporter of the Vietnam War, however, later became a leading critic of U.S. militarism and imperialism. He wrote the book, &quot;Blowback: The Costs and Consequences of American Empire&quot; in 2000, which became a bestseller after the 9/11 attacks. He went on to complete what would become a trilogy about American empire. Today we re-air part of our last interview with Chalmers Johnson from 2007.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:f9bc8cb04b5e38374787d07e473abfa58bf4fa38","amp;dn":"Democracy+Now+-+22+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9bc8cb04b5e38374787d07e473abfa58bf4fa38","infoHashBuffer":{"type":"Buffer","data":[249,188,140,176,75,94,56,55,71,135,208,126,71,58,191,165,139,244,250,56]},"announce":[],"urlList":[]}}