{"title":"Motorhead - Overkill (Live-Germany) (2nafish)","uid":6044083,"size":226277380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fb165895d60cdf820bbda29d8a79ea269755de2a&amp;dn=Motorhead+-+Overkill+%28Live-Germany%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292479625,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Overkill&quot; is a song by the band MotÃƒÂ¶rhead. It was released in 7&quot; and 12&quot; vinyl pressings in 1979. It is backed with B-side &quot;Too Late Too Late&quot; which appears on the CD re-issues of the Overkill album. Early copies came with a free 'Overkill' badge. The single reached number 39 in the UK Singles Chart.\n\nOn March 9, 1979 the band played this song on the BBC TV Top of the Pops show, to support the release of the single. The song is a live favourite and is frequently featured in Motorhead concerts, often in an extended version.\n\nThe artwork on the sleeve was created by Joe Petagno, based on his design for the album's cover.\n\n&quot;Overkill&quot; was re-recorded by MotÃƒÂ¶rhead to be a playable track in the video game Guitar Hero World Tour.\n\nThe song is featured as a track on the game SSX on tour.\n\nIn 1995, during the recording of the album Load, &quot;Overkill&quot;, &quot;Damage Case&quot;, &quot;Stone Dead Forever&quot; and &quot;Too Late Too Late&quot; were covered by Metallica, as a birthday gift for Lemmy, and released in 1996 on their &quot;Hero of the Day&quot; single. The single was released as a two CD single, the &quot;Overkill&quot; track is the second track on the first CD single, and was also used on the second disc of their 1998 cover album Garage Inc.. The single reached 60 on the U.S. Hot 100, 1 on the U.S. Mainstream Rock, and 17 on the U.K. Singles charts. Some of the songs were played live on a brief tour along with other tracks from Garage Inc. in 1998 which concluded at the Roseland Ballroom in New York City. The songs would finally be played again during the 2009 World Magnetic Tour.\n\nThe song was covered by Overkill, who took their name from the Overkill album by MotÃƒÂ¶rhead, and appears as the first track on their 1999 album Coverkill.\n\nIn 2008, German heavy metal band Grave Digger included a cover version of the song on their EP Pray.\n\nOverkill is the second album released by MotÃƒÂ¶rhead, in 1979, and their first for Bronze Records. It peaked at number 24 on the UK charts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:fb165895d60cdf820bbda29d8a79ea269755de2a","amp;dn":"Motorhead+-+Overkill+%28Live-Germany%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb165895d60cdf820bbda29d8a79ea269755de2a","infoHashBuffer":{"type":"Buffer","data":[251,22,88,149,214,12,223,130,11,189,162,157,138,121,234,38,151,85,222,42]},"announce":[],"urlList":[]}}