{"title":"Are you equal? The debate on multiculturalism - Michael Rizzo","uid":5940134,"size":366244000,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fccc83afda88bddd53aa4c1ce91d7d6bbaa651c7&amp;dn=Are+you+equal%3F+The+debate+on+multiculturalism+-+Michael+Rizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1289138611,"description":"This should be an informative video that you should find compelling to\nview so as to perhaps bring about a re-examination of your own views on what\ntolerance you allow those who do not have a fair attitud towards\nEuropeans wanting to prsenve their spirit and character in the best\nform it is to be found in, on this entire earth.\n\nThe infliction of non-Euro sensibilities and cultures on the peoples\nof Irish sensibilities is a clear travesty that must be checked.\n\nIs everyone in fact equal?\n\nIf you watch the movie we posted for you here (Pirates XXX) you'll see\nan example of why that is a ludicrous idea.\n\nIn this movie (Pirates XXX), we are shown a demonic mindset that enjoys the thrill\nof throwing a beautiful; Irishwoman overboard a ship, in order to feed the sharks\nand his perverse idea of what is &quot;pleasurable&quot; an idea for the inane. The man is \nin any vent perhaps &quot;not red blooded&quot; enough to have other designs instead with\nwhat to do with this planet of ours.\n\nWhy would anyone want to perpetrate such ideas of humour, or valour even?\n\nThere is a substantial amount of published research in Personality and social\ntheory (Im setting up a public website on this soon) that explains differentorientations and personality types that form (even cross-cultural and across racial boundaries too) that have the sorts of characteristics that bring them together in what is the current drive towards world domanition of the sort that seeks to annihilate the Euro culture of irish beauty in favout of he inane, under\nthe ruse of what is called &quot;equal rights&quot; for all the inane as that is who can be described this way - equally inane.\n\nMany of the movies we post here show this dicotomy in human affairs and human existance - good versus evil, human versus geek.\n\n\nWho will win? We successfully defended our views in a recent court case here\nas these views were very much at the heart of the proceedings that had\nbeen commenced. I spoke on thes matters with great conviction. We are certain\nto change the course this country is headed in with a complete repudiation of\nall forms of &quot;affirmative acion&quot; and multicultural baggage linked to this all,\nequally.\n\n\nThe world belongs to those of Irish spirit, I say! And this, based on\nnothing other than true Christian merit.\n\nI have always thought utopia would have required that the best of the British\nlead the world, along with their like minded folks from Italy France Germany\nand Ireland/Australia.\n\nThat is the combination that can yield the best of a compatible culture that is \nsustainable and arguably supreme in merit to what is being advocated now by the\nminds of demonic types instead that do the stuff in cultural destruction of\nour spirit similar in nature to what the pirate I describe does in the movie.\n\nNot all pirates are &quot;equal&quot; therefore.\n\n\nMichael Rizzo Chessman\n\n\nView the video and speak out for your own in a Chritianly way of true fairness.\n\nBy the way, I am not a geek, but an actor on the stage professionally in \npast stints in British boarding school and University career. I am in fact strong\nwith the blood of a true Irishman - from Italy in fact! so there! \n\nI am an Honours laureate in my work in Political Phiolosphy and even Psychology\nat the University of Alberta coursework.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:fccc83afda88bddd53aa4c1ce91d7d6bbaa651c7","amp;dn":"Are+you+equal%3F+The+debate+on+multiculturalism+-+Michael+Rizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fccc83afda88bddd53aa4c1ce91d7d6bbaa651c7","infoHashBuffer":{"type":"Buffer","data":[252,204,131,175,218,136,189,221,83,170,76,28,233,29,125,107,186,166,81,199]},"announce":[],"urlList":[]}}