{"title":"Democracy Now - 12 nov 2010","uid":5952611,"size":452472663,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fce62610462fa7ebe5d3f230709b3fb817dfc434&amp;dn=Democracy+Now+-+12+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1289580490,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 12, 2010\n\n- Obama Defends $600B Fed Spending as G20 Ends\n- Death Toll in Haitian Cholera Outbreak Reaches 800\n- Burmese Pro-Democracy Leader Suu Kyi Nears End of Prison Term\n- Clinton Avoids Mention of Settlement Building at U.S.-Israel Talks\n- Wall St. Banks Exploiting Reform Loophole to Avoid Volcker Rule\n- DNA Testing Casts Doubt on Guilt of Executed Texas Prisoner\n- Media Watchdogs Criticize Dobbs Hiring at Fox Business Network\n\n\nSpecial reports\n\n- East Timorese Journalist Marks 19th Anniversary of Santa Cruz Massacre\n\nDemocracy Now! is in Argentina for the tenth World Association of Community Radio Broadcasters conference, an annual meeting of hundreds of community radio stations from around the world. Among those in attendance is Prezado Ximenes from Radio Lorico in East Timor. Nineteen years ago today in the Timorese capital of Dili, he survived the Santa Cruz massacre, in which Indonesian soldiers gunned down more than 270 Timorese.\n\n\n- A Look at Argentina's Economic Rebellion and the Social Movements That Led It\n\nAs we broadcast from Buenos Aires, we look at the economic rebellion of Argentina that took place after the government defaulted on $95 billion in foreign loans in 2001. The next two years saw record protests and social upheavals that changed the country's political landscape. Today, Argentina's current president Cristina Kirchner is in South Korea taking part in the G20 summit. We speak with Ezequiel Adamovsky, a historian and activist who teaches at the University of Buenos Aires.\n\n\n- &quot;Nieto Recuperado&quot;-Born to Parents Disappeared by Argentina's Dictatorship, Kidnapped and Raised by a Military Family, a 'Recovered Grandchild' Finds His Way Home\n\nWe speak with Manuel GonÃƒÂ§alves, a &quot;nieto recuperado&quot; or a &quot;recovered grandchild&quot; in Argentina. He is one of the thousands of children born to parents who were disappeared during the dictatorship. These children were born in captivity then kidnapped by the military and given away to government supporters or military families. Some of them have found their way back to their families.\n\n\n- Argentine Torture Survivor Patricia Isasa Tells of Her Struggle to Bring Her Torturers to Justice\n\nWe speak with Patricia Isasa, a torture survivor from Argentina's military dictatorship. She was a sixteen-year old student union organizer in 1976 when she was kidnapped by police and soldiers, and tortured and held prisoner without trial for two and a half years at one of the 585 clandestine detention and torture centers set up during the dictatorship. After a long legal battle to bring her torturers to justice, six of her nine torturers were recently sentenced to prison.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:fce62610462fa7ebe5d3f230709b3fb817dfc434","amp;dn":"Democracy+Now+-+12+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fce62610462fa7ebe5d3f230709b3fb817dfc434","infoHashBuffer":{"type":"Buffer","data":[252,230,38,16,70,47,167,235,229,211,242,48,112,155,63,184,23,223,196,52]},"announce":[],"urlList":[]}}