{"title":"SimCity.Creator.NTSC.wbfs.R4CE69.WII","uid":6084482,"size":398458906,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:fda8bf5d0faa7ac871eddc339d3856a22c27eaf8&amp;dn=SimCity.Creator.NTSC.wbfs.R4CE69.WII&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"stretch25","files":2,"time":1294261939,"description":"SimCity Creator follows the basic SimCity formula that sees players managing a city and placing residential, commercial, and industrial zones for buildings in addition to facilities such as police stations, hospitals, seaports, and stadiums. However, players are also able to customize the look of their buildings by choosing from several themes hero buildings that gives themes to the city such as Egyptian, Roman, Japanese, European, Las Vegas, and near-future styles, in addition to ones that result in a crystal or confectionery-like appearance to buildings. Players are also be able to tour their city, rendered in 3D graphics, in a helicopter or airplane.[2] In contrast to the DS title of the same name, players are not able to greatly advance the technology of the city short of the examples above.\n\nTaking advantage of the Wii, the pointer function of the Wii Remote is used to directly draw roads and train tracks onto the map. Cities can also be shared among players through WiiConnect24.[2] The game's advisers have been redesigned to resemble MySims characters.[citation needed]\n\nSimilar to SimCity 4, SimCity Creator features a day and night cycle, as well as a seasonal cycle last seen in the SNES version of SimCity.[citation needed] Players may tackle disasters including dinosaurs, giant robots, tornadoes, aliens, and meteor impacts.[2]\n\n\n\n","torrent":{"xt":"urn:btih:fda8bf5d0faa7ac871eddc339d3856a22c27eaf8","amp;dn":"SimCity.Creator.NTSC.wbfs.R4CE69.WII","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fda8bf5d0faa7ac871eddc339d3856a22c27eaf8","infoHashBuffer":{"type":"Buffer","data":[253,168,191,93,15,170,122,200,113,237,220,51,157,56,86,162,44,39,234,248]},"announce":[],"urlList":[]}}