{"title":"Coast to Coast AM - 11 - 25 - 10 - Secret Door XII","uid":5989628,"size":55121363,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fdc8436e0c2fb95a4a38bd03ff8e8c7cf3a6761b&amp;dn=Coast+to+Coast+AM+-+11+-+25+-+10+-+Secret+Door+XII&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xAlkaline13x","files":7,"time":1290844818,"description":"Behind the Secret Door XII\n\nDate: 11-25-10\nHost: George Noory\nGuests: John Hogue, Steve Alten, John Gray, Lloyd Pye\n\nOn Thanksgiving night George Noory opened the Secret Door to four different surprise guests. Popping through first was prophecy expert John Hogue who shared insights and predictions. Regarding the economy, we'll probably remain stuck in &quot;neutral gear&quot; for the next six months, he said, as political gridlock continues. This cycle will hopefully be broken by July, 2011, with a move toward common ground, he added. Hogue also cautioned global warming will likely be an issue for the next 200 years, but after that another ice-age cycle could take place.\n\nIn the 2nd hour Steve Alten discussed his new novel Grim Reaper: End of Days that explores a scenario involving biochemical warfare, in which plague-infected Manhattan neighborhoods serve as an allegory to the nine circles in Dante's Inferno. He also touched on his interest in the Kabbala and Mayan prophecy, noting that the last four Mayan cycles ended in cataclysm.\n\nThird through the Secret Door was John Gray, an expert in the fields of communication and relationships. He spoke about various natural supplements which can aid in optimizing one's health and mental balance including lithium orotate which, when taken in small does, helps to calm the mind and Tongkat Ali, a natural testosterone booster for men.\n\nIn the last hour author and researcher Lloyd Pye discussed human origins and the Starchild Skull. DNA testing is still in the works to determine if the skull has non-human origins, he reported. He also reviewed the current status of the late Zecharia Sitchin's plan to test the DNA of the remains of Queen Puabi of Sumeria. Pye said he concurred with Sitchin's interpretation of Sumerian texts which suggests the human race was genetically engineered around 200,000 years ago.\n\nWebsite(s):\nhogueprophecy.com\nstevealten.com\nmarsvenus.com\nstarchildproject.com\nlloydpye.com\n\nBook(s):\nPredictions for 2010\nNostradamus and the Antichrist: Code Named MABUS\nGrim Reaper: End of Days\nVenus on Fire, Mars on Ice\nMen Are from Mars, Women Are from Venus\nStarchild Skull Essentials","torrent":{"xt":"urn:btih:fdc8436e0c2fb95a4a38bd03ff8e8c7cf3a6761b","amp;dn":"Coast+to+Coast+AM+-+11+-+25+-+10+-+Secret+Door+XII","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdc8436e0c2fb95a4a38bd03ff8e8c7cf3a6761b","infoHashBuffer":{"type":"Buffer","data":[253,200,67,110,12,47,185,90,74,56,189,3,255,142,140,124,243,166,118,27]},"announce":[],"urlList":[]}}