{"title":"Anti-Trojan Elite 5.2.4 [Portable] ","uid":6025113,"size":10868122,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fde9e5c2c695d2569641a01c9772a267404bf983&amp;dn=Anti-Trojan+Elite+5.2.4+%5BPortable%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chusca","files":3,"time":1291904945,"description":"Detecta y elimina todo tipo de troyanos y keyloggers de tu PC. Anti Trojan Elite encuentra y erradica del PC troyanos y demÃƒÂ¡s keyloggers (programas que interceptan todas las pulsaciones realizadas en el teclado). Los detecta in fraganti, es decir cuando ÃƒÂ©stos estÃƒÂ¡n activos, y los elimina al instante (previo registro del programa). Pero no sÃƒÂ³lo esto sino que Anti Trojan Elite, tambiÃƒÂ©n es un sistema de seguridad bÃƒÂ¡sico basado en un monitoreo del sistema. La detecciÃƒÂ³n llevada a cabo puede ser general, el sistema y todas sus unidades de disco, o mÃƒÂ¡s especifica, como carpetas y ficheros concretos. Para impedir la futura instalaciÃƒÂ³n de nuevos troyanos y keyloggers, es aconsejable activar el monitoreo del sistema, que permite detectar cambios importantes en el Registro de Windows, trÃƒÂ¡fico anÃƒÂ³malo de red, procesos sospechosos, etc. Adicionalmente, lleva incluidas funciones que mejoran el rendimiento de tu PC, permite bloquear el Registro, reiniciar cuando un proceso bloquea el sistema, desactivar el autorun de tus unidades de CD y DVD y, por ÃƒÂºltimo, permite reparar Internet Explorer devolviÃƒÂ©ndole todo el resplandor del primer dÃƒÂ­a.\n- Windows 95/98/98SE/Me/2000/NT/XP/2003/Vista/7 |14051210\n-Idioma: InglÃƒÂ©s\n\n\n","torrent":{"xt":"urn:btih:fde9e5c2c695d2569641a01c9772a267404bf983","amp;dn":"Anti-Trojan+Elite+5.2.4+%5BPortable%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fde9e5c2c695d2569641a01c9772a267404bf983","infoHashBuffer":{"type":"Buffer","data":[253,233,229,194,198,149,210,86,150,65,160,28,151,114,162,103,64,75,249,131]},"announce":[],"urlList":[]}}