{"title":"Akumajou Dracula X - Gekka no Yasoukyaku (SotN Retranslation)","uid":6105340,"size":347005165,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:fdf819aa1a5330391127947ec6893531b64167f5&amp;dn=Akumajou+Dracula+X+-+Gekka+no+Yasoukyaku+%28SotN+Retranslation%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DarthSieger","files":1,"time":1295136152,"description":"Anyone who happens to be a fan of the Castlevania series (known as Akumajou Dracula or &quot;Demon Castle Dracula&quot; in Japan) at the very least knows of the gem that is Symphony of the Night. It was the game that ushered in the era of what became known as &quot;Castleroid,&quot; a gameplay style that resembled a combination of traditional Castlevania gameplay mixed with the open ended exploration known to another popular game series, Metroid. The game had RPG elements as well, as Alucard, the main character of the game (the first time in the series that a Belmont was not the main playable character)would earn experience points, money, and sometimes even items from defeating enemies in the castle.\n\nOne of the few drawbacks of the game that many fans complained about, or found comical at best, was the voice acting. Symphony of the Night was notable for its poor and sometimes over-the-top voice acting and poorly translated dialogue. This was fixed in the PSP release of Castlevania: Dracula X Chronicles, which was a remake of the classic Castlevania: Rondo of Blood, where Symphony of the Night was included as unlockable content and the voice acting, as well as the translation of the game, was greatly improved.\n\nThis ISO is a retranslation of the original Japanese game. The Japanese voice acting is kept intact but the text dialogue has been reworked to be an even more accurate translation than the version included in Castlevania: Dracula X Chronicles.\n\nAs always, enjoy. :)","torrent":{"xt":"urn:btih:fdf819aa1a5330391127947ec6893531b64167f5","amp;dn":"Akumajou+Dracula+X+-+Gekka+no+Yasoukyaku+%28SotN+Retranslation%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdf819aa1a5330391127947ec6893531b64167f5","infoHashBuffer":{"type":"Buffer","data":[253,248,25,170,26,83,48,57,17,39,148,126,198,137,53,49,182,65,103,245]},"announce":[],"urlList":[]}}