{"title":"Aiden - One Love (2nafish)","uid":6023266,"size":143300612,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fef1f668bbc19f0f002000e109a9f95638500920&amp;dn=Aiden+-+One+Love+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1291868368,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;One Love&quot; is the first single from Aiden's third album, Conviction. As a single it was released in early September of 2007. The song was first played on the Lostprophets and Taking Back Sunday tour in early April and went on to be played at Wembley Arena on the final night of the Lostprophets and Taking Back Sunday tour. The Song has also been played at the Download Festival leaving fans with speculation about it becoming the first single before it was announced.\n\nAiden updated their myspace and added &quot;One Love&quot; shortly followed by &quot;Teenage Queen&quot;. The song then became available on iTunes. There is also a video promo posted on Victory Records' YouTube account.\n\nA remix of the song was made in collaboration with The Legion of Doom for the movie Resident Evil: Extinction.\n\nIn a recent interview vocalist wiL Francis explained the meaning of the song by quoting: &quot;It's a love story, it's about being in love with something that'll destroy you. It's about a friend of mine over doing some heroin, and witnessing the progression from normalcy to death, through a series of horrible things that happen as a result of using drugs and it's about being in love with that substance, it could be anything, not just drugs, just the thing that would totally destroy your f***ing life. Even though you're so in love with it.&quot;\n\nThe music video was recorded in Los Angeles, California between June 13 and 15, and debuted on September 13, 2007. Directed by Nathan Cox, it features MySpace celebrity Jeffree Star. The video supposedly represents singer wiL Francis' love for a girl that drove him to near suicide.\n\nConviction is the name of Aiden's third studio album which was released August 21st, 2007. It is the first of their releases to carry a Parental Advisory sticker although it is not the first to contain profanity. Best Buy editions of the album contain the 2 exclusive bonus tracks &quot;Here Lies the Waste&quot; and &quot;So Far Away&quot;. The album has marked a completely different musical direction for the band, as it bears little resemblance to their previous Nightmare Anatomy.\n\nThe first single from the album, &quot;One Love&quot;, was released on their MySpace page on July 23, 2007.\n\nThe band finished recording after their brief UK arena tour supporting Lostprophets and returned to the UK again to play the Download Festival before doing a more complete tour in support of the album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:fef1f668bbc19f0f002000e109a9f95638500920","amp;dn":"Aiden+-+One+Love+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fef1f668bbc19f0f002000e109a9f95638500920","infoHashBuffer":{"type":"Buffer","data":[254,241,246,104,187,193,159,15,0,32,0,225,9,169,249,86,56,80,9,32]},"announce":[],"urlList":[]}}