{"title":"ACDC - Back In Black (1980) WMA320","uid":6068343,"size":106556364,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ffdfbfd0b685ed18ced6761f3587ad5049230003&amp;dn=ACDC+-+Back+In+Black+%281980%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1293494087,"description":"Released in 1980, &quot;Back In Black&quot; featured new lead singer Brian Johnson who replaced former singer Bonn Scott who died months earlier. With the death of Scott, there were sceptics that thought this was the end of the hard rocking Aussy band. But to their surprise &quot;Back In Black&quot; was a huge success with absolutely no filler tracks. The album produced a number of hits with the title &quot;Back In Black&quot;, &quot;Hells Bells&quot; and &quot;You Shook Me All Night Long&quot;. In my opinion some of the best songs on the album were not hits such as &quot;Shoot To Thrill&quot;, &quot;What Do You Do For Money Honey&quot; and &quot;Shake A Leg&quot;. With the addition of Johnson to the line up the band seemed to be stronger than ever, and Angus Young's guitar licks are absolutely amazing. Just listen to the lead guitar in &quot;Shake A Leg&quot; and I'm sure you'd agree. Numerous soundtracks have included AC/DC songs from this album, notably the Steven King film &quot;Maximum Overdrive&quot; which featured &quot;Hells Bells&quot; and &quot;You Shook Me All Night Long&quot;. This newley remastered edition of &quot;Back In Black&quot; now on the Epic Label surpasses the older 1994 remastered version in that the volume is pumped up higher, there's definately more bottom end and mid-range. I actually listened to both versions of the disc and this new one blows the other away. The digipack that stores the new remastered version is attractive and there's an excellent booklet inclosed with color photos, etc. of the band. If you want to hear hard rock the way it was meant to be then pick this superb cd up and enjoy. \n\nby highway_star\n\nTRACKLIST:\n\n01 - Hells Bells.wma                         \n02 - Shoot To Thrill.wma                     \n03 - What Do You Do For Money Honey.wma      \n04 - Givin The Dog A Bone.wma                \n05 - Let Me Put My Love Into You.wma         \n06 - Back In Black.wma                       \n07 - You Shook Me All Night Long.wma         \n08 - Have A Drink On Me.wma                  \n09 - Shake A Leg.wma                         \n10 - Rock And Roll Ain't Noise Pollution.wma\n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:ffdfbfd0b685ed18ced6761f3587ad5049230003","amp;dn":"ACDC+-+Back+In+Black+%281980%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffdfbfd0b685ed18ced6761f3587ad5049230003","infoHashBuffer":{"type":"Buffer","data":[255,223,191,208,182,133,237,24,206,214,118,31,53,135,173,80,73,35,0,3]},"announce":[],"urlList":[]}}